{
    "description": "En este curso trabajarás la definición, el desarrollo y el cierre de un proyecto de Tecnologías de la Información. Tu dedicación y constancia serán la clave para alcanzar el éxito deseado, a través de las metas planteadas. Encontrarás una serie de actividades para desarrollar el curso AP de TI, el tiempo propuesto para éste será de 40 horas totales. Cabe mencionar que deberás dedicar 10 horas de estudio mínimo a la semana, por lo que tú serás responsable de administrar el tiempo que le dedicarás al MOOC de Administración de Proyectos de Tecnologías de la Información. Te recomendamos planificar tu tiempo para poder realizar cada una de las actividades que se te solicitan como complemento a los contenidos temáticos para evitar retrasos.\n\nEs importante que pongas mucha atención en los recursos que se te presentan dentro del contenido, ya que te servirán para orientarte en la definición, desarrollo y cierre de tu proyecto informático. A continuación te mencionaremos cómo estará estructurado el curso, lo cual te facilitará su comprensión.\n\nEl curso comprende tres grandes bloques y a cada uno corresponde una meta, de las que se desarrolla el contenido que debes estudiar, los cuales muestran y describen las etapas de administración de un proyecto de Tecnologías de Información (TI). Lo anterior se apoya en distintas actividades y ejercicios, además de los recursos complementarios proporcionados. Con la finalidad de definir un proyecto de TI, se mostrará el análisis de técnicas y metodologías para el desarrollo y el cierre del mismo, entre otros aspectos que identificarás a lo largo del contenido.\n\nComo parte de tu autoaprendizaje, se recomienda que realices las lecturas sugeridas dentro de los bloques y las investigaciones a través de búsquedas en Internet y bibliografías especializadas en la materia de Administración de Proyectos para complementar tu formación y conocimiento. Identificar técnicas y metodologías para administrar un proyecto de TI (ciclo de un proyecto).\n\tDefinir y delimitar un proyecto de TI.\n\tIdentificar herramientas, metodologías y técnicas para el entorno de desarrollo y el ciclo de vida del software.\n\tRegistrar e identificar los avances o retrasos del proyecto de TI para visualizar riesgos y minimizar daños potenciales al desarrollo.\n\tRealizar la entrega del proyecto junto con la documentación correspondiente (lecciones aprendidas, experiencias, acuerdos legales, etc).",
    "instructors": "Ricardo Ángel Aguilar Pérez",
    "requirements": "Nociones de alguna metodología de programación.\n\tPrincipios en la administración y planeación de proyectos.\n\tFundamentos de contabilidad más no son indispensables.  ",
    "length": "4 weeks",
    "effort": "10 horas\/semana",
    "prices": "Free",
    "institutions": "MéxicoX",
    "subjects": "Computer Science",
    "language": "Español",
    "url": "https:\/\/www.edx.org\/course\/administracion-de-proyectos-de-mexicox-upevipn03x",
    "title": "Administración de proyectos de Tecnologías de la Información"
}