{
    "description": "Este curso te ayudará a tomar el control sobre los datos, a darles sentido y, de esta manera, usarlos para mejorar tus decisiones.\n\nThis course will help you take control over data and use it to improve your decisions.\n\n**Este curso será impartido en español**\nEn esta era de la información, los datos están disponibles en todos lados y creciendo a una tasa exponencial. ¿Cómo podemos darle sentido a todos los datos? ¿Cómo aprovechamos los datos en el momento de tomar decisiones? ¿Cómo utilizamos los datos para que nos ayuden a guiar la planificación estratégica de nuestras políticas? Tanto si eres ciudadano como planificador de políticas deberías poder responder a estas preguntas.\nEn este curso podrás fortalecer tus capacidades de comprensión e interpretación de datos utilizando la plataforma desarrollada por el BID “Números para el Desarrollo.” A través de estas herramientas podrás mejorar tu proceso de toma de decisiones estratégicas basándolas en el análisis de datos, especialmente en el desempeño de la función pública.\nAl finalizar el curso contarás con instrumentos para navegar entre los datos, realizar e interpretar visualizaciones y comprender los diferentes tipos de análisis de datos según el problema estudiado.\nTranquilo, no se trata de un curso de estadística, sólo vas a adquirir los conocimientos necesarios para interpretar gráficas o reportes estadísticos. Finalmente, adquirirás las bases para fundamentar tus decisiones en datos comprobables, más allá de tu intuición.\nEl curso está compuesto por diferentes actividades prácticas donde se podrán aplicar los conocimientos adquiridos, casos reales del BID donde se promueve el análisis y se presentan las realidades a las que están expuestos los funcionarios públicos de la región y algunos retos creativos que tienen un nivel más alto de complejidad.\nFinalmente, el curso tiene lecturas teóricas, videos que permiten generar una mejor compresión de temas del curso y de foros de discusión donde se abren espacios para la construcción grupal alrededor de una pregunta orientadora.\n\nIn this period of information, data is available everywhere and growing at an exponential rate. How can we use data? How do we take advantage of data when making decisions? How do we use data to guide strategic planning of policies?. Whether you are a citizen or policy maker you should be able to answer these questions.\nIn this course you would strengthen your skills on understanding and explaining data by using the IDB platform \"Numbers for Development.\" Through these tools you can improve the process of making strategic decisions based on the analysis of data, especially in the performance of public functions.\nAfter completing the course you will have instruments to navigate between data, perform and interpret displays and able to understand different types of data analysis according to the problem studied.\nDon’t panic, it is not a statistics course; you’re going to acquire the knowledge to understand graphs and statistical reports. Finally, you will acquire tangible foundation to base your decisions on proper data, beyond your intuition.\nThe course consists of various practical activities where you can apply the acquired knowledge, there are real case studies of IDB, where the analysis is needed together with real public officials reality when working in the region, also there are some creative challenges at higher-level off complexity.\nFinally, the course has readings, videos allowing the generation of better understanding of the course and open to discussion among the participants. La importancia de la relación entre el análisis e interpretación de datos y  la toma de decisiones.\n\tCómo identificar tu  problema de estudio y las variables para su análisis.\n\tQué metodologías de análisis de datos son más adecuadas para ciertos tipos de estudios\n\tQué tipos de visualización existen y cómo interpretarlas.\n\tLa aplicación de los datos en la planificación estratégica y la evaluación de políticas.\n \n\nThe importance of the relationship between analysis and interpretation of data in decision making\n\tHow to identify your problem and the variables for analysis\n\tWhat data analysis methodologies are more suitable for certain types of studies\n\tWhat types of displays exist and how to interpret them\n\tThe application of the data in strategic planning and policy evaluation",
    "instructors": [
        "Ivette Fis de Melo",
        "Norma Palomino"
    ],
    "requirements": "None",
    "length": "5 weeks",
    "effort": "5 horas\/semana",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $25",
    "institutions": "IDBx",
    "subjects": "Business & Management",
    "language": "Español",
    "url": "https:\/\/www.edx.org\/course\/datologia-la-toma-de-decisiones-basada-idbx-idb10x",
    "title": "Datología: La toma de decisiones basada en datos | Datalogy: Data-driven decision making"
}