{
    "description": "Las personas promedio en Latinoamérica tienen instaladas alrededor de 95 apps en su teléfono, ¿Cuántas tienes tú?, ¿Cuántas usas seguido?\n\nEn este curso aprenderás  los aspectos más importantes en la construcción de apps de forma profesional para Android, se desarrollarán diferentes aplicaciones en cada unidad que te permitirán conocer los temas más comúnmente utilizados.\n\nConocerás herramientas  que se usan en el día a día cuando te dedicas al desarrollo de  aplicaciones móviles, trabajarás con los APIs más modernos,  con aplicaciones hechas por tí que son muy parecidas a las aplicaciones que usas  todos los días como mensajería, redes sociales, fotografías, etc.\n\nLo que se busca es brindar el conocimiento y la experiencia necesarios para que todos sean  desarrolladores profesionales de aplicaciones en Android. Aprenderás sobre:\n\nPatrón MVP\n\tInyección de dependencias\n\tConexiones para consumir APIs\n\tAlmacenamiento de datos de forma local y remota\n\tUso de hardware como cámara y GPS\n\tPruebas (unitarias y de interfaz gráfica) así como Interacción con Android Wear",
    "contents": "Course Syllabus\n        Unidad 0\nRepaso\nAndroid Studio, actividades, fragmentos, intents\n Unidad 1\nHaz tu propio Messenger (Aplicación de chat)\nOrganiza tus apps para que sigan MVP y construye una aplicación de mensajería que funciona en tiempo real como Whatsapp, Telegram, Messenger, etc\nModel-View-Presenter, RecyclerView, ViewHolder, Adapter y Firebase\n Unidad 2\n#EsHoraDelHashTag (Cliente de Twitter)\nConoce elementos de navegación y almacenamiento de datos además de conectarte al API de Twitter para tener autenticación y construir tu propio cliente con tus características preferidas.\nNavegación con tabs, ViewPager, autenticación, almacenamiento, consumo de API\n Unidad 3\nAhora integra con Facebook (Aplicación de control de recetas de cocina)\nIntegra tu app con Facebook, envía notificaciones push para avisar al usuario de nuevo contenido y muestra el resultado en algún wearable\nFacebook SDK, GCM, notificaciones, Integración con Android wear\n Unidad 4\nTu red social de fotografías!\nToma fotografías y compártelas en redes sociales, agrega soporte de hardware con la cámara y GPS para visualizar en un mapa.\nCámara, Google Play Services, GPS, mapas\n Unidad 5\nUn App infalible?  (Aplicación de toma de notas)\nHaz tu app infalible realizando pruebas automatizadas y conoce un poco más de las herramientas de las que dispones con graddle.\nGraddle, Unit testing (JUnit4, Mockito), UI testing(Espresso)",
    "instructors": "Adrián Catalan",
    "requirements": "Conocimiento de algún lenguaje de programación orientado a objetos, de preferencia Java y opcionalmente conocimiento básico de Android.",
    "length": "6 semanas",
    "effort": "5-6 horas\/semana",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "GalileoX",
    "subjects": "Computer Science",
    "language": "Español",
    "url": "https:\/\/www.edx.org\/course\/desarrollo-de-aplicaciones-profesionales-android-galileox-ctec001x",
    "title": "Desarrollo de aplicaciones profesionales para Android"
}