{
    "source": "Coursera",
    "description": "¿Has tenido que resolver un mismo problema varias veces?, por ejemplo, al salir de viaje o preparar una reunión con amigos. Y cada vez, ¿tuviste que volver a pensar en todo lo que hay que hacer, cuáles pasos y en qué orden? Precisamente lo que busca este curso es proporcionarte las herramientas necesarias con las que identificarás, analizarás y plantearás soluciones efectivas para estas situaciones. Así, al encontrarte con el mismo problema, ya sabrás una manera de resolverlo.En este curso introductorio a la computación, desarrollarás el razonamiento estructurado necesario para analizar problemas básicos y resolverlos utilizando la reflexión lógica y el pensamiento algorítmico. De igual manera, reconocerás los elementos que están a tu alcance y cómo los puedes utilizar efectivamente para lograr tus objetivos.Al finalizar el curso, aprenderás a plasmar soluciones en términos computacionales a través de diagramas de flujo o pseudocódigo. Además, podrás trasladar estas soluciones a herramientas como hojas de cálculo que te serán útiles en tus actividades diarias, personales y profesionales. ¿Qué es un algoritmo? ¿Cómo se hace un diagrama de flujo? ¿Qué es un pseudocódigo? ¿Cómo me pueden ayudar a resolver problemas cotidianos?\n\nEste curso básico de computación te ayudará a desarrollar el pensamiento algorítmico necesario para solucionar problemas en forma estructurada.",
    "contents": "Semana 1 - Razonamiento algorítmico y metodología para la solución de problemasAnálisis y solución de problemas empleando algoritmos y diagramas de flujoEntrada y salida de datos Expresiones aritméticas y operador de asignaciónSolución de problemas con expresiones aritméticasSemana 2 - Estructuras de control selectivasProblemas que involucran toma de decisionesEspecificación y funcionamiento de la estructura de control selectiva Operadores relacionales (lógicos)Semana 3 - Estructuras de control repetitivasProblemas que involucran situaciones repetitivasEspecificación de un estatuto de repetición para formar ciclosContador y acumuladorSemana 4 - Aplicación de estructuras cíclicas Solución de problemas utilizando estatutos de repetición simpleSemana 5 - Introducción al ambiente de hoja de cálculoElementos básicos de una hoja de cálculoReferencias absolutas y referencias relativasCreación de fórmulaJerarquía de evaluación de los operadores aritméticosUso de rangosSemana 6 - Solución de problemas con hoja de cálculoFunciones matemáticasFunciones selectivas",
    "requirements": "Se requiere tener conocimientos elementales de las ciencias básicas de nivel medio-superior.",
    "effort": "4-6 hours\/week",
    "language": "es",
    "url": "https:\/\/www.coursera.org\/course\/pealgoritmico",
    "title": "Pensamiento algorítmico",
    "courseraId": "1426",
    "subjects": "Computer Science: Theory"
}