{
    "description": "Descubre la programación orientada a objetos y resuelve problemas con sistemas computacionales.\n\nEn este curso trabajarás con los fundamentos de la programación orientada a objetos para la resolución de problemas en sistemas computacionales.\n\nTu empeño y dedicación serán cruciales para culminar con éxito las metas que hemos diseñado para ti, por lo que deberás dedicarle 12 horas de estudio a la semana; administra tu tiempo adecuadamente. Te sugerimos realizar un plan de trabajo para que consideres las fechas límites de las actividades y evitar atrasos. Por otra parte es importante que pongas mucha atención en todos los recursos que te ofrecemos, los cuales refuerzan tu conocimiento para culminar el curso satisfactoriamente.\n\nPara facilitar la comprensión y asimilación de los contenidos del curso, hemos diseñado videos, ilustraciones, animaciones, tutoriales, documentos adicionales y ejemplos que debes analizar y relacionar con todo lo que haces en tu vida diaria. Asimismo, pondrás en práctica tus conocimientos mediante actividades que te servirán para conocer tu nivel de dominio de cada apartado y te servirán para acreditar tu curso. ¿Qué aprenderá?\n\nRepresentar el concepto de algoritmo en ejercicios de programación.\n\tIdentificar elementos de programación (variables, funciones, operaciones, sentencias de control) para el desarrollo de código escrito en lenguaje Java.\n\tOrdenar líneas de código en lenguaje Java (sintaxis, semántica) para el desarrollo de sistemas computacionales.\n\tReconocer la aplicación del concepto de programación orientada a objetos (abstracción, polimorfismo, herencia y encapsulamiento) en el modelado de soluciones para problemas computacionales.\n\tConocer temas avanzados de Java (interfaces, excepciones, concurrencia, palabras reservadas) para la programación orientada a objeto.",
    "instructors": "Jesús Alexander Alvarado Gutiérrez",
    "requirements": "Ninguno",
    "length": "4 weeks",
    "effort": "12 horas\/semana",
    "prices": "Free",
    "institutions": "MéxicoX",
    "subjects": "Computer Science",
    "language": "Español",
    "url": "https:\/\/www.edx.org\/course\/programacion-orientada-objetos-mexicox-upevipn02x",
    "title": "Programación Orientada a Objetos"
}