{
    "description": "Este es un curso destinado a profesores de todos los niveles. En él aprenderás a sacar partido de las nuevas tecnologías en tu labor docente para crear una experiencia de aprendizaje nueva y enriquecedora. Si eres profesor y quieres conocer la nueva enseñanza que viene, no puedes perdértelo.\n \nCon un proyector de vídeo y un ordenador conectado a Internet se pueden hacer cosas increíbles en el aula. Incluso sin este equipamiento, es posible utilizar los distintos servicios y plataformas disponibles en Internet para crear una nueva y enriquecedora experiencia de aprendizaje.\n \nEn este curso aprenderás a encontrar información en Internet de gran utilidad para tu labor docente  y a utilizar herramientas para crear presentaciones visuales impactantes y estimulantes. Conocerás multitud de plataformas y herramientas disponibles en Internet que permiten crear nuevas experiencias de enseñanza-aprendizaje, así como crear una comunicación increíblemente eficaz, tanto profesor-alumno como alumno-alumno. El aprendizaje con tecnología es multi-plataforma y multi-dispositivo, y se extiende más allá del aula, incluso de una forma global. Aprenderás a encontrar información en Internet de gran utilidad para tu labor docente\n\tAprenderás utilizar herramientas para crear presentaciones visuales impactantes y estimulantes\n\tConocerás multitud de plataformas y herramientas disponibles en Internet que permiten crear nuevas experiencias de enseñanza-aprendizaje\n\tTe daremos las pautas para crear una comunicación increíblemente eficaz, tanto profesor-alumno como alumno-alumno\n\tEl aprendizaje con tecnología es multi-plataforma y multi-dispositivo, y se extiende más allá del aula, incluso de una forma global y en este curso te mostraremos algunos ejemplos de ello.",
    "instructors": [
        "Miguel Ferrando Bataller",
        "Ignacio Despujol",
        "Linda Castañeda Quintero"
    ],
    "requirements": "Para seguir este curso no necesitas más que conocimientos básicos de navegación por Internet.",
    "length": "11 weeks",
    "effort": "3 horas\/semana",
    "prices": "Free\n        \n         \n         Verified Certificate option closed",
    "institutions": "UPValenciaX",
    "subjects": "Computer Science",
    "language": "Español",
    "url": "https:\/\/www.edx.org\/course\/tecnologias-para-la-educacion-upvalenciax-te201x",
    "title": "Tecnologías para la Educación"
}