{
    "description": "3D printing is exciting and new and awesome. You may have wanted to try your hand at 3D printing, but it can be hard to know where to start. This class will teach you how to jump in, create your own 3D models, and ultimately print your designs to hold in your own hands.\nYour first 3D print is ridiculously fun. If you could make exactly what you’ve imagined, what would it be?\nInexpensively prototype the invention you’ve been dreaming up.\nDesign your own wedding ring in silver or titanium.\nBuild a new lamp for your house.\nPrint your own custom, ceramic coffee cup.\n\nWho Should Take This Class?\nThis class is for beginners, with no experience required. We’ll be using software that’s enjoyable, learnable, and free (Mac and Windows). You don’t need to be an engineer to do this anymore.\nWe will take a unique approach to learning: building up, cutting down, and manipulating your 3D model -- much like building with clay in art class. When you’re finished, you will be ready to strike out on your own.\nWin $100 and go nuts!\nOn January 31, three students will each win $100 of 3D printing credit. You'll be 3D printing like a madman by winning one of three categories -- most creative project -- most popular project -- and one randomly drawn student.\n\nThis class is designed to give you a complete “3D printing startup package.” Sign up and you’ll learn:\nHow to “build” your designs in 3D, using just your computer and free software.\nWhere to have your ideas 3D printed and mailed to you -- affordably.\nWhat materials can be used for 3D printing: plastics, titanium, ceramic, stainless steel, and many more.\nHow people are selling their 3D prints and how inventors are building inexpensive prototypes.\n\n\nThis is a project-based class; meaning that, in the end, you will have built something! For the final project, you will order a 3D print of what you have designed. This is the way learning should be! Utilizing online 3D printing services, you can expect your first 3D print to cost $10-$40, depending upon size. There are no other expenses in this class.\nI think you're going to enjoy this class. Enroll now and get started -- you'll be making fun things in no time!\nCheers,\n-Lance",
    "instructors": "Lance Atkins",
    "url": "https:\/\/www.coursetalk.com\/providers\/skillshare\/courses\/3d-print-your-invention-learn-3d-modeling-and-digital-fabrication",
    "title": "3D Print Your Invention: Learn 3D Modeling and Digital Fabrication",
    "language": "en",
    "source": "coursetalk"
}