{
    "source": "Coursera",
    "description": "The course, “A Look at Nuclear Science and Technology” is aimed at scientifically inclined individuals who want to learn more about nuclear energy and the nuclear power industry. It will address subjects such as: What is nuclear energy? What is its history? Who are its heroes? Why is it controversial? How do nuclear power plants work? What about nuclear weapons? What are the stereotypes and misconceptions? We expect many students who finish this class to want to go on for further study in a closely related field. This course will focus on the theory, design and operation of commercial nuclear power reactors. The course will also touch on contemporary issues regarding nuclear power generation including: the nuclear fuel cycle, the economics of nuclear power, and nuclear non-proliferation.",
    "contents": "“A Look at Nuclear Science and Technology” is an overview course that provides broad subject-area coverage to introduce students to application of theory to practical aspects of nuclear science and technology in the world today with special emphasis on commercial nuclear power. The course will begin with a general overview of nuclear physics and the practical applications covered by the field of nuclear engineering. The majority of the course will focus on the theory, design and operation of commercial nuclear power reactors. The course will also touch on contemporary issues regarding nuclear power generation including: the nuclear fuel cycle, the economics of nuclear power, and nuclear non-proliferation.The course will begin with a grand tour of the commercial nuclear fuel cycle and power reactors so the student will have some perspective before delving into the theory that is important to understanding the unique aspects of nuclear energy. The course then will return to the fundamentals of basic nuclear physics, reactor physics, energy removal and power conversion to prepare students for in-depth looks at the theory and function of commercial nuclear power reactors.This course is intended for students who have had little to no academic instruction in nuclear engineering. Some of my incentives to teach this class are (1) to stimulate interest and excitement about nuclear science and technology, and (2) to create a more informed citizenry on the subject of nuclear energy utilization in the future. Introduction – A Grand Tour of the Nuclear Fuel CycleAtomic and Nuclear Physics – The Einstein ConnectionNuclear Reactions and Radiation – The Life and Trials of Neutrons and the Things They CreateRadiation and Radiation Protection – Radiation and RealismFission Reactor Basics – Links in the Chain ReactionOverview of Power Reactors and Nuclear Systems – Over 440 in the World and GrowingNuclear Safety –Should I be frightened?Radiation and Radioisotopes in the World Today",
    "requirements": "Students should have had a course in physics and differential equations. Simple, first order ordinary differential equations will be used now and then.",
    "effort": "4-8 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/nuclearscience",
    "title": "A Look at Nuclear Science and Technology",
    "courseraId": "163",
    "subjects": "Engineering"
}