{
    "source": "Coursera",
    "description": "\nThis course will provide graduate students and post-doctoral fellows in the STEM disciplines (science, technology, engineering, and mathematics) who are planning college and university faculty careers with an introduction to evidence-based teaching practices.  Participants will learn about effective teaching strategies and the research that supports them, and they will apply what they learn to the design of lessons and assignments they can use in future teaching opportunities.  Those who complete the course will be more informed and confident teachers, equipped for greater success in the undergraduate classroom. &nbsp;&nbsp;\n\nThe course will draw on the expertise of experienced STEM faculty, educational researchers, and staff from university teaching centers, many of them affiliated with the Center for the Integration of Research, Teaching, and Learning (CIRTL), a network of 21 research universities collaborating in the preparation of STEM graduate students and post-docs as future faculty members.  The eight-week course will be highly interactive, with many opportunities for peer-to-peer learning.  Learning communities are at the heart of CIRTL’s activities, and this open, online course is intended to foster a large, healthy learning community of those interested in undergraduate STEM teaching--including current STEM faculty. \"An Introduction to Evidence-Based Undergraduate STEM Teaching\" has been developed by faculty, staff, and students at Vanderbilt University, Michigan State University, Boston University, the University of Wisconsin-Madison, and the University of Colorado-Boulder.&nbsp;The course is based on work supported by the National Science Foundation under Grant No. 1347605. This eight-week course explores effective teaching strategies for college or university STEM (science, technology, engineering, mathematics) classrooms ",
    "contents": "Week 1 – Principles of Learning, Part 1We start by exploring a few key learning principles that apply in all \nteaching contexts such as student’s prior knowledge, mental models and \nknowledge organization. We’ll consider the research supporting these \nprinciples and examples of how STEM faculty put them into practice.Week 2 – Principles of Learning, Part 2This week we continue our exploration of&nbsp;learning principles that apply \nin all teaching contexts. &nbsp;These include, effective ways of providing \nfeedback to students and student motivations for learning. We’ll \nconsider the research supporting these principles and examples of how \nSTEM faculty put them into practice.Week 3 – Learning ObjectivesDesigning an effective learning experience for students means beginning \nwith the end in mind. In this week, we will identify ways to craft \nmeaningful learning objectives for one’s students and discuss \nstrategies&nbsp;for incorporating those objectives in your instruction.Week 4 – Assessment of LearningOnce we have outlined and implemented our learning objectives we must \nconsider the most effective way of assessing those learning objectives. \n&nbsp;This week we will discuss strategies for designing assessments that \nwill align with your learning goals as well as how student mindset can \ninfluence their performance on these assessments.Week 5 – Active LearningThe module begins with a description of the benefits of active learning \nand how it fits into the overall learning cycle. Then, the module \noutlines two key features of active learning, teamwork and critical \nthinking, by showcasing several manifestations of active learning.Week 6 – Inclusive TeachingThis week we will discuss the importance of inclusive teaching and many \nof the issues instructors can face when teaching classes composed of \nstudents of varying ethnicities and genders. &nbsp;We provide you with \nexamples of teaching practices and language that can isolate certain \nstudent populations along with strategies to avoid these practices.Week 7 – Lesson PlanningThis week you will create an annotated lesson plan for a class you might teach in the future incorporating many of the principles covered in this course.Week 8 – ConclusionDuring the final week of the course, you'll provide feedback to your \npeers on their draft lesson plans and, in turn, receive feedback on your\n lesson plan.",
    "requirements": "The course is intended for graduate students and post-docs in the STEM disciplines (science, technology, engineering, and mathematics) planning faculty careers who are interested in developing their teaching skills. We expect that current STEM faculty, particularly early-career faculty, will find the course useful, as well. Others interested in undergraduate STEM teaching are welcome to participate.",
    "effort": "4-5 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/stemteaching",
    "title": "An Introduction to Evidence-Based Undergraduate STEM Teaching",
    "courseraId": "1977",
    "subjects": "Mathematics, Engineering"
}