{
    "source": "Coursera",
    "description": "This two-part course (part 2 is available here)  is designed to help students with very little or no computing background learn the basics of building simple interactive applications. Our language of choice, Python, is an easy-to learn, high-level computer language that is used in many of the computational courses offered on Coursera. To make learning Python easy, we have developed a new browser-based programming environment that makes developing interactive applications in Python simple. These applications will involve windows whose contents are graphical and respond to buttons, the keyboard and the mouse.The primary method for learning the course material will be to work through multiple \"mini-projects\" in Python. To make this class enjoyable, these projects will include building fun games such as Pong, Blackjack, and Asteroids. When you’ve finished our course, we can’t promise that you will be a professional programmer, but we think that you will learn a lot about programming in Python and have fun while you’re doing it. This two-part course is designed to be a fun introduction to the basics of programming in Python. Our main focus will be on building simple interactive games such as Pong, Blackjack and Asteroids. ",
    "contents": "Our course syllabus can be seen at&nbsp;www.codeskulptor.org\/coursera\/interactivepython.html.",
    "requirements": "A knowledge of high school mathematics is required. While the class is designed for students with no prior programming experience, some beginning programmers have viewed the class as being fast-paced. For students interested in some light preparation prior to the start of class, we recommend a self-paced Python learning site such as&nbsp;codecademy.com",
    "effort": "7-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/interactivepython1",
    "title": "An Introduction to Interactive Programming in Python (Part 1)",
    "courseraId": "2755",
    "subjects": "Computer Science: Software Engineering"
}