{
    "description": "SAP HANA is the most talked about SAP innovation in recent times with over\r\n3,200 SAP HANA customers since June 2011. All SAP products are moving to SAP\r\nHANA, but do you know what SAP HANA is or what it does? Join Vishal Sikka,\r\nformer member of the SAP Executive Board, where he explains the idea behind\r\nSAP HANA and the reason why it was created, life before SAP HANA, and how SAP\r\nHANA can help SAP’s customers to run better.\r\n\r\nThis course is aimed at anyone interested in learning about SAP HANA. You\r\ndon’t need to have any technical knowledge to understand the concept of SAP\r\nHANA, which is explained easily and informally by Vishal in this overview.\r\n\r\nAfter the course, you will have an understanding of how SAP HANA works, how\r\nquickly it can perform tasks, and how it has helped existing SAP customers.\r\n\r\nThis is a special edition openSAP course; your total learning time will be\r\njust two to three hours and all the content is already available. The course\r\nis broken down into five units consisting of nine videos, with self-tests for\r\nyou to complete after each section. Your results will not be saved; they are\r\njust for your personal use. At the end of the course, there is a course\r\nassignment. You can complete the assignment at any time, but be sure to submit\r\nit by August 1, 10pm Central European Summer Time (CEST). If you complete the\r\ncourse assignment successfully, you will receive a Record of Achievement.\r\n\r\nThe online discussion forum will be available for you to collaborate with\r\nother learners and SAP HANA experts. The forum will be monitored by experts\r\nfrom July 7 through to August 1. After this time, you can still access the\r\ncourse content, but you will not be able to reply to or create new discussions\r\nwithin the forum.\r\n\r\nYou don’t need to complete the course in one sitting. Feel free to dip in\r\nwhenever you have a spare ten minutes to complete the next unit and learn\r\nabout this exciting SAP innovation.",
    "instructors": "Thomas J. Mierzwa",
    "url": "https:\/\/www.coursetalk.com\/providers\/opensap\/courses\/an-introduction-to-sap-hana",
    "title": "An Introduction to SAP HANA",
    "language": "en",
    "source": "coursetalk"
}