{
    "description": "This programming course is a complete package, a comprehensive detailed course on Android App Development. This course is as useful for a beginner as it is for an expert, as evidenced from the easy to understand but focused video lessons. This course starts from scratch, keeping in mind the beginners and their limited knowledge of app development. The material will cover all the Java essentials required to develop an android app, from step one all the way until completion.Once you have mastered the Java essentials required for Android development, this course will take you to the world of Android. You will look specifically at how the programming and development concepts covered in the previous lessons can be applied to Android and its capabilities. Again, you will be going through things step by step, so you can see how to develop Android apps from scratch.In the next module, we will be working with UI components. Here, you'll get started with hands on Android UI design, using xml files and Java code. In the module on UI Components usage, using Java, we will be dealing with understanding buttons, Intents, LogCat, Textboxes, Shared preferences, Preferences, creating AVDs, Pop-ups, and Toast messages, all with examples. Other concepts that you will learn from this course are Android tabs with specific examples to make it easier to understand, Option menus, context menus, sub menu(s) of Android, Look and feel of the app, etc. Finally, you'll be making 20 android Apps yourself by following along with us. We will show you how to make each of these 20 apps, step by step. This is part of the course because we believe that Android App Development is best learned by actually doing it. ",
    "instructors": "Dheeraj Vaidya",
    "url": "https:\/\/www.coursetalk.com\/providers\/edcast\/courses\/android-learn-android-app-development-from-scratch-2",
    "title": "Android - Learn Android App Development from Scratch",
    "language": "en",
    "source": "coursetalk"
}