{
    "description": "CSAP.1x  covers the material of AP Computer Science A which is equivalent to a first-semester, college-level course in computer science. This highly interactive course will introduce students to the fundamental concepts of computer science. The course will be structured to encourage students to think computationally and enjoy problem solving. New York City’s companies, museums, art and architecture will be used as examples to emphasize the ubiquitous role of computing and programming concepts in the world around us.\n\nThe course will delve into object- oriented problem solving and design using the Java  programming language. Students will have access to practice problems that will help them learn to program without spending hours on finding and fixing syntax errors. These will include online multiple-choice questions in the style of those on the AP exam, mixed-up code that the user drags into the correct order, fill in the blank code and audio tours of the code.\n\nTopics include problem solving, programming design strategies and  data structures, algorithms, role of computation in real-world applications like smart phones, google glass and robots. This material may be used for self-study and as a preview by students and teachers considering the September 2015 offering of the course.\n\nLearn more about our High School and AP* Exam Preparation Courses\n\n*Advanced Placement and AP are registered trademarks of the College Board, which was not involved in the production of, and does not endorse, these offerings. Identify the use and proper use of Variables, Conditionals, Objects and primitives, control structures, booleans, lists and arrays, and Exceptions.\n\tImplement problem descriptions in well designed code.\n\tIdentify and begin to design algorithms to solve interesting problems in their field of interest.",
    "instructors": "Yosef Skolnick",
    "requirements": "Algebra and basic Mathematical reasoning abilities.",
    "length": "8 weeks",
    "effort": "4 - 6 hours\/week",
    "prices": "Free\n        \n         \n         Verified Certificate option closed",
    "institutions": "Cooper Union",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/preparing-ap-computer-science-exam-part-cooper-union-cs-1x",
    "title": "Preparing for the AP* Computer Science A Exam — Part 1"
}