{
    "source": "Coursera",
    "description": "Are you curious about quantitative academic finance? Have you considered graduate study in finance? Are you working in an investment bank, money-management firm or hedge fund and you want to understand models better? Would you like to know what buzzwords like beta, risk premium, risk-neutral price, arbitrage, equity premium, and discount factor mean? This class is for you.&nbsp;We will see how one basic idea, price equals expected discounted payoff, unites everything - models that describe stocks, bonds, options, real investments, discrete time, continuous time, asset pricing, portfolio theory, and so forth.&nbsp;In this part I, we’ll quickly learn or review time-series in continuous and discrete time. We'll look at some basic facts. Then we’ll start with the underlying consumption-based model, and we’ll preview some classic issues in finance. That outlines the big ideas of the whole class. Then, we'll take a step back and study contingent claims and the theorems showing the existence of a discount factor (the m in p=E(mx)). We'll explore the mean-variance frontier and expected return vs. beta models and factor structures. We will study the classic linear models — CAPM, APT, ICAPM. We will learn how to use GMM to estimate and evaluate asset pricing models, as well as the classic regression tests. This paves the way for Part 2&nbsp;which focuses on applications and empirical evaluation.&nbsp;The math in real, academic, finance is not actually that hard. Understanding how to use the equations, and see what they really mean about the world... that's hard, and that's what I hope will be uniquely rewarding about this class. This course is part one of a two-part introductory survey of graduate-level academic asset pricing. We will focus on building the intuition and deep understanding of how the theory works, how to use it, and how to connect it to empirical facts. This first part builds the basic theoretical and empirical tools around some classic facts. The second part delves more deeply into applications and empirical evaluation. \n",
    "contents": "Part 1 syllabus: \n\nWeek 1: Stochastic Calculus Introduction and Review. dz, dt and all that.&nbsp;\nWeek 2: Introduction and Overview. Challenging Facts and Basic Consumption-Based Model.&nbsp;\nWeek 3: Classic issues in Finance Equilibrium, Contingent Claims, Risk-Neutral Probabilities.\n\nWeek 4: State-Space Representation, Risk Sharing, Aggregation, Existence of a Discount Factor.\n\nWeek 5: Mean-Variance Frontier, Beta Representations, Conditioning Information.&nbsp;\n\nWeek 6: Factor Pricing Models -- CAPM, ICAPM and APT.&nbsp;\n\nWeek 7: Econometrics of Asset Pricing and GMM. &nbsp;\nFinal Exam\n\nPart 2 is a separate course, which may be taken separately from Part 1. Here is the syllabus to whet your appetite:&nbsp;\n\nSpring break (1 week)\n\nWeek 1: Factor pricing models in action The Fama and French model Fund and performance evaluation.\n\nWeek 2: Time series predictability, volatilty and bubbles. \n\nWeek 3: Equity premium, macroeconomics and asset pricing.\n\nWeek 4: Option Pricing.\n\nWeek 5: Term structure models and facts.\n\nWeek 6: Portfolio Theory.\n\nFinal Exam",
    "requirements": "This course uses concepts from finance, undergraduate applied mathematics, advanced undergraduate \/ beginning graduate level economics, and time-series econometrics. Students should be able to use single and multivariable calculus, simple differential equations, matrix algebra, and basic statistics. They should be able to program simple simulations in a matrix programming language like Matlab, Octave, R, Python, Julia, etc. Students should have some background in economics, including utility functions and maximization, and have worked with basic time-series econometrics, such as AR(1) models.",
    "effort": "10-15 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/assetpricing",
    "title": "Asset Pricing, Part 1",
    "courseraId": "724",
    "subjects": "Mathematics"
}