{
    "description": "The Astrophysics XSeries Program consists of four foundational courses in astrophysics taught by prestigious leaders in the field, including Nobel Prize winners.  You will be taught by Brian Schmidt, who led the team that discovered dark energy – work which won him the 2011 Nobel Prize for Physics, and by prize-winning educator, science communicator and astrophysics researcher Paul Francis, who will take you through an incredible journey where you learn about the unsolved mysteries of the universe, exoplanets, black holes and supernovae, and general cosmology. Astronomy and astrophysics is the study of everything beyond Earth. Astronomers work in universities, at observatories, for various space agencies like NASA, and more. The study of astronomy provides you with a wide range of skills in math, engineering, and computation which are sought after skills across many occupations. This XSeries Program is great for anyone to start their studies in astronomy and astrophysics or individuals simply interested in what lies beyond Earth.\n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about Astrophysics\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Explore the deadliest places in the universe, from black holes to supernovae. Exploring the origin, fate and nature of our universe. Exploring the biggest mysteries of modern astrophysics. Explore the mysteries of exoplanets - planets around other stars – in this introductory astrophysics course.",
    "instructors": [
        "Brian Schmidt",
        "Paul Francis"
    ],
    "length": "Self-Paced, ~9 Weeks\/Course",
    "effort": "Self-Paced, 3 Hours\/Week",
    "prices": "$50\/Course",
    "institutions": "ANUx",
    "subjects": "Physics",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/astrophysics"
}