{
    "description": "In recent years, flying robots such as miniature helicopters or quadrotors have received a large gain in popularity. Potential applications range from aerial filming over remote visual inspection of industrial sites to automatic 3D reconstruction of buildings. Navigating a quadrotor manually requires a skilled pilot and constant concentration. Therefore, there is a strong scientific interest to develop solutions that enable quadrotors to fly autonomously and without constant human supervision. This is a challenging research problem because the payload of a quadrotor is uttermost constrained and so both the quality of the onboard sensors and the available computing power is strongly limited. \n\nIn this course, we will introduce the basic concepts for autonomous navigation for quadrotors. The following topics will be covered:\n\n3D geometry,\n\tprobabilistic state estimation,\n\tvisual odometry, SLAM, 3D mapping,\n\tlinear control.\nIn particular, you will learn how to infer the position of the quadrotor from its sensor readings and how to navigate it along a trajectory.\n\nThe course consists of a series of weekly lecture videos that we be interleaved by interactive quizzes and hands-on programming tasks. For the flight experiments, we provide a browser-based quadrotor simulator which requires the students to write small code snippets in Python.\n\nThis course is intended for undergraduate and graduate students in computer science, electrical engineering or mechanical engineering. This course has been offered by TUM for the first time in summer term 2014 on EdX with more than 20.000 registered students of which 1400 passed examination. The MOOC is based on the previous TUM lecture “Visual Navigation for Flying Robots” which received the TUM TeachInf best lecture award in 2012 and 2013.\n\nFAQ\n\nDo I need to buy a textbook?\n\nNo, all required materials will be provided within the courseware. However, if you are interested, we recommend the following additional materials:\n\nThis course is based on the TUM lecture Visual Navigation for Flying Robots. The course website contains lecture videos (from last year), additional exercises and the full syllabus: http:\/\/vision.in.tum.de\/teaching\/ss2013\/visnav2013\n\tProbabilistic Robotics. Sebastian Thrun, Wolfram Burgard and Dieter Fox. MIT Press, 2005.\n\tComputer Vision: Algorithms and Applications. Richard Szeliski. Springer, 2010.\nDo I need to build\/own a quadrotor?\n\nNo, we provide a web-based quadrotor simulator that will allow you to test your solutions in simulation. However, we took special care that the code you will be writing will be compatible with a real Parrot Ardrone quadrotor. So if you happen to have a Parrot Ardrone quadrotor, we encourage you to try out your solutions for real. After successful participation of this module, students will be able to\n\nUnderstand the flight principles of quadrotors and their application potential\n\tSpecify the pose of objects in 3D space and to perform calculations between them (e.g., compute the relative motion)\n\tExplain the principles of Bayesian state estimation\n\tImplement and apply an extended Kalman filter (EKF), and to select appropriate parameters for it\n\tImplement and apply a PID controller for state control, and to fine tune its parameters\n\tUnderstand and explain the principles of visual motion estimation and 3D mapping",
    "instructors": [
        "Jürgen Sturm",
        "Daniel Cremers",
        "Christian Kerl"
    ],
    "requirements": "Proficient in linear algebra and 3D geometry. Basic python programming skills.",
    "length": "8 weeks",
    "effort": "4 hours\/week",
    "institutions": "TUMx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/autonomous-navigation-flying-robots-tumx-autonavx-0",
    "title": "Autonomous Navigation for Flying Robots"
}