{
    "description": "Programming is everywhere: in dishwashers, cars and even space shuttles. This course will help you to understand how programs work and guide you through creating your own computer program – a mobile game.\n\nWhether you’re a complete newcomer to programming, or have some basic skills, this course provides a challenging but fun way to start programming in Java. Over seven weeks we will introduce the basic constructs that are used in many programming languages and help you to put this knowledge into practice by changing the game code we have provided. You’ll have the freedom to create a game that’s unique to you, with support from the community and educators if you get stuck. You’ll learn how to create algorithms to solve problems and translate these into code, using the same tools as industry professionals worldwide. We will be using Google’s Android Studio as the platform for programming.\n\nThe course will combine video introductions, on-screen examples, downloadable guides, articles and discussions to help you understand the principles behind computer programs and the building blocks that are used to create them. Multiple choice quizzes will help you to check your understanding, while exercises each week will show you how to use your new skills to improve your game. Expert guidance from staff at the School of Systems Engineering at the University of Reading, UK, will help to you to get hands-on experience of programming.\n\nAt the end of the course you’ll have a complete game that can be played on an Android phone or tablet, or even your computer. You can share it with your friends and family, use your new knowledge to improve the game further, or even create new games of your own!\n\nYou can find out more about this course in Professor Shirley Williams’s blog post on the shortage of programmers.",
    "instructors": "Karsten Øster Lundqvist",
    "institutions": "School: \n                                University of Reading",
    "url": "https:\/\/www.coursetalk.com\/providers\/futurelearn\/courses\/begin-programming-build-your-first-mobile-game",
    "title": "Begin Programming: Build Your First Mobile Game",
    "language": "en",
    "source": "coursetalk"
}