{
    "source": "Coursera",
    "description": "The Library of Integrative Network-based Cellular Signatures (LINCS) is an NIH Common Fund project that was recently expanded to its second phase. The idea is to perturb different types of human cells with many different types of perturbations such as: drugs and other small molecules; genetic manipulations such as knockdown or overexpression of genes; manipulation of the extracellular microenvironment conditions, for example, growing cells on different surfaces, and more. These perturbations are applied to various types of human cells including induced pluripotent stem cells from patients, differentiated into various lineages such as neurons or cardiomyocytes. Then, to better understand the molecular networks that are affected by these perturbations, changes in level of many different variables are measured including: mRNAs, proteins, and metabolites, as well as cellular phenotypic changes such as changes in cell morphology. In most cases, this life sciences data is collected at the genome-wide scale across different regulatory layers.&nbsp;The BD2K-LINCS Data Coordination and Integration Center (DCIC) is commissioned to organize, analyze, visualize and integrate LINCS data with other publicly available relevant resources. In this course we will introduce the various Centers that collect data for LINCS, describing the experimental data procedures and the various data types. We will then cover the design and collection of metadata and how metadata is linked to ontologies. We will then cover basic data processing and data normalization methods to clean and harmonize LINCS data. This will follow a discussion about how the data is served as RESTful APIs and JSON, and for this we will cover concepts from client-server computing. Most importantly, the course will focus on various bioinformatics methods of analysis including: unsupervised clustering, gene-set enrichment analyses, Bayesian integration, network visualization, and supervised machine learning applications to LINCS data and other relevant Big Data from molecular biomedicine. The course will be taught by members of the Ma'ayan Lab at the Icahn School of Medicine Mount Sinai, Medvedovic Lab at the University of Cincinnati, Schurer Lab at the University of Miami, and other members of the BD2K-LINCS DCIC Team as well as members of other BD2K and LINCS NIH funded centers. Learn various methods of analysis including: unsupervised clustering, gene-set enrichment analyses, Bayesian integration, network visualization, and supervised machine learning applications to LINCS data and other relevant Big Data from high content molecular and phenotype profiling of human cells.",
    "contents": "Overview of the NIH Common Fund LINCS ProgramOverview of the BD2K-LINCS Data Coordination and Integration CenterOverview of the Data and Signature Generation Centers (experiments and data)Metadata and OntologiesData NormalizationUnsupervised Learning Methods: Data ClusteringSupervised Learning MethodsEnrichment AnalysesNetwork Analysis and Network VisualizationCheminformaticsServing data through RESTful APIs and JSONInteractive Data Visualization of LINCS DataCrowdsourcing Projects",
    "requirements": "Basic courses in statistics and molecular biology are useful but not required. Ability to write short scripts in languages such as Python would be useful but not necessary.",
    "effort": "4-5 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/bd2klincs",
    "title": "Big Data Science with the BD2K-LINCS Data Coordination and Integration Center",
    "courseraId": "2633",
    "subjects": "Computer Science: Artificial Intelligence, Mathematics, Statistics and Data Analysis"
}