{
    "source": "Coursera",
    "description": "To really understand what is special about Bitcoin, we need to understand how it works at a technical level. We’ll address the important questions about Bitcoin, such as:How does Bitcoin work? What makes Bitcoin different? How secure are your Bitcoins? How anonymous are Bitcoin users? What determines the price of Bitcoins? Can cryptocurrencies be regulated? What might the future hold?After this course, you’ll know everything you need to be able to separate fact from fiction when reading claims about Bitcoin and other cryptocurrencies. You’ll have the conceptual foundations you need to engineer secure software that interacts with the Bitcoin network. And you’ll be able to integrate ideas from Bitcoin in your own projects.Course Lecturers:Arvind Narayanan, Princeton University&nbsp;Joseph Bonneau, Princeton University&nbsp;Edward Felten, Princeton University&nbsp;Andrew Miller, University of Maryland There’s a lot of excitement about Bitcoin, but also a lot of confusion about what Bitcoin is and how it works. We’re offering this course focusing on the computer science behind Bitcoin to help cut through the hype and get to the core of what makes Bitcoin unique.\n",
    "contents": "Intro to Crypto and CryptocurrenciesCryptographic Hash FunctionsHash Pointers and Data StructuresDigital SignaturesPublic Keys as IdentitiesSimple CryptocurrenciesHow Bitcoin Achieves DecentralizationCentralization vs. decentralizationDistributed consensusConsensus without identity: the block chainIncentives and proof of workPutting it all togetherMechanics of BitcoinBitcoin transactionsBitcoin scriptsApplications of Bitcoin scriptsBitcoin blocksThe Bitcoin networkLimitations &amp; improvementsHow to Store and Use BitcoinsSimple Local StorageHow to Store and Use BitcoinsSecret KeysHot and Cold StorageSplitting and Sharing KeysOnline Wallets and ExchangesPayment ServicesTransaction FeesCurrency Exchange MarketsBitcoin miningThe task of Bitcoin minersMining hardwareEnergy consumption &amp; ecologyMining poolsMining incentives and strategiesBitcoin and anonymityAnonymity basicsOverview of Bitcoin deanonymizationMixingDecentralized mixingZerocoin and ZerocashTor and the Silk RoadCommunity, Politics, and RegulationConsensus in BitcoinBitcoin Core SoftwareStakeholders : Who’s in Charge?Roots of BitcoinGovernments Notice BitcoinAnti Money-Laundering RegulationNew York’s BitLicense ProposalAlternative Mining PuzzlesEssential Puzzle RequirementsASIC Resistant PuzzlesProof-of-useful-workNonoutsourceable PuzzlesProof-of-StakeBitcoin as a platformBitcoin as an append-only logBitcoins as “smart property”Secure multi-party lotteries in BitcoinBitcoin as randomness sourcePrediction markets &amp; real-world data feedsAltcoins and the Cryptocurrency EcosystemShort History of AltcoinsInteraction between Bitcoin and altcoinsLifecycle of an AltcoinBitcoin-Backed Altcoins, “Side Chains”The future of Bitcoin?&nbsp;The block chain as a vehicle for decentralizationRoutes to decentralizationWhat can we decentralize?When is decentralization a good idea?",
    "requirements": "An introductory computer science class (such as CS 101) is required.&nbsp;Basic programming experience as well as some knowledge of data structures and algorithms (linked lists, sorting, searching...) are strongly recommended.",
    "effort": "3-6 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/bitcointech",
    "title": "Bitcoin and Cryptocurrency Technologies",
    "courseraId": "2943",
    "subjects": "Computer Science: Systems & Security"
}