{
    "description": "How do you design a mobile app that truly changes people's lives? How can you understand how a new service is being used, both quantitatively and qualitatively? How can you use all of the rich sensing and I\/O capabilities of mobile devices to create experiences that go far beyond what's possible on a traditional computer?\n\nMobile devices are changing the ways that we interact with each other and information in the world. This course will take you from a domain of interest, through generative research, design, usability, implementation and field evaluation of a novel mobile experience. You'll finish the course with a working, field-tested application suitable for release in the app store as well as a deep understanding of human interaction with mobile devices and services.\n\nBased on a popular MIT class that has been taught since 2006 by Frank Bentley of Yahoo Labs and Ed Barrett, a Senior Lecturer at MIT, this course will explore what makes mobile devices unique. A primary focus will be on studying existing behavior and using key findings for design. While writing the code for an app is a part of the class, the majority of the topics will cover designing and evaluating a unique mobile experience. Along the way, you will have opportunities to share your work with other students from around the world! Java experience (or Objective C for iOS users) and a smartphone are required.\n\nAll required readings are available within the courseware, courtesy of The MIT Press. A print version of the course textbook, Building Mobile Experiences, is also available for purchase. The MIT Press is offering enrolled students a special 30% discount on books ordered directly through the publisher’s website. To take advantage of this offer, please use promotion code BME30 at The MIT Press site.\n\nFAQ\n\nWhat is the format of the class?\n\n\tThis will be a project-based class, with each student starting with a topic area of interest (e.g. mobile photo sharing, navigation, alarm clocks, music, etc.) and progressing through generative research, design, usability, implementation, and field evaluation over the course of 12 weeks.  \n\t\tAssignments will be peer graded and grading others’ assignments is required to pass the class.\n\t\n\tWhat textbook do I need for the course?\n\tBuilding Mobile Experiences is the suggested textbook. \n\t\tThree chapters are provided free of charge on the edX platform, but we imagine many students will want to read through the entire book.\n\t\n\tHow are grades assigned?\n\tThis will be a project-based class, with each student starting with a topic area of interest (e.g. mobile photo sharing, navigation, alarm clocks, music, etc.) and progressing through generative research, design, usability, implementation,and field evaluation over the course of 12 weeks. \n\t\tAssignments will be peer graded and grading others’ assignments is required to pass the class.\n\t\n\tCan I still register after the start date?\n\tYes, but you might find it difficult to catch up or may not have enough peers who are also starting late in order to get all of your assignments peer graded.\n\t\n\tHow much programming do I need to know before taking this class?\n\tThis is not a programming class, but all students are required to fully implement a working version of their application as the main part of the semester’s work.  \n\t\tStudents will not be able to conduct the field evaluation without a functional app.  \n\t\tStudents who are targeting Android should be proficient in Java and have completed several projects using the language.  \n\t\tStudents targeting iOS should have at least built and deployed a simple iOS app in Objective C before starting the class.\n\t\n\tDo I need a smartphone \/ data plan?\n\tSmart phones are required as you must be able to demo your work and test it in real-life situations.  \n\t\tThe networking and location assignment will require a 3G\/4G data plan.  \n\t\tPay as you go plans may be available in your location and you’ll only need <25 MB for this assignment. To understand the entire HCI design process, as applied to mobile applications\n\tTo construct a novel mobile application and assess its use in daily life for two weeks\n\tTo prepare and evaluate three different types of HCI research studies (generative, usability, and field studies), related to the topic of your application\n\tTo identify and discuss papers from the CHI research community and design and compose your own CHI-style paper\n\t ",
    "instructors": [
        "Frank Bentley",
        "Ed Barrett"
    ],
    "requirements": "Java experience (or Objective C for iOS users) and an Android or iOS device are required.",
    "length": "12 weeks",
    "effort": "10-12 hours per week for 12 weeks",
    "prices": "Free\n        \n         \n         Verified Certificate option closed",
    "institutions": "MITx",
    "subjects": "Business & Management",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/building-mobile-experiences-mitx-21w-789x",
    "title": "Building Mobile Experiences"
}