{
    "description": "XSeries Program Overview\n\nWhat does it take to succeed in today’s competitive job market? Applicants need more than standard credentials to get hired and be successful. The skills that are valued within the workplace have changed.\n \nThe Fullbridge Career Edge XSeries Program is designed to help you develop those key skills, through critical thinking and problem solving techniques, strategies to succeed in teams and a foundation in the analytical and data driven frameworks needed for success in any industry.\n \nThis five-course XSeries will explore contemporary business fundamentals and help you create a marketable personal brand that is visible not only in the workplace, but to a larger global audience. Through innovative and engaging learning techniques, including interactive assessments and games, you will build and enhance critical hard and soft skills that appeal to both current and future employers.\n \nYou’ll get guidance from Fullbridge’s Jim Pautz, Vice President of Coaching, Operations, and Talent. FullbridgeX’s Career Edge XSeries will arm you with the right skills and tools to successfully enter the workforce or transition into a new career or role. Take the Career Edge XSeries to get what you want out of your professional career, build the foundational skills required for workplace success, and get the job you want.\n \nA Fullbridge XSeries certificate will bolster your resume and indicate that you are equipped with the skills to succeed in the workplace. \n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about Career Edge: The Path to Career Success\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Assess your professional preferences, strengths, and interests to strategize and develop a career roadmap. Learn how to create and deliver high-impact communications and effectively collaborate on teams. Learn how to analyze and present data through targeted research, data analysis, and presentation tools. Learn how best to tackle complex problems in the workplace using known creative problem solving techniques and design thinking. Get the job you want with compelling resume writing and focused interview preparation.",
    "instructors": "Jim Pautz",
    "length": "4 Weeks\/Course",
    "effort": "1-2 Hours\/Week",
    "prices": "$29 per course",
    "institutions": "FullbridgeX",
    "subjects": "Business & Management",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/career-edge-path-career-success"
}