{
    "source": "Coursera",
    "description": "The course objective is to enable each student to enhance his or her quantitative\nscientific reasoning about problems related to human health. Biostatistics\nis about quantitative approaches - ideas and skills - to address bioscience\nand health problems. To achieve mastery of biostatistics skills, a student\nmust “see one, do one, teach one.” Therefore, the course is organized to\npromote regular practice of new ideas and methods.\n\nThe course is organized into 3 self-contained modules. Each module\nexcept the first is built around an important health problem.&nbsp;The\nfirst module reviews the scientific method and the role of experimentation\nand observation to generate data, or evidence, relevant to selecting among\ncompeting hypotheses about the natural world. Bayes theorem is used to\nquantify the concept of evidence. Then, we will discuss what is meant by\nthe notion of “cause.”\n&nbsp;\nIn the second module, we use a national survey dataset to estimate the\ncosts of smoking and smoking-caused disease in American society. The concepts\nof point and interval estimation are introduced. Students will master the\nuse of confidence intervals to draw inferences about population means and\ndifferences of means. They will use stratification and weighted averages\nto compare subgroups that are otherwise similar in an attempt to estimate\nthe effects of smoking and smoking-caused diseases on medical expenditures.\nIn the final module, we will study what factors influence child-survival in Nepal using data from the Nepal Nutritional Intervention Study Sarlahi or NNIPPS. Students will estimate and obtain confidence intervals for infant survival rates, relative rates and odds ratios within strata defined by gestational period, singleton vs twin births, and parental characteristics. \n\nDeveloped in collaboration with Johns Hopkins Open Education Lab. Learn to frame and address health-related questions using modern biostatistics ideas and methods.",
    "contents": "Module 1 (Weeks 1 &amp; 2) Question: What common background understanding do I need to get started in improving my ability to critically and quantitatively reason about health questions?Module 2 (Weeks 3 &amp; 4) Question: How do the average medical care costs for people with a major smoking-caused disease (MSCD) differ from those for people without MSCDs who are otherwise similar?Module 3 (Week 5) Question: What is the rate of infant survival during the first 26 weeks of life in southern Nepal and how does the rate of survival vary by infant’s gestational age, sex, or being a singleton versus twin birth?",
    "requirements": "Interest in the scientific method as broadly related to human health.\nAbility to reason precisely. Mathematics through pre-calculus.",
    "effort": "4-6 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/casebasedbiostat",
    "title": "Case-Based Introduction to Biostatistics",
    "courseraId": "429",
    "subjects": "Statistics and Data Analysis"
}