{
    "description": "XSeries Program Overview\n\nChina: Civilization and Empire explores the development of this great civilization from the Neolithic to the last dynasty. We see the formation of political structures and social practices that have lasted into the present; we learn to appreciate artistic and literary traditions of sophistication and refinement; we inquire into its philosophical and religious legacies and their significance for our own lives; and we trace the creation of the largest economy in world history.\n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about China: Civilization and Empire\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Part 1 includes an overview of China, historically, geographically, and culturally, starting with the origins and legitimation of what we come to know as China and includes an exploration of the integral thinkers (Confucius, Laozi etc.) of the early period. Part 2 covers the period from the Qin to the Sui with the creation of the first unified empire and an exploration of state building and dissolution, focusing on the realization of the self and the influence of Buddhism during the medieval period. Part 3 explores the reunification of China under Tang with a focus on Chinese aristocratic culture during the Tang period from poetry to calligraphy to literature. Part 4 takes us from the early imperial period to the late imperial period exploring new ideas and the role of the exam system and government with a focus on the Song dynasty. Part 5 explores the impact of the conquest dynasties and the world of the Ming.",
    "instructors": [
        "Peter K. Bol",
        "William C. Kirby"
    ],
    "length": "5 weeks\/course",
    "effort": "1.5 - 3.5 hours\/week",
    "prices": "$90\/course",
    "institutions": "HarvardX",
    "subjects": "History",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/china-civilization-empire"
}