{
    "source": "Coursera",
    "description": "When you take a digital photo with your phone or transform the image in Photoshop, when you play a video game or watch a movie with digital effects, when you do a web search or make a phone call, you are using technologies that build upon linear algebra. &nbsp;Linear algebra provides concepts that are crucial to many areas of computer science, including graphics, image processing, cryptography, machine learning, computer vision, optimization, graph algorithms, quantum computation, computational biology, information retrieval and web search. Linear algebra in turn is built on two basic elements, the matrix and the vector. &nbsp;In this class, you will learn the concepts and methods of &nbsp;linear algebra, and&nbsp;how to use them&nbsp;to think about problems arising in computer science. &nbsp;You will write small programs in the programming language Python to &nbsp;implement basic matrix and vector functionality and algorithms, and use these to process real-world data to achieve such tasks as: two-dimensional graphics transformations, face morphing, face detection, image transformations such as blurring and edge detection, image perspective removal, classification of tumors as malignant or &nbsp;benign, integer factorization, error-correcting codes, and secret-sharing. Learn the concepts and methods of linear algebra, and how to use them to think about computational problems arising in computer science.  Coursework includes building on the concepts to write small programs and run them on real data. ",
    "contents": "The FunctionThe FieldThe VectorThe Vector SpaceThe MatrixThe BasisDimensionGaussian EliminationThe Inner ProductOrthogonalization",
    "requirements": "You should be an experienced programmer. &nbsp;We use a subset of Python in this course, and we start by covering the relevant features and syntax, so many students find they can get by without prior knowledge of Python.You are&nbsp;not&nbsp;expected to have any background in linear algebra. &nbsp;However, you should be prepared to read and understand some mathematical proofs.&nbsp;At Brown University, a similar course is taken mostly by sophomore computer science &nbsp;majors who have taken at least two semesters of programming and one semester addressing proof techniques.",
    "effort": "7-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/matrix",
    "title": "Coding the Matrix: Linear Algebra through Computer Science Applications",
    "courseraId": "198",
    "subjects": "Computer Science: Artificial Intelligence, Mathematics, Computer Science: Theory, Statistics and Data Analysis"
}