{
    "source": "Coursera",
    "description": "DNA mutations can broadly be divided into two categories. Point mutations, in which a single nucleotide (A, C, G, T) is altered, inserted, or deleted, are comparable to erosion slowly changing the shape of a boulder. Much of human differentiation is attributable to the accumulation of point mutations.The other type of mutation is extremely rare and can cause dramatic effects on the scale of species evolution. &nbsp;In genome rearrangements, huge blocks of DNA are heaved around, often from one chromosome to another. These mutations are comparable to earthquakes, which hoist up mountains and wrench apart continents.When we compare two relatively short pieces of DNA that have not been affected by genome rearrangements (say, two genes taken from individuals from the same species), our goal is to identify a \"path of least resistance\" connecting these two genes via point mutations. &nbsp;We can find such a path using a powerful algorithmic paradigm called dynamic programming.On the other hand, when we zoom out to the compare entire genomes taken from different species that diverged millions of years ago (such as humans and mice), the effects of genome rearrangements become more pronounced. To determine how far diverged these genomes are, we will need completely different combinatorial algorithms&nbsp;that will help us answer&nbsp;questions about the patterns of genome rearrangements. For example, in order to move around large blocks of DNA, a genome rearrangement must \"break\" the genome in at least two places. We know that there are fault lines on the earth's surface where earthquakes are more likely; are there analogous \"fragile regions\" in the human genome where breakage has been more likely to occur during a genome rearrangement? After sequencing genomes, we would like to compare them. We will see that dynamic programming is a powerful algorithmic tool when we compare two genes (i.e., short sequences of DNA) or two proteins. When we \"zoom out\" to compare entire genomes, we will employ combinatorial algorithms.",
    "contents": "How Do We Compare Biological Sequences? (Dynamic Programming)Cracking the non-ribosomal codeIntroduction to sequence alignmentThe Manhattan Tourist ProblemSequence alignment is the Manhattan Tourist Problem in disguiseAn introduction to dynamic programming: The Change ProblemThe Manhattan Tourist Problem revisitedFrom Manhattan to an arbitrary DAGBacktracking in the alignment graphScoring alignmentsFrom global to local alignmentThe changing faces of sequence alignmentPenalizing insertions and deletions in sequence alignmentsSpace-efficient sequence alignmentEpilogue: Multiple sequence alignmentAre There Fragile Regions in the Human Genome? (Combinatorial Algorithms)Of mice and menThe Random Breakage Model of chromosome evolutionSorting by reversalsA greedy algorithm for sorting by reversalsBreakpointsRearrangements in tumor genomesFrom unichromosomal to multichromosomal genomesBreakpoint graphsComputing the 2-break distanceRearrangement hotspots in the human genomeEpilogue: Synteny block construction",
    "requirements": "\"Assembling DNA and Proteins\" is the suggested prerequisite for taking this course, but it is not a strict prerequisite, especially if you have some programming experience.The \"hacker track\" programming assignments in this class can be solved using any programming language.",
    "effort": "4-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/comparinggenomes",
    "title": "Comparing Genes, Proteins, and Genomes (Bioinformatics III)",
    "courseraId": "2859",
    "subjects": "Computer Science: Software Engineering, Mathematics, Computer Science: Theory"
}