{
    "source": "Coursera",
    "description": "UPDATE: we're doing a live, updated MOOC of this course at stanford-online July-2014 (not this Coursera version). See here: http:\/\/cs101.class.stanford.edu\/ CS101 teaches the essential ideas of Computer Science for a zero-prior-experience audience. Computers can appear very complicated, but in reality, computers work within just a few, simple patterns. CS101 demystifies and brings those patterns to life, which is useful for anyone using computers today.\nIn CS101, students play and experiment with short bits of \"computer code\" to bring to life to the power and limitations of computers. Everything works within the browser, so there is no extra software to download or install. CS101 also provides a general background on computers today: what is a computer, what is hardware, what is software, what is the internet. No previous experience is required other than the ability to use a web browser.\nHere is&nbsp;another video&nbsp;Nick created for this class. CS101 teaches the essential ideas of Computer Science for a zero-prior-experience audience. The course uses small coding experiments in the browser to play with the nature of computers, understanding their strengths and limitations. Sign up for the \"To be announced\" session to be notified by email when the class is next run, and sign up for \"Self-Study\" to start browsing the class materials right away. Self-Study mode makes all the videos and assignments available to be done at your own pace, but without a certificate of completion at the end.",
    "contents": "CS101 topics are covered with a mixture of video lecture and active lab work, all in the browser:\n\nThe nature of computers and code, what they can and cannot do\nHow computer hardware works: chips, cpu, memory, disk\nNecessary jargon: bits, bytes, megabytes, gigabytes\nHow software works: what is a program, what is \"running\"\nHow digital images work\nComputer code: loops and logic\nBig ideas: abstraction, logic, bugs\nHow structured data works\nHow the internet works: ip address, routing, ethernet, wi-fi\nComputer security: viruses, trojans, and passwords, oh my!\nAnalog vs. digital\nDigital media, images, sounds, video, compression\n",
    "effort": "3-5 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/cs101",
    "title": "Computer Science 101",
    "courseraId": "13",
    "subjects": "Computer Science: Software Engineering"
}