{
    "source": "Coursera",
    "description": "The goal of this course is to introduce you to the basics of how computation\nhas impacted the entire workflow of photography (i.e., from how images\nare captured, manipulated and collaborated on, and shared). &nbsp;\n\nThe course begins with a conceptualization of&nbsp;photography as drawing\nwith light and the capturing of light to form images\/videos. &nbsp;You\nwill learn about and understand how the optics and the sensor within a\ncamera are generalized, as well as learn about and understand how the lighting\nand other aspects of the environment are also generalized through computation\nto capture novel images.&nbsp;\n\nPre- and post-processing techniques used to manipulate and improve images\nwill be discussed. &nbsp;Activities in this course are selected to give\nyou first hand experience with the power of the web and the Internet for\nboth analyzing and sharing images. &nbsp;\n\nThis course is interdisciplinary and draws upon concepts and principles\nfrom computer vision, computer graphics, image processing, mathematics\nand optics.\n\nWe look forward to your engagement and participation with both the course\nand its discussion forums.\n\n\nAbout the TA\n\nDenis Lantsman is the TA for the class. Denis is a graduate of Harvey\nMudd College, and is currently finishing his MS in Machine Learning at\nGeorgia Tech. He is responsible for managing the coursera site, monitoring\nthe forums for student feedback, creating the homework assignments and\nquizzes, as well as recording weekly tutorials to help students with their\nprogramming. In this course you will learn about the basics of how computation has impacted the entire workflow of photography (i.e., from how images are captured, manipulated and collaborated on, and shared).",
    "contents": "Week 0 (Module 0): &nbsp;Introductions with an overview of the course\n    structure and content.&nbsp; Topics covered in this module include a description\n    of what is Computational Photography (i.e., whereby examples of dual photography\n    and panoramas are described) and reasons for studying this emerging interdisciplinary\n    field .\nWeek 1 (Module 1): &nbsp;Overview of what is a digital image.&nbsp; Topics\n    covered in this module are image processing and filtering, with emphases\n    placed upon point processes, smoothing, convolution, cross-correlation,\n    gradients and edges.\nWeek 2 (Module 2): &nbsp;Overview of cameras with emphases placed upon\n    the pinhole camera and optics (e. g., lenses, focal length), exposure time\n    and sensors.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nWeek 3 (Module 3): &nbsp;Feature detection, matching and correspondence.\n    The panorama pipeline and some examples. HDR and tone mapping.\nWeek 4 (Module 4):&nbsp;Overview of light fields, texture synthesis, image\n    retargeting, video, advanced topics.",
    "requirements": "College-level Mathematics (e.g., Linear Algebra, Calculus) is useful for\nthis course. &nbsp;You should know what are Matrices, Vectors, Differentiation,\nand Integration. &nbsp;A working knowledge of Basic Probability (e.g.,\nProbability Density Function) is needed. &nbsp;Also, a working knowledge\nof General Physics (e.g., Vectors, Optics), Basic Photography, and Basic\nComputer Programming are needed. &nbsp;You will need to download and install\nsoftware to do the programming assignments, which will be in the programming\nlanguage of Python.\n",
    "effort": "5-8 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/compphoto",
    "title": "Computational Photography",
    "courseraId": "87",
    "subjects": "Computer Science: Artificial Intelligence, Information, Tech & Design"
}