{
    "description": "Explore key ideas in game design, programming, architecture, game engines,\nplayer experience and game AI.\n\nThere are lots of different skills that go into game development. This course\nis about key technical concepts in game development, and has been developed\nfor people of many different backgrounds and skills. Some programming\nexperience would be nice but is not required.\n\nWe start by looking at the central role of game design and common development\nprocesses used in the industry. You will see how game software can be broken\ninto parts that work together, and in particular the idea of game engines.\nWe’ll explore the relationship between game design, balance and player\nexperience. Lastly we’ll look at enhancing player experience though the use of\nAI techniques.\n\n#### What will I learn?\n\n  * Essential game design elements and the role of a game designer\n  * Key game development stages and principles of agile game development\n  * How games are like magic and real-time systems\n  * That programming is made up of simple steps, and how procedure and object oriented programming can help us structure our game code\n  * How messages and events are key concepts in games at different levels within game architecture\n  * About graphs and other data structures that help represent game worlds and characters\n  * How a game design can be described, modelled and implemented as simple game architecture\n  * About the emergence of game engines and the relationship of games to other data-driven applications, including concurrent and distributed architectures\n  * How to implement games using iterative step-by-step processes, by selecting, implementing and testing\n  * That rules are central to games, and that game balance relates to fairness and bias for players\n  * How physics can be used to create realistic force-based movement, for individual characters and groups\n  * About AI techniques that can add interesting behaviour to game characters, including decision making, action planning and path planning",
    "instructors": "Clinton Woodward",
    "institutions": "School: \n                                swinburne-university-of-technology",
    "url": "https:\/\/www.coursetalk.com\/providers\/open2study\/courses\/concepts-in-game-development-gamesdev",
    "title": "Concepts in Game Development (GamesDev)",
    "language": "en",
    "source": "coursetalk"
}