{
    "source": "Coursera",
    "description": "This course investigates how to make mobile robots move in effective, safe, and predictable ways. The basic tool for achieving this is \"control theory\", which deals with the question of how dynamical systems, i.e., systems whose behaviors change over time, can be effectively influenced. In the course, these two domains - controls and robotics - will be interleaved and we will go from the basics of control theory, via robotic examples of increasing complexity - all the way to the research frontier. The course will focus on mobile robots as the target application and problems that will be covered include (1) how to make (teams of) wheeled ground robots avoid collisions while reaching target locations, &nbsp;(2) how to make aerial, quadrotor robots follow paths in the presence of severe disturbances, and (3) how to locomotive bipedal, humanoid robots.While the main focus of this course is theory, it is important to be able to map the theory onto an actual physical platform. As such, the course&nbsp;will provide detailed instructions on how to build a mobile robot from scratch as an optional part of the course. In addition, an introduction into microcontrollers, mechatronics, and electronics will be given so that, by the end of the course, the controllers developed in the course can run on an actual mobile robot.The course will also feature optional programming assignments, which will&nbsp;focus on implementing the controllers developed in this course for a&nbsp;mobile robot. A MATLAB-based simulator will be available run controllers&nbsp;from the programming assignments on a simulated robot or on the mobile&nbsp;robot built in this course. As a result of support from MathWorks, a&nbsp;downloadable license for MATLAB and course recommended toolboxes will be&nbsp;available for the duration of the MOOC. Learn about how to make mobile robots move in effective, safe, predictable, and collaborative ways using modern control theory.",
    "requirements": "Working knowledge of basic calculus, linear algebra and differential equations is recommended.&nbsp;",
    "effort": "5-7 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/conrob",
    "title": "Control of Mobile Robots",
    "courseraId": "84",
    "subjects": "Computer Science: Artificial Intelligence, Engineering"
}