{
    "source": "Coursera",
    "description": "Northwestern University’s first Content Strategy MOOC on Coursera focused on engaging, impactful ways that professionals can enhance their organization’s strategic goals. At every level of for-profit, non-profit, volunteer and government enterprises, tens of thousands of professionals took that MOOC. They learned how Content Strategy uses credible, trustworthy, transparent content to communicate essential stories and information to important people inside and outside their organization. &nbsp;In this, the second Content Strategy MOOC, participants will go deeper. They will learn actionable ways to grow internal and external audiences. &nbsp;They will deepen their understanding about those target individuals and will use a host of known and emerging tools and social networks to meaningfully reach them. They will also learn how to measure and improve the impact of their efforts with quantitative and qualitative metrics. As its name makes clear, this second Content Strategy MOOC will expand your content's impact and reach.&nbsp; Professionals at all levels of an organization will learn the best ways to grow an audience they want and need by smartly implementing their important, strategic stories and information.",
    "contents": "To earn a Verified Certificate, learners must watch the MOOC's videos, answer the learning questions that accompany each video, participate in the discussion forums, develop and complete two case studies, and evaluate\nthe cases of three other MOOC participants for each.",
    "requirements": "This\nMOOC serves professionals who want to learn to grow target audiences with trustable, engaging and often\ninteractive content to advance their enterprise’s future. This MOOC is for\npeople anywhere in an organization who have content development experience and\nnow want to significantly improve their abilities to understand audiences and\ndevelop strategic words, pictures, graphics and videos to convey their\norganization’s most important goals.",
    "effort": "2-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/growingaudiences",
    "title": "Content Strategy for Professionals 2: Expanding Your Content’s Impact and Reach",
    "courseraId": "2343",
    "subjects": "Information, Tech & Design"
}