{
    "source": "Coursera",
    "description": "The Capstone is centered on a fictional web startup, Wish I Was There, which aims to be the go-to travel guide for anywhere in the world using recommendations crowdsourced from local experts.&nbsp;&nbsp;While it is not a real company, the assignment you are asked to complete is similar to the work you would do in the real-world. By the time you’ve finished developing your response to this case, you will see how it directly relates to what confronts you in your own work.After all of the submissions have been received, a panel of notable experts will review the top rated materials and choose one that best exemplifies all of the Content Strategy skills required to succeed in today’s world. The top submission as chosen by the panel of experts will receive an award that allows them to take, free of charge, the class of their choice from Medill’s Integrated Marketing Communications Online Master’s Degree Program. The Capstone Project will let you demonstrate all that you have learned throughout the Content Strategy MOOCs. It is an exciting learning experience that takes you through developing an effective Content Strategy package to meaningfully understand its scope and impact.\n",
    "contents": "For the Capstone assignment, assume you have been selected to develop a Content Strategy for the section of Wish I Was There’s website for the region, people and culture where you live and work. You will need to create a visual mock-up of a webpage that appeals to the audiences you want to reach as well as a comprehensive plan to engage with them.&nbsp;",
    "requirements": "The Capstone Project is only open to those participants who have completed the previous Content Strategy Specialization MOOCs -- \"Engaging Audiences for Your Organization\" and \"Expanding Your Content's Impact and Reach\" -- on the Signature Track.&nbsp;As with all of the other Content Strategy MOOCs, to successfully complete the Capstone, you must complete and submit your assignment and do three peer reviews of others’ submissions. Once you have done that, you will be issued your Specialization Certificate from Northwestern University, endorsing your skills as a Content Strategist.&nbsp;",
    "effort": "2-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/contentcapstone",
    "title": "Content Strategy for Professionals 3: Capstone Project",
    "courseraId": "2352",
    "subjects": "Information, Tech & Design"
}