{
    "source": "Coursera",
    "description": "This MOOC is available in both English and simplified Chinese. If you wish to follow the MOOC in Chinese, the lectures, slides and learning questions have been translated. &nbsp;MOOC 经翻译后，推出了中文版本。如果您希望跟随中文版MOOC进行学习的话，课堂演讲，投影课件还有相关学习问题都已进行了中文翻译。请点击右侧蓝色的“免费上课！”按钮加入该课程。如果您已有Coursera的账号，点击该按钮，您将自动加入。如果您还没有Cousera的账号，您可以通过点击页面右上角的“注册”按钮，填写姓名和邮箱，免费注册账号。&nbsp;如果您希望获得美国西北大学颁发的课程结业认可证书，您可以通过点击右侧黄色按钮“获得结业认可证书”了解更多相关信息，并注册证书方向。Why Content Strategy is essential for professionals in any organization&nbsp;–&nbsp;business,\nnon-profit, or government:&nbsp;\nContent Strategy is a conversation that provides thought-leadership. It\nstarts a “conversation” with users and stakeholders inside and outside\nan organization.&nbsp; Conversations are the natural way people think about\ncomplex issues. Conversations also enable people to develop “stories,”\nwhich lead to understanding and helpful mental pictures. Content Strategy\npractitioners are at all levels of the best enterprises – in all departments\nand sectors from the top leader to the newcomer in the ranks.\n\nIn this complex information age, forward-thinking employees know that\nif they and their organizations are to thrive, they need to go beyond their\njob descriptions. They must master the most demanding communications frontier\n– creating engaging, strategic, honest stories and information that is\nvalued by their most important audiences. In turn that will make their\nenterprise stand out.\n\nRegardless of their area of work, position or expertise, Content Strategy\npractitioners know how to use words, pictures, video, and social and mobile\nmedia to interact with their most important constituents with trustable,\nactionable information that the audience values and will use. The strategic\ncontent they produce enhances the user’s lives and&nbsp;deepens their\nunderstanding and engagement with the organization.\n\nContent Strategy is similar to the best examples of journalism, but it\nis done by non-journalism organizations. Content Strategy is always honest,\ntrustable, and transparent. It tells all sides of every story it reports.\nOften it is also deeper and directed at topics and audiences that traditional\njournalism under-serves or does not reach.&nbsp; The Content Strategy MOOC is for professionals at all levels of a for-profit, non-profit, volunteer or government organization who want to significantly improve their abilities to understand audiences and develop strategic words, pictures, graphics, and videos to convey their organization’s most important goals.",
    "contents": "In this course, professionals at all levels of an organization will learn the best ways to engage an audience they want and need by smartly implementing their important, strategic stories and information and by using proven tools and techniques to enhance an audience’s experiences and interest.To earn a Verified Certificate, learners must watch the MOOC's videos, answer the Learning Questions that accompany each video, participate in the discussion forums, develop and complete a Case Study, and evaluate the cases of three other MOOC participants.",
    "requirements": "This MOOC serves professionals who want to learn to create trustable,\nengaging and often interactive content to advance their enterprise’s future.\nThis MOOC is for people anywhere in an organization who have content development\nexperience and now want to significantly improve their abilities to understand\naudiences and develop strategic words, pictures, graphics and videos to\nconvey their organization’s most important goals.",
    "effort": "2-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/contentstrategy",
    "title": "Content Strategy for Professionals 1: Engaging Audiences for Your Organization",
    "courseraId": "488",
    "subjects": "Information, Tech & Design"
}