{
    "source": "Coursera",
    "description": "\nThis course is a novice-friendly and delightful introduction to computer science and to programming Android apps for smartphones and tablets. No prior programming knowledge is necessary. In this course you will have fun learning to create an app for modern Android devices, such as the Nexus tablet.\nYou will use the programming tools that Android software developers use to build your own useful app during this course. Along the way, we will introduce fundamental computer science principles and programming ideas that power today’s smartphone and tablet apps.\nWe will also peek beyond the borders of Android programming to the world of computer science. Meet computer science undergraduates, see one of the first vacuum tube computers, the first transistor, and now-modern scientific research on the Blue Waters supercomputer—all at Illinois.\n\nAndroid Developer Track: Weeks 1–5 (required for passing the course):\nThis portion of the course is intended to give you a slow and gentle introduction to the basics of Android application development such as downloading, installing, and setting up the tools you will use in this course. You will also create your first Android app and share the results of your experience with your classmates—all while writing hardly any code at all! \nComputer Science and Programming Track: Weeks 6–8 (optional):\nDuring this latter portion of the course, you can delve deeper into computer science fundamentals and beginner programming techniques. Together we will explore this content while developing another really cool project to share. In this course, you will learn the fundamental computer science principles that power today’s apps. You will also create your own Android app using Java and standard software development tools.",
    "contents": "This course is composed of 2 tracks organized into 8 distinct weekly topics:\n\nAndroid Developer Track\nWeek 1: An App for Hello World\nWeek 2: A Simple App for ILLIAC\nWeek 3: A Working App for ILLIAC\nWeek 4: An App for Emily\nWeek 5: A Simple Web App and Debugging Code in 0g\nComputer Science and Programming Track\nWeek 6: An App to Share My Views\nWeek 7: An App for Bitmaps and Images\nWeek 8: An App for Moving Pixels\n\n&nbsp;",
    "requirements": "No prior computer science experience is required.",
    "effort": "5-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/androidapps101",
    "title": "Creative, Serious and Playful Science of Android Apps",
    "courseraId": "131",
    "subjects": "Computer Science: Software Engineering"
}