{
    "description": "To be effective, educational technologies must be designed based on what we know about how people learn. Through interviews with multiple experts in the field, this course examines educational technologies, outlines the theories that influenced their development, and examines their use. The course leads up to a final project – a kickstarter style pitch for a new educational technology - which is worked on iteratively across the weeks.  It involves active weekly participation.\n\nIn week 1, we’ll talk about the history of educational technologies and how they change the way we learn. We’ll also discuss two important educational theories that focus on student-centered learning.\n\nIn week 2, we’ll explore what it means to learn something and examine several different approaches to deepen learning. We’ll begin by introducing a specific framework for thinking about learning. We’ll then take a close look at how educational software developers are more deeply engaging learners and even providing feedback to students as they learn.\n\nWeek 3 will focus on forms of Active Learning, where students choose and pursue activities based on their own interests. We’ll also talk with experts about designing to help build important non-cognitive skills, like persistence and developing mastery.\n\nWeek 4 will move from individual learning to collaborative learning in a range of forms, from apprenticeships to communities of practice. We’ll speak with experts about the many ways learning in groups can manifest itself. No matter what the medium, collaborative learning has a lot to teach us.\n\nWeek 5 focuses on assessment.  All the clever educational technology design in the world isn’t very useful if we don’t know whether students’ learning is being enhanced by it or what changes need to be made to increase its effectiveness. We’ll talk with teachers, students, and assessment experts who will provide an overview of the different types of assessment and how technology is changing the field of assessment.\n\nFinally, in week 6, we’ll talk about design-based research, a methodology for research and design of educational innovations in which you create projects that embody the educational change you wish to study.\n\nWeek 0 of this course is a 'ramp-up' week for participants to introduce themselves to one another and become familiar with the forums and other course platform features.",
    "instructors": [
        "Eric Klopfer",
        "Scot Osterweil",
        "Judy Perry"
    ],
    "requirements": "This course is upper undergrad\/low grad.  There are no pre-reqs, but assumes that you have a technology background with an education interest, OR an education background with interest in technology.  In either case students should have comfort with technology and interest in education.  They should also have a desire to actively participate in the course, as that is a requirement.",
    "length": "13 weeks",
    "effort": "4 - 6 hours\/week",
    "prices": "Free",
    "institutions": "MITx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/design-development-educational-mitx-11-132x",
    "title": "Design and Development of Educational Technology"
}