{
    "source": "Coursera",
    "description": "This course provides you with opportunities to integrate and\napply your information security knowledge.\n\nThis course provides you with opportunities to integrate and\napply your information security knowledge. Following the case-study approach,\nyou will be introduced to current, real-world cases developed and presented by\nthe practitioner community. You will design and execute information assurance\nstrategies to solve these cases.\n\nTopics explored include: \nAnalysis and problem solving using\ncases&nbsp;contracted&nbsp;from real world problems in Information Assurance\nincluding: \n\nSelection and application of controlsConstruction of security policiesUnderstanding and application of regulatory\n     requirementsUnderstanding and application of business\n     constraints&nbsp;Communication of risk to non-information assurance\n     professionalsIdentification and remediation of new threatsAnalysis and performance of incident responseCommunication of Information Assurance\nprinciples and concepts \n\nPeer reviewed analysis of each caseReading and class explanation of good and bad examples\n     (from news and public sources)Reading and peer discussion of current events in\n     Information Assurance This course provides you with opportunities to integrate and apply your information security knowledge.",
    "contents": "With successful completion of the course students should be able to:Describe the nature of security risk in a business and an IT contextCompare and apply several models for security risk assessmentFacilitate a risk assessment process and gain consensus on risk-based decisionsIncorporate risk assessment into an IT security plan",
    "requirements": "Ability to analyze cyber\n     security threats and vulnerabilities in the context of an organizationAbility to analyze cyber\n     security policies, plans and proceduresUnderstanding of the\n     organizational governance principles in cybersecurityUnderstanding of\n     privacy, accountability and ethical behavior as it applies to cybersecurity.Understanding of formal\n     models for information security&nbsp;General knowledge of risk management\nframeworks \n\n",
    "effort": "4-6 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/infosec",
    "title": "Designing and Executing Information Security Strategies",
    "courseraId": "100",
    "subjects": "Information, Tech & Design, Computer Science: Systems & Security"
}