{
    "description": "Sign Up to Be Notified When This Course Opens for Enrollment.\n\n#mc_embed_signup{background:#fff; clear:left; font:14px Helvetica,Arial,sans-serif; }\n\t\/* Add your own MailChimp form style overrides in your site stylesheet or in this style block.\n\t   We recommend moving this block and the preceding CSS link to the HEAD of your HTML file. *\/\n\n\n\n\n\n\n\n\n\n\n6.341x is designed to provide both an in-depth and an intuitive understanding of the theory behind modern discrete-time signal processing systems and applications.  The course begins with a review and extension of the basics of signal processing including a discussion of group delay and minimum-phase systems, and the use of discrete-time (DT) systems for processing of continuous-time (CT) signals.  The course develops flow-graph and block diagram structures including lattice filters for implementing DT systems, and techniques for the design of DT filters. Parametric signal modeling and the efficient implementation of DT multirate and sampling rate conversion systems are discussed and developed. An in-depth development of the DFT and its computation as well as its use for spectral analysis and for filtering is presented. This component of the course includes a careful and insightful development of the relationship between the time-dependent Fourier transform and the use of filter banks for both spectral analysis and signal coding.\n\n6.341x is organized around eleven units each typically consisting of a set of two to four topics. The source material for learning each topic includes suggested reading in the course text, clarifying notes, other related reading, and video excerpts and will include an interactive on-line discussion forum. The course text is the widely used text by Oppenheim and Schafer (third edition), available on the course website in viewable format. The video segments are adapted from live video recordings of the MIT residential course. \nEach topic includes a set of automatically-graded exercises for self-assessment and to help in digesting and understanding the basics of the topic, and in some cases to preview topics. A typical unit in the course concludes with a set of more extensive problems to help in integrating the topics and developing a deeper understanding. Automatic grading of your answers to these problems as well as solutions will be provided.\n\n \n\nFAQ\n\nWho can register for this course?\nUnfortunately, learners from Iran, Sudan, Cuba and the Crimea region of Ukraine will not be able to register for this course at the present time. While edX has received a license from the U.S. Office of Foreign Assets Control (OFAC) to offer courses to learners from Iran and Sudan our license does not cover this course. Separately, EdX has applied for a license to offer courses to learners in the Crimea region of Ukraine, but we are awaiting a determination from OFAC on that application. We are deeply sorry the U.S. government has determined that we have to block these learners, and we are working diligently to rectify this situation as soon as possible.\n\nCite this course as\n\nAlan V. Oppenheim and Thomas A. Baran, 6.341x Discrete-Time Signal Processing, on edX, Spring 2015.  https:\/\/www.edx.org\/course\/mitx\/mitx-6-341x-discrete-time-signal-4396\n\n ",
    "instructors": [
        "Alan V. Oppenheim",
        "Tom Baran",
        "Tarek Lahlou",
        "Content Team"
    ],
    "requirements": "6.341x assumes a strong background in the basics of signals and systems and some more advanced exposure to that basic material through an advanced undergraduate subject and\/or industrial or research experience. \n ",
    "effort": "8 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $100",
    "institutions": "MITx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/discrete-time-signal-processing-mitx-6-341x-0",
    "title": "Discrete-Time Signal Processing"
}