{
    "description": "This course explains one of the key molecules in life: Deoxyribonucleic Acid\n(DNA). DNA stores the genetic information in all living cells. The sequence of\nits building blocks defines both individual identity and species diversity.\nChanges in DNA can lead to cancer and other diseases. DNA-based technology is\nnow used to detect and treat diseases. In this course, we will take you on a\njourney from the DNA molecule to the development of novel therapies. We will\nfirst look at some historical aspects and key experiments such as how DNA was\nidentified and proven to be the keeper of genetic information. We will then\ndescribe how DNA becomes duplicated (when cells divide) and how the genetic\ninformation stored on DNA is organized into genes. Next, we will explain how\ngenes become transcribed into a messenger molecule (mRNA) and eventually\ntranslated into proteins that carry out the actual cellular functions. With\nthis basic knowledge, we will then look at simple DNA-based techniques and how\nthey are employed not just in basic research but also in everyday life: for\nthe analysis of food, in crime scene investigations and forensics, for the\ndiagnosis of genetic diseases, and for therapy development in modern molecular\nmedicine. When students have completed the course, they will know a lot about\nstructure, function, and uses of DNA, and they will understand the DNA-related\nwords that are often used in the news (e.g. \"gene\", \"mutation\", \"DNA\nfingerprint\"). The course will be organized into 14 units of approx. 15 min\neach. The units will follow a common scheme with a short introductory sequence\nthat discusses the importance of the topic covered. The main part of the\nlecture will have molecular models, power point animations, live drawings, and\nshort lecture video sequences. At the end of each unit, we will provide a\nquestion catalogue and links to supporting material. Immediate self testing\nwill be possible through multiple choice questions and interactive tasks. As\nhomework, students will work on \"open questions\" in student-centered\ndiscussion groups. Open questions are based on but not restricted to the\nmaterial covered in the course, and students will be encouraged to do their\nown reading to answer them. The fourteen units comprise the following topics:\n01\\. How DNA is present in everyday life (DNA History I) 02\\. DNA History II\n03\\. The structure and properties of DNA - DNA fingerprint 04\\. Replication -\nthe copying of DNA 05\\. From DNA to Protein I - Transcription of Genes 06\\.\nFrom DNA to Protein II - RNA processing 07\\. From DNA to Protein III -\ntranslating the genetic code 08\\. Methods I - making Genes visible 09\\.\nMethods II - amplifying Genes 10\\. Introduction to Genetic Diseases - Cancer\n11\\. Consequences of Mutations 12\\. How to repair mutations? 13\\. Muscular\nDystrophies - when muscles die 14\\. Stem Cell Therapies - replacing defective\ncells Learning objectives Participants will be able to answer the following\nquestions after completing the course: 1\\. Why and how has DNA become one of\nthe most powerful tools in research? 2\\. What exactly does gene therapy mean?\n3\\. Why is it so hard to find a cure for cancer? 4\\. For which diseases may\nDNA-based technology help developing a therapy? 5\\. What are potentials and\nrisks in gene-based medicine?",
    "instructors": "Dr Susanne Illenberger, Prof. DPhil. Sebastian Springer",
    "institutions": "School: \n                                Jacobs University Bremen",
    "url": "https:\/\/www.coursetalk.com\/providers\/iversity\/courses\/dna-from-structure-to-therapy",
    "title": "DNA - From Structure to Therapy",
    "language": "en",
    "source": "coursetalk"
}