{
    "source": "Coursera",
    "description": "\nFor more than 3 decades we have heard educators and technologists making a case for the transformative power of technology in learning. However, despite the rhetoric, in many sites and many ways education is still relatively untouched by technology. Even when technologies are introduced, the changes sometimes seem insignificant and the results seem disappointing. If the print textbook is replaced by an e-book, do the social relations of knowledge and learning necessarily change at all or for the better? If the pen-and-paper test is mechanized, does this change the nature of our assessment systems? Technology, in other words, need not necessarily bring significant change. Technology might not even represent a step forward in education.\n\nThis course explores 7 affordances of e-learning ecologies, which open up genuine possibilities for what we call New Learning—transformative, 21st century learning:\n\n\nUbiquitous Learning\nActive Knowledge Making\nMultimodal Meaning\nRecursive Feedback\nCollaborative Intelligence\nMetacognition\nDifferentiated Learning\n\n\nThese affordances, if recognized and harnessed, will prepare learners for success in a world that is increasingly dominated by digital information flows and tools for communication in the workplace, public spaces, and personal life. This course offers a wide variety of examples of learning technologies and technology implementations that, to varying degrees, demonstrate these affordances in action. This course introduces innovative approaches to learning and teaching, with a focus on the use of e-learning and social web technologies.",
    "contents": "This course is broken up into 8 weekly modules covering the following topics:\n\nWeek 1: Conceptualizing Learning\nWeek 2: Spatio-Temporal Dimensions of Learning (Ubiquitous Learning)\nWeek 3: Epistemic Dimensions of Learning (Active Knowledge Making)\nWeek 4: Discursive Dimensions of Learning (Multimodal Meaning)\nWeek 5: Evaluative Dimensions of Learning (Recursive Feedback)\nWeek 6: Social Dimensions of Learning (Collaborative Intelligence)\nWeek 7: Cognitive Dimensions of Learning (Metacognition)\nWeek 8: Diversity Dimensions of Learning (Differentiated Learning)",
    "requirements": "This course is designed for people interested in the future of education and the \"learning society,\" including people who may wish to join education as a profession, practicing teachers interested in exploring future directions for a vocation that is currently undergoing transformation, and community and workplace leaders who regard their mission to be in part \"educative.\"",
    "effort": "1-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/elearning",
    "title": "e-Learning Ecologies",
    "courseraId": "1207",
    "subjects": "Information, Tech & Design"
}