{
    "description": "With a significant increase in high-profile data breaches and cybersecurity threats in the last couple years, it is critical for businesses to learn about the costs and investment decisions around securing their online systems. If you make decisions around IT investments in your job or are interested in learning more about securing your business, this course is for you.\n\nWhile many businesses think of cybersecurity as a technical problem, this course broadens that view and shows that security failures are caused as often by bad business decisions and incentive systems as by bad technical design.\n\nThis course provides an introduction to the field of the economics behind cybersecurity, delivered by four leading research teams from distinguished universities around the world, including:\n\nMichel van Eeten of Delft University of Technology in The Netherlands\n\tRoss Anderson of Cambridge University in the United Kingdom\n\tRainer Boehme of University of Münster in Germany\n\tCarlos H.Gañán of Delft University of Technology in The Netherlands\n\tTyler Moore of Southern Methodist University in the USA\nIt will provide you with the economic concepts, measurement approaches and data analytics to make better security decisions, while helping you to understand the forces that shape the security decisions of other businesses, products and services.\n\nThis course will:\n\nTeach you to make choices on investing in your company’s cybersecurity. We discuss and apply different economic models that help determine the costs and benefits of security investments.\n\tArm you with research to make strategic business decisions. We review empirical research into security decisions and incentives of actors. We analyze data on firms in different markets, and apply economic concepts to explain the strategies of attackers.\n\tReview policy and regulations. We discuss available economic tools to better align the incentives for cybersecurity, including better security metrics, cyber insurance\/risk transfer, information sharing, and liability assignment.\nThis course offers a broad view of the field through lectures and exercises that can apply to both early career professionals as well as senior technical managers.\n\nAfter finishing this course you will be able to apply economic analysis and data analytics. You will understand the role played by incentives on the adoption and effectiveness of security mechanisms, and on the design of technical, market-based, and regulatory solutions to different security threats.\n \nAfter successfully completing this course, you will:\n\nPosition yourself as a vital subject matter expert regarding the economic drivers that influence cybersecurity and position your company to move forward and stay competitive.\n\tEngage confidently with management on opportunities and cybersecurity challenges faced by your industry; analyze emerging security threats and how these threats can be mitigated by effectively addressing real economic problems.\n\tLearn and assess the issues of investment in cybersecurity, making your company more productive, while saving time and money.\nUpon successful completion of this course, learners will be awarded a DelftX Professional Education Certificate. The TU Delft Extension School offers Continuing Education Units for this course. Participants of EconSec101x who successfully complete the course requirements will earn a Certificate of Completion and are eligible to receive 2.0 Continuing Education Units (2.0 CEUs).\n\nEnrollment for this course will close on January 29, 2015.\n\nPDF of the Syllabus\n\n \n\nFAQs\n\nWhat is DelftX Professional Education?\n\nDelftX online courses with TU Delft’s standard of educational excellence combined with the flexibility and convenience of online learning that today’s professionals require.\n\nWhat background is required to participate in this course?\n\nThough some previous knowledge in either computer science or economics is recommended, there is no formal prerequisite as all the concepts will be introduced properly. No advance reading is required.\n\nHow will this professional education benefit me?\n\nEconomics of cybersecurity is designed to be valuable to both individuals and companies because it provides a platform for discussion from various technical perspectives. The concepts delivered through this course can spark idea generation, and the knowledge gained can be applied to any company’s approach to cybersecurity issues. Specific key benefits are:\n\n\n\tPosition yourself as a vital subject matter expert regarding the economic drivers that influence cybersecurity and position your company to propel forward and stay competitive\n\t\n\t\n\tEngage confidently with management on opportunities and cybersecurity challenges faced by your industry; analyze emerging security threats and how these threats can be mitigated by effectively addressing real economic problems\n\t\n\t\n\tLearn and assess the issues of investment in cybersecurity, making your company more productive while saving time and money.\n\t\nDoes this course offer any special value or exclusive experiences to participants?\n\nEconSec101x offers a unique opportunity to gain insights into the economics of cybersecurity guided by the most active researchers in the field. Students will obtain an understanding of professional, ethical, legal, security and social issues and responsibilities\n\nCan I still enroll if the course has started?\n\nYes, you can enroll until one week after the course start date and still have the opportunity to obtain a certificate.\n\nWhat types of certificates does DelftX offer?\n\nUpon successful completion of this course, learners will be awarded a DelftX Professional Education Certificate.\n\nCan I receive Continuing Education Units?\n\nThe TU Delft Extension School offers Continuing Education Units for this course. Participants of EconSec101x who successfully complete the course requirements will earn a Certificate of Completion and are eligible to receive 2.0 Continuing Education Units (2.0 CEUs)\n\nHow do I receive my certificate and CEUs?\n\nUpon successful completion of the course, your certificate can be printed from your dashboard. The CEUs are awarded separately by the TU Delft Extension School.\n\nCan I take this course without going through the ID-verification procedure?\n\nYes, you can. Please contact student support and indicate that you want to take EconSec101x by paying the fee but without going through ID-verification. Make choices on investing in your company’s cybersecurity\n\tUnderstand economic models that help determine the costs and benefits of security investments.\n\tUnderstand the research to make strategic business decisions: empirical research into security decisions and incentives of actors, analyze data on firms in different markets, and apply economic concepts to explain the strategies of attackers.\n\tHave an overview of policy and regulations: available economic tools to better align the incentives for cybersecurity, including better security metrics, cyber insurance\/risk transfer, information sharing, and liability assignment.",
    "instructors": [
        "Michel van Eeten",
        "Ross Anderson",
        "Rainer Böhme",
        "Carlos H. Gañán",
        "Tyler Moore",
        "Sophie Van Der Zee",
        "David Modic"
    ],
    "requirements": "Some level of familiarity with either computer science, economics or policy is recommended",
    "length": "5 weeks",
    "effort": "6 - 8 hours\/week",
    "institutions": "DelftX",
    "subjects": "Business & Management",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/economics-cybersecurity-delftx-econsec101x",
    "title": "Economics of Cybersecurity"
}