{
    "description": "KIeHealthX will introduce students to the field of eHealth and its opportunities and challenges. During the course you will get to know the different concepts that are used in the field and learn how it developed historically. This basic knowledge will help you to understand the opportunities and challenges of the field. You will meet different stakeholders from various countries and get to know their views on the opportunities and challenges of eHealth. We will introduce you to eHealth strategies and frameworks for developing and analyzing them. You will get to know methods for eHealth service development and discuss basic requirements that are necessary to achieve sustainable eHealth applications for both clinical professionals and patients.\nYou will see examples of eHealth applications in different contexts and for different users. We will discuss questions such as:\n\nWhat is it that is so unique about the health sector?\n\tWhat factors are important - to avoid failures when implementing eHealth?\n\tWhat are usable tools for care professionals?\n\tHow can patients best organize and use their own health data to improve their condition?\neHealth is a global issue but successful eHealth implementation is very dependent on the local context. At the end of the course you will have a basic understanding what eHealth is and how to set up eHealth strategies and discuss them in your specific context. You will also get to know success factors and pitfalls for the development of sustainable eHealth services and their implementation.  To define basic eHealth concepts and describe the development of the field.\n\tWhat the success factors and barriers are for eHealth implementation.\n\tTo analyze eHealth strategies and adapt them in relation To your specific context.",
    "instructors": [
        "Sabine Koch",
        "Maria Hägglund",
        "Sara Riggare"
    ],
    "requirements": "None but some experience with the health sector either as patient, care professional, IT and healthcare manager or policy maker is an advantage.",
    "length": "6 weeks",
    "effort": "5-6 hours per week",
    "prices": "Free",
    "institutions": "KIx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/ehealth-opportunities-challenges-kix-kiehealthx",
    "title": "eHealth – Opportunities and Challenges"
}