{
    "description": "EE40LX teaches the fundamentals of engineering electronic interfaces between the physical world and digital devices. Students can expect to cover the material of a traditional first circuits course with a project-based approach. We start with essential theory and develop an understanding of the building blocks of electronics as we analyze, design, and build different parts of a robot from scratch around a microcontroller. This course uses the Texas Instruments MSP430G2 LaunchPad, but you are welcome to bring whichever development board or microcontroller you like!\n\nUseful mathematics will be discussed where appropriate, but only a working knowledge of high school algebra is required to follow along for most of the course. The philosophy of the course is to learn by doing, so every lecture features a substantial lab component. Students are invited to work together in small groups to build their own robots along with the instructors. There will also be individual circuit analysis and design exercises to reinforce the theories presented in the course. Those who successfully complete each theory assignment and earn a passing grade will get an Honor Code certificate from BerkeleyX.\n\nAdditionally, a kit of electronic components will be available from Newark element14 starting June 12. The kit is not necessary to obtain a certificate for this run of the course, but it will greatly enhance your learning experience. Some mechanical components are required to complete the robot as presented in the course. Also, the lab experience will be most effective if you have access to a digital multimeter.\n\nCreativity is encouraged! Students who are willing to work outside the bounds of the class to develop their own inventions will get the most out of this guided learning experience.\n\nMyDAQ Information\nThose who do not have access to an oscilloscope or a digital multimeter might consider purchasing a MyDAQ to enable measurements. The video modules use the MyDAQ and the MyProtoBoard as measurement equipment to debug circuits. National Instruments has made available the MyDAQ for students in this course. If you are interested, take a look at the MyDAQ ordering page: http:\/\/www.studica.com\/us\/en\/BerkeleyMOOC.htmlParts Kit Information\nThe parts included in the construction of the robot can be purchased at Newark's landing page, which can be found here: http:\/\/www.element14.com\/community\/community\/learning-center\/online-learning\/moocs\/edxucb-bridging\nA detailed bill of materials with more information can be found here: courses.edx.org\/asset-v1:BerkeleyX+EE40LX+2T2015+type@asset+block@EE40LX_PartsList_Summer15.pdf\n\nWhat is the format of the class?\nThe class consists of eight modules. Every module consists of a combination of theory-based lectures and lab-based discussions where we apply that module’s theory to building a part of a robot. Quiz exercises are sprinkled throughout the videos to reinforce your knowledge and every module ends with a problem set that reinforces the design and analysis aspects of the class.\n\nIs this class taught at UC Berkeley?\nThis class is part of the laboratory component of \"EE40: Introduction to Microelectronic Systems,\" the first circuit analysis course at UC Berkeley. It was specifically designed for the online course format.\n\nWhat will the robot do?\nThe bare-bones robot that we build will be capable of bouncing around, responding to light or touch inputs, and responding to a loud audio signal.\n\nWhat supplies and equipment will I need to get the most out of this course?\nIn order to download programs to the MSP430 microcontroller, you will need access to a modern operating system (Apple, Windows, or Linux) with the Energia environment (http:\/\/energia.nu\/download) installed. Additionally, access to some wire cutters and pliers would be useful. Also, the lab experience will be most effective if you have access to a digital multimeter. An oscilloscope would be useful, but not necessary.\n\nThe NI MyDAQ has been made available for students who would like to follow along with the course. The robot project as presented also requires a few wooden craft sticks and two springs which can be found at a local hardware store.\n\nHow much does the kit cost?\nThe parts kit will cost around $50 USD for most parts. You are welcome to purchase a kit with another student and to work together on labs to split costs. We will also demonstrate other parts not in the kit for those interested in extending their projects.\n\nWill I need to know how to program?\nSample programs are provided in each module that will allow you to test your own circuits with an MSP430 LaunchPad controller. These programs will be explained in optional videos for interested students. If you already know how to code, you can tweak these programs to add additional functionality to your project.\n\nWill this course cover microcontroller programming?\nNo. Sample programs written in Energia, a high-level language, will be provided, but programming will not be explicitly covered. Students interested in learning microcontroller programming should refer to UT Austinx’s Embedded Systems course.\n\nWhat if I already have a microcontroller?\nSince analog electronics are the emphasis of the course, you should feel free to use any microcontroller you feel comfortable with. However, the use of any other microcontrollers would require you to write your own programs.\n\nIs there a required textbook?\nNo textbook is required for this course. Handouts are provided for the concepts presented in the class; material for some of these handouts is taken from the 2nd edition of the book Circuits by Fawwaz Ulaby and Michel Maharbiz and we recommend the book as way to delve deeper into basic circuit concepts. We also occasionally provide links to web content that we find useful or informative.\n\n  Fundamentals for engineering electronic interfaces between the physical world and digital devices\n\tDevelop an understanding of the building blocks of electronics\n\tAnalyze, design, and build different parts of a robot from scratch\n ",
    "instructors": [
        "Michel M.  Maharbiz",
        "Tom Zajdel"
    ],
    "requirements": "High school level algebra and physics are recommended, but not required. Some exposure to computer programming would be useful for those who want to improve upon the robot design. The most important requirement is a willingness and desire to build things with your hands!",
    "length": "8 weeks",
    "effort": "6 - 10 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "UC BerkeleyX",
    "subjects": "Electronics",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/electronic-interfaces-bridging-physical-uc-berkeleyx-ee40lx-0",
    "title": "Electronic Interfaces: Bridging the Physical and Digital Worlds"
}