{
    "description": "Learn how electronic gadgets are designed, developed, and built as embedded systems that shape the world.\n\nThis is a hands-on, learn-by-doing course that shows you how to build solutions to real-world problems using embedded systems. The course uses a bottom-up approach to problem solving, building gradually from simple interfacing of switches and LEDs to complex concepts like display drivers, digital to analog conversion, generation of sound, analog to digital conversion, graphics, interrupts, and communication. We will present both general principles and practical tips for building circuits and programming the microcontroller in the C programming language. You will develop debugging skills using oscilloscopes, logic analyzers, and software instrumentation. Laboratory assignments are first performed in simulation, and then you will build and debug your system on the real microcontroller. At the conclusion of this course you will possess the knowledge to build your own arcade-style game from the ground up.\n\nThis is the third time we have offered this course. Since the reviews have been overwhelmingly positive we do not plan major changes from the previous offering of the course. There are 14 labs, but students can pick and choose seven of them to achieve certification. The three labs that students found most rewarding were the finite state machine traffic light controller, generating sound using a digital to analog convertor, and creating a smart object using Wifi communication. This time we will make minor changes to a few labs to enhance the fun and focus the learning on embedded systems.\n\nTo complete this course, you will be required to purchase a Texas Instruments TM4C123 microcontroller kit and a few electronic components. This microcontroller has a state-of-the-art ARM Cortex-M4 processor.\n\nWe will provide instructions about purchasing the kit and installing required software at: http:\/\/edx-org-utaustinx.s3.amazonaws.com\/UT601x\/index.html.\n\nFAQ\n\nHow will the Spring 2016 course be the same as the course run Spring 2015? \n\nThis course will be lab-based using the same Texas Instruments Tiva series TM4C123 LaunchPad and the set of extra components. We will continue to use the Keil development system, and students will first develop\/test in simulation followed by testing on the real board. 12 of the 14 labs will be essentially the same and two labs will be upgraded. Same as last year, students will need to complete at least seven of the labs on the real board to achieve certification.\n\nHow will the Spring 2016 course be different from the course run Spring 2015? \n\nThis time we will make minor changes to a few labs to enhance the fun and focus the learning on embedded systems.\n\nIs this class related to a campus course of The University of Texas at Austin? \n\nYes, this course corresponds to the Electrical and Computer Engineering course EE319K Introduction to Embedded Systems, which is a required course offered in the freshman year to all ECE students and some BME students.\n\nIs there a textbook associated with this class? \n\nThe class is based on the textbook Embedded Systems: Introduction to ARM Cortex-M Microcontrollers ISBN: 978-1477508992. However, the purchase of the textbook is not required.\n\nDo I need a Windows PC? \n\nYes, any system running Windows XP, Windows 7, Windows 8, or Windows 10 will be ok. Furthermore, with a third party virtualization software like Parallels or VMware Fusion, one can install the Windows operating system on a Mac.\n\nHow much does it cost to take this class? \n\nIt does not cost anything to take the class. However, since this a lab-based class, there is a lab kit you will purchase. You will also have the option of obtaining an ID Verified certificate for a $50 fee.\n\nHow much does the kit cost? \n\nIn the US one can purchase the microcontroller board and parts for about $40 USD plus shipping. There is also an optional graphics display for an additional $10 USD plus shipping. The optional graphics display will make the last lab a lot more fun. The CC3100 Boosterpack costs $20 USD plus shipping and will be required if you wish to complete the Wifi lab.\n\nCan I take this course without buying the kit? \n\nYes, there are three approaches to taking this class.\n\nYou could listen to the videos, read the assignments, and play with the interactive learning tools.\n\tThe second option involves installing the Keil uVision integrated development environment on a Windows PC, and performing the lab assignments in simulation mode.\n\tThe third option, which fully captures the essence of embedded systems, can be done by performing the lab assignments on a real system that you will purchase.\nCan I use another microcontroller? \n\nIf you are following approach one, where you are listening to the videos, reading the assignments and playing with the interactive tools, then you can use any microcontroller. However, if you wish to obtain certification, you will need to use the Tiva series TM4C123 so you can interact with the automatic graders.\n\nWhat does it mean for the display to be optional? \n\nIn the last lab you will build an arcade-style game. We expect most students will connect the microcontroller board to the PC. In this manner the game output can be displayed on a window of the PC. However, for about $10 USD plus shipping, you can order a small Nokia 5110 LCD display so your game can be operated in a stand-alone fashion.\n\nWill this course really take 10 hours per week? \n\nThe first option of just listening, reading and playing with interactive animations will take two or three hours per week. The second option of performing the labs in simulation will take five or six hours per week. The third option of building and testing systems on the real microcontroller will require 10 hours per week.\n\nCan I take this course if I have never programmed before? \n\nAnyone is allowed register, but we believe to get the maximum benefit you should have prior programming experience at an introductory level. However, this could be your second class involving programming.\n\nCan I contact the Instructors or Teaching Assistants? \n\nYes, but not directly. The discussion forums are the appropriate venue for questions about the course. Instructors will monitor these forums and try to respond to the most important questions; in many cases responses from other students will be adequate and faster.\n\nI really want to take this course, what is next? \n\nYou should purchase the microcontroller and extra electronics before the start of class. This class is available worldwide and we will provide region-specific methods to obtain the kit at http:\/\/edx-org-utaustinx.s3.amazonaws.com\/UT601x\/index.html.\n\n  Understanding of embedded systems using modular design and abstraction\n\tC programming: considering both function and style\n\tHow to build and test circuits with switches, LEDs, resistors, potentiometers, and liquid crystal displays\n\tSynchronizaztion of hardware and software input\/output with switches, lights, sound, sensors. motors, and liquid crystal displays\n\tHow to solve problems using a finite state machine\n\tImplementation of an I\/O driver and multi-threaded programming using interrupts\n\tDebugging using oscilloscopes, logic analyzers, and software instrumentation\n\tHow to read a data sheet\n\tHow to construct a smart object and create a system as part of the Internet of Things",
    "contents": "Course Syllabus\n        The best way to understand what you will learn in this class is to review the list of the labs you will complete and the example projects we will build. You will complete each lab first in simulation and then on the real board. For each module we will design a system and you will build and test a similar system.\n\nModule 1: Welcome and introduction to course and staff\n\tModule 2: Fundamental concepts\n\tNumbers, Computers, and the ARM Cortex M processor \n\t\t​Lab 2. Run existing project on LaunchPad with switch input and LED output.\n\t\n\tModule 3: Electronics\n\tResistors, Voltage, Current and Ohm’s Law\n\t\n\tModule 4: Digital Logic \n\tTransistors, flip flops and logic functions\n\t\tLab 4. Debug a system with two inputs and two outputs.\n\t\n\tModule 5: Introduction to C programming \n\t​Lab 5. Write a C function and perform input\/output.\n\t\n\tModule 6: Microcontroller Input\/Output \n\t​Lab 6. Write C software that inputs from a switch and toggles an LED output.\n\t\n\tModule 7: Design and Development Process \n\t​Lab 7. Write C functions that inputs from a switch and outputs to two LEDs, which is a simulated pacemaker.\n\t\n\tModule 8: Interfacing Switches and LEDs \n\t​Lab 8. Interface an external switch and LED and write input\/output software.\n\t\n\tModule 9: Arrays and Functional Debugging \n\t​Lab 9. Write C functions using array data structures that collect\/debug your system.\n\t\n\tModule 10: Finite State Machines \n\t​Lab 10. Interface 3 switches and 6 LEDs and create a traffic light finite state machine.\n\t\n\tModule 11: UART - The Serial Interface, I\/O Synchronization \n\t​Lab 11. Write C functions that output decimal and fixed-point numbers to serial port.\n\t\n\tModule 12: Interrupts \n\t​Lab 12. Design and test a guitar tuner, producing a 440 Hz tone.\n\t\n\tModule 13: DAC and Sound \n\t​Lab 13. Design and test a digital piano, with 4 inputs, digital to analog conversion, and sound.\n\t\n\tModule 14: ADC and Data Acquisition \n\t​Lab 14. Design and test a position measurement, with analog to digital conversion and calibrated output.\n\t\n\tModule 15: Systems Approach to Game Design \n\t​Lab 15. Design and test a hand-held video game, which integrates all components from previous labs.\n\t\tThis lab will not be graded, but we will provide a way for you to upload your source to a server and download code from other students to study and to play.\n\t\n\tModule 16: Wireless Communication and the Internet of Things \n\t​Lab 16. Connect a CC3100 booster pack to the LaunchPad and communicate with an access point.\n\t\tThis lab will not be graded, but we will provide a way for you communicate with a class server.\n\t\nNote\n\nYou will need to purchase either the EK-TM4C123GXL board from Texas Instruments and a set of electronic components. The cost for these parts is about $40 USD plus shipping. We will provide instructions at: http:\/\/edx-org-utaustinx.s3.amazonaws.com\/UT601x\/index.html .\n\nYou will need a PC running Windows XP, Windows 7, Windows 8, or Windows 10. You will need to be able to install the Keil uVision integrated development environment, which will require administrative privileges to the PC. We will provide instructions at: http:\/\/edx-org-utaustinx.s3.amazonaws.com\/UT601x\/index.html .",
    "instructors": [
        "Jonathan Valvano",
        "Dr. Ramesh Yerraballi"
    ],
    "requirements": "Computer programming course in any language with exposure to variables, arithmetic, logic, loops, and functions\n\tHigh school physics course covering current, voltage, resistance, and power",
    "length": "16 weeks",
    "effort": "10 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "UTAustinX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/embedded-systems-shape-world-utaustinx-ut-6-03x",
    "title": "Embedded Systems - Shape The World"
}