{
    "source": "Coursera",
    "description": "Energy consumption and its consequences have spurred some of the most important public debates of our time. We are presently confronted by an unprecedented paradox:&nbsp; the negative consequences of fossil fuel combustion have never been clearer, but oil and gas extraction are experiencing a technological revolution.&nbsp; How long with fossil fuel supplies last? What are the long-term implications of fracking and other technologies that extend their use? At what point will renewable energy systems replace fossil fuels altogether?&nbsp; Such questions have a direct impact on our health, wealth, and security, but reliable answers are scarce. &nbsp;In this class we will develop a unique, “big picture” perspective on these issues, based on the concept that all energy systems, fossil and renewable, depend on finite geologic resources of the Earth.&nbsp; Armed with this perspective, energy consumers, producers, and policy makers can make more informed choices for the future.&nbsp; This course will emphasize three universal principles: Energy quality matters more than quantity,&nbsp;&nbsp; Technological advances continually redefine reality, and All energy systems carry their own negative consequences.&nbsp; We will explore energy options ranging from solar to nuclear, revealing how the above principles apply to each. &nbsp; Learn how all energy systems depend on the finite resources of the Earth, and how this relationship can provide a unique “big picture” perspective on energy supply.  ",
    "contents": "Week 1:&nbsp; “In the Beginning”: the historic and geologic context of human energy use.Week 2:&nbsp; “Leveraging the Past”: energy sources that have been naturally enriched through the leverage of geologic time.Week 3:&nbsp; “Living in the Present”: renewable energy sources that draw on the present flux of energy from the Sun.Week 4:&nbsp; “Planning for the Future”: prospects and challenges of future energy use.",
    "requirements": "All are welcome!&nbsp; A high school level understanding of math and science is helpful but not required.",
    "effort": "2-3 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/earthenergy",
    "title": "Energy and the Earth",
    "courseraId": "2426",
    "subjects": "Engineering"
}