{
    "source": "Coursera",
    "description": "A genome may look like an incomprehensible string of the letters A, C, G, and T. Yet hidden in the three billion nucleotides of your genome is a secret language. This course offers an introduction to how we can start to understand this language by using algorithms to find hidden messages in DNA.What do these hidden messages say? &nbsp;In the first chapter of the course, hidden DNA messages indicate where a bacterium starts replicating its genome, a problem with applications in genetic engineering and beyond. In the second chapter, hidden DNA messages tell us how organisms know whether it is day or night as well as how the bacterium causing tuberculosis is able to hide from antibiotics. We will see how randomized algorithms, which toss coins\nand roll dice, can be used to find these messages.Each of the two topics in the course builds the algorithmic knowledge required to address this challenge. In the end of the course, you will be able to apply popular bioinformatics software tools for finding regulatory motifs in experimental data sets and solve our Bioinformatics Application Challenge.\n\n This course begins a series of classes illustrating the power of computing in modern biology. Please join us on the frontier of bioinformatics to look for hidden messages in DNA without ever needing to put on a lab coat. After warming up our algorithmic muscles, we will learn how to apply popular bioinformatics software tools to real experimental datasets.",
    "contents": "Where in the Genome Does Replication Begin? (Algorithmic Warmup):Introduction to DNA replicationHidden messages in the replication originSome hidden messages are more surprising than othersAn explosion of hidden messagesThe simplest way to replicate DNAAsymmetry of replicationPeculiar statistics of the forward and reverse half-strandsSome hidden messages are more elusive than othersA final attempt at finding DnaA boxes in E. coliEpilogue: Complications in oriC predictionsWhich DNA Patterns Play the Role of Molecular Clocks? (Randomized Algorithms)Do we have a \"clock\" gene?Motif finding is more difficult than you thinkScoring motifsFrom motif finding to finding a median stringGreedy motif searchMotif finding meets Oliver CromwellRandomized motif searchHow can a randomized algorithm perform so well?Gibbs samplingGibbs sampling in actionComplications in motif findingEpilogue: How does Tuberculosis hibernate to hide from antibiotics?Bioinformatics Application Challenge: Searching for regulatory motifs in Mycobacterium tuberculosis",
    "requirements": "If you are aiming at earning a standard certificate in this class, then you do not need to have any experience in biology or programming. &nbsp;The only prerequisite is the enthusiasm to learn about how computational approaches are used in modern biology :)If you are aiming at earning a certificate with distinction, then you should either know the basics of programming in the language of your choice (there is no required language for this course) or be willing to learn about programming before the course begins. In this case, we have the following suggestions for resources that will help you quickly learn the basics of programming.The language tracks on&nbsp;Codecademy, particularly the Python track.An Introduction to Interactive Programming with Python, the acclaimed Coursera course.Introductory problems on&nbsp;Rosalind, a resource for learning bioinformatics created by the course instructors.",
    "effort": "4-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/hiddenmessages",
    "title": "Finding Hidden Messages in DNA (Bioinformatics I)",
    "courseraId": "2856",
    "subjects": "Computer Science: Software Engineering, Mathematics, Computer Science: Theory"
}