{
    "source": "Coursera",
    "description": "This course introduces the cornerstones of functional programming using the Scala programming language. Functional programming has become more and more popular in recent years because it promotes code that’s safe, concise, and elegant. Furthermore, functional programming makes it easier to write parallel code for today’s and tomorrow’s multiprocessors by replacing mutable variables and loops with powerful ways to define and compose functions.  Scala is a language that fuses functional and object-oriented programming in a practical package. It interoperates seamlessly with Java and its tools. Scala is now used in a rapidly increasing number of open source projects and companies. It provides the core infrastructure for sites such as Twitter, LinkedIn, Foursquare, Tumblr, and Klout.  In this course you will discover the elements of the functional programming style and learn how to apply them usefully in your daily programming tasks. You will also develop a solid foundation for reasoning about functional programs, by touching upon proofs of invariants and the tracing of execution symbolically.  The course is hands on; most units introduce short programs that serve as illustrations of important concepts and invite you to play with them, modifying and improving them. The course is complemented by a series of assignments, most of which are also programming projects. Learn about functional programming, and how it can be effectively combined with object-oriented programming. Gain practice in writing clean functional code, using the Scala programming language.",
    "contents": "Week One: Programming paradigms; overview of functional programming and the Scala programming language.\n\nWeek Two: Defining and using functions, recursion and non-termination, working with functions as values, reasoning by reduction. \n\nWeek Three: Defining and using immutable objects, review of inheritance and dynamic binding.\n\nWeek Four: Types and Pattern Matching\n\nWeek Five: Working with Lists\n\nWeek Six: Collections and Combinatorial Search\n\nWeek Seven: Lazy Evaluation",
    "requirements": "You should have at least one year programming experience. Proficiency with Java or C# is ideal, but experience with other languages such as C\/C++, Python, Javascript or Ruby is also sufficient.\n",
    "effort": "5-7 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/progfun",
    "title": "Functional Programming Principles in Scala",
    "courseraId": "116",
    "subjects": "Computer Science: Software Engineering"
}