{
    "source": "Coursera",
    "description": "What is &nbsp;fluid-solid interactions&nbsp; ?&nbsp; It\nis what happens when the &nbsp;motions of a\nfluid and of a solid are somehow coupled. This\nhappens&nbsp; all the time,&nbsp; around\nyou when leaves flutter in the wind,&nbsp; inside you when your heart beats, above you\nwhen wings of a plane vibrate, under the sea... \n\nThe\nidea behind this MOOC&nbsp; is to give you the\nbasic tools to &nbsp;be able to predict and\neventually mitigate &nbsp;&nbsp;things called &nbsp;flutter, galloping, sloshing, vortex-induced\nvibrations, added mass,&nbsp; to cite a few.&nbsp; We are\ngoing to consider &nbsp;any &nbsp;possible domains of applications&nbsp; such as civil engineering,&nbsp; aerospace engineering, nuclear engineering ,\nocean engineering, biomechanics and even food&nbsp;\nprocessing ! \n\nThis is why\nwe &nbsp;called the course “Fundamentals of\nFluid Solid Interactions ”. There are so many phenomena and so many models &nbsp;that&nbsp; we\n&nbsp;&nbsp;need to work together on the basic\nmechanisms . If &nbsp;you want to see how fluid-solid interactions\nwork,&nbsp; and be able to use that knowledge,\njoin us ! Fluid-Solid Interactions happen when the motion  of solids and fluids are coupled. The aim of the course is to give you  the basic tools to  be able to understand, predict and eventually mitigate these interactions.",
    "contents": "Week\n1&nbsp;:&nbsp; Dimensional analysis of fluid-solid couplingThe variety of fluid-solid couplingsDimensional analysis as a classification toolDimensionless numbers in fluid-solid interactions From dimensionless numbers to dimensionless equationsWeek 2&nbsp;: A solid with a still\nfluid. Low reduced velocitiesSmall motions and low reduced velocitiesFluid-added StiffnessNeglecting viscous effects Fluid-added mass. Week 3&nbsp;: A solid with any fluid. Dominant effects of viscosityFluid-added damping&nbsp;Combined effects of fluid viscosityMemory&nbsp; effects&nbsp;Fluid sloshing Coupling of&nbsp; fluid sloshing with solid dynamics Week 4 &nbsp;: Coupling with a fast flow.&nbsp;High reduced velocitiesFlow-induced static instabilities, or bucklingCoupled-mode flutter of airfoils. Week 5&nbsp;: Coupling with a slow flow. Intermediate reduced velocitiesFlutter on one mode Stall flutter of airfoils Galloping of bluff bodies Week 6&nbsp;: Coupling with any&nbsp; flow. The fluid conveying pipe as a reference model of coupling Coriolis dampingSolution for any flow velocityFrom one mode to two modesVortex-induced vibrationsLock-in as a case of coupled-mode flutter",
    "requirements": "Fundamentals of fluid mechanics and solid\/structural mechanics are required. A knowledge in structural dynamics and vibration can be helpful, but is not required. ",
    "effort": "3-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/fsi",
    "title": "Fundamentals of Fluid-Solid Interactions",
    "courseraId": "2650",
    "subjects": "Engineering"
}