{
    "source": "Coursera",
    "description": "Digital images and videos are everywhere these days – in thousands of\nscientific (e.g., astronomical, bio-medical), consumer, industrial, and\nartistic applications. Moreover they come in a wide range of the\nelectromagnetic spectrum - from visible light and infrared to gamma rays and\nbeyond. The ability to process image and video signals is therefore an\nincredibly important skill to master for engineering\/science students, software\ndevelopers, and practicing scientists.  \nDigital image and video processing continues to enable the multimedia\ntechnology revolution we are experiencing today. Some important examples of\nimage and video processing include the removal of degradations images suffer\nduring acquisition (e.g., removing blur from a picture of a fast moving car),\nand the compression and transmission of images and videos (if you watch videos\nonline, or share photos via a social media website, you use this everyday!),\nfor economical storage and efficient transmission. \n\nThis course will cover the fundamentals of image and video processing.  We will provide a mathematical framework to describe and analyze images and videos as two- and three-dimensional signals in the spatial, spatio-temporal, and frequency domains. In this class not only will you learn the theory behind fundamental processing tasks including image\/video enhancement, recovery, and compression - but you will also learn how to perform these key processing tasks in practice using state-of-the-art techniques and tools. We will introduce and use a wide variety of such tools – from optimization toolboxes to statistical techniques. Emphasis on the special role sparsity plays in modern image and video processing will also be given.  In all cases, example images and videos pertaining to specific application domains will be utilized. In this class you will learn the basic principles and tools used to process images and videos, and how to apply them in solving practical problems of commercial and scientific interests.  ",
    "contents": "Introduction,\nImage and Video Processing vs Image and Video Analysis vs Computer Vision, the\nelectromagnetic spectrum, applications of image and video processing2D and 3D\nsignals and systems, linear and shift invariant systems (convolution)2D and 3D\nFourier transform, 2D and 3D discrete-Fourier transform, uniform samplingMotion\nestimation and its applicationsImage and\nvideo enhancement (e.g., edge detection, noise filtering, histogram\nequalization, inpainting)Image\nrecovery (restoration, super-resolution)Video\nrecovery (restoration, super-resolution)Lossless\ncompressionImage\ncompression techniques and standardsVideo\ncompression techniques and standardsImage and\nvideo analysis (e.g., 2D and 3D segmentation, clustering)Sparsity-based\nadvances in image and video processing",
    "requirements": "The course includes programming\nassignments and some programming background will be helpful.",
    "effort": "6-8 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/digital",
    "title": "Fundamentals of Digital Image and Video Processing",
    "courseraId": "485",
    "subjects": "Computer Science: Artificial Intelligence, Information, Tech & Design, Engineering"
}