{
    "source": "Coursera",
    "description": "General game players are computer systems able to play strategy games\nbased solely on formal game descriptions supplied at \"runtime\". &nbsp;(In\nother words, they don't know the rules until the game starts.) &nbsp;Unlike\nspecialized game players, such as Deep Blue, general game players cannot\nrely on algorithms designed in advance for specific games; they must discover\nsuch algorithms themselves. &nbsp;General game playing expertise depends\non intelligence on the part of the game player and not just intelligence\nof the programmer of the game player.\n\n\nGGP is an interesting application in its own right. &nbsp;It is intellectually\n    engaging and more than a little fun. &nbsp;But it is much more than that.\n    &nbsp;It provides a theoretical framework for modeling discrete dynamic\n    systems and for defining rationality in a way that takes into account problem\n    representation and complexities like incompleteness of information and\n    resource bounds. &nbsp;It has practical applications in areas where these\n    features are important, e.g. in business and law. &nbsp;More fundamentally,\n    it raises questions about the nature of intelligence and serves as a laboratory\n    in which to evaluate competing approaches to artificial intelligence.\nThis course is an introduction to General Game Playing (GGP). &nbsp;Students\nwill get an introduction to the theory of General Game Playing and will&nbsp;learn\nhow to create GGP programs capable of competing against other programs\nand humans. Learn about General Game Playing (GGP) and develop GGP programs capable of competing against humans and other programs in GGP competitions .",
    "requirements": "Students should be familiar with Symbolic Logic and should be able to\n    read and understand&nbsp;program fragments written&nbsp;in a&nbsp;modern\n    programming language. &nbsp;This background is sufficient&nbsp;for understanding\n    the presentation and&nbsp;for configuring players to compete in competitions\n    (using software components provided by the instructors). &nbsp;Students\n    who wish to modify the standard components or who wish to&nbsp;build their\n    own players&nbsp;also need&nbsp;the ability to develop programs on their\n    own. &nbsp;This latter ability&nbsp;is desirable but not required.",
    "effort": "4-12 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/ggp",
    "title": "General Game Playing",
    "courseraId": "297",
    "subjects": "Computer Science: Artificial Intelligence, Mathematics, Computer Science: Theory"
}