{
    "source": "Coursera",
    "description": "In \"Finding Hidden Messages in DNA\", we discussed how to find short regulatory motifs in genomes. &nbsp;But how do we know what the DNA sequence making up a genome is in the first place? &nbsp;After all, biologists still do not possess technology that would read all the nucleotides of your genome from beginning to end.In this course, you will learn how entire genomes are assembled from millions of short overlapping pieces of DNA. &nbsp;The scale of this problem (the human genome is 3 billion nucleotides long!) implies that computers must be involved. Yet the problem is even more complex than it may appear ... to solve it, we will need to travel back in time to meet three famous mathematicians, and learn about algorithms based on graph theory.Later in the course, we will see that sequencing genomes is not the only task related to decoding biological macromolecules.&nbsp; Another difficult problem is sequencing antibiotics, short mini-proteins engineered by bacteria to fight each other.&nbsp; Even though antibiotics often contain fewer than 10 amino acids, sequencing them is a formidable challenge.&nbsp;Decoding the sequence of amino acids making up an antibiotic is an important biomedical problem, but the practical barriers to sequencing short antibiotics are often more substantial than barriers to assembling a genome with millions of&nbsp; nucleotides! To address this computational challenge, we will learn about brute force algorithms that often succeed in various bioinformatics applications.Finally in this course, you will learn how to apply popular bioinformatics software tools to assemble a deadly Staphylococcus bacterium. You will also be introduced to the popular cloud service BaseSpace offered by Illumina, the leading DNA sequencing company, thus joining the thousands of biologists and bioinformaticians who use BaseSpace every day. Biologists still cannot read the nucleotides of an entire genome as you would read a book from beginning to end. However, they can read short pieces of DNA. In this course, we will see how graph theory can be used to assemble genomes from these short pieces. We will further learn about brute force algorithms and apply them to sequencing mini-proteins called antibiotics. Finally, you will learn how to apply popular bioinformatics software tools to sequence the genome of a deadly Staphylococcus bacterium.\n\n",
    "contents": "How Do We Assemble Genomes? (Graph Algorithms)Exploding NewspapersThe String Reconstruction ProblemString reconstruction as a walk in the overlap graphAnother graph for string reconstructionWalking in the de Bruijn graphThe seven bridges of KonigsbergEuler's TheoremFrom Euler's Theorem to an Algorithm for Finding Eulerian CyclesAssembling genomes from read-pairsEpilogue: Genome assembly faces real sequencing dataHow Do We Sequence Antibiotics? (Brute Force Algorithms)The Discovery of AntibioticsHow Do Bacteria Make Antibiotics?Dodging the Central DogmaSequencing Antibiotics by Shattering them into PiecesA Brute Force Algorithm for Cyclopeptide SequencingA Branch-and-Bound Algorithm for Cyclopeptide SequencingJust How Fast Is This Algorithm?Adapting Cyclopeptide Sequencing for Spectra with ErrorsFrom 20 to More than 100 Amino AcidsThe Spectral Convolution Saves the DayEpilogue: From Simulated to Real SpectraBioinformatics Application Challenge:&nbsp;Sequencing a&nbsp;Staphylococcus aureus genome",
    "requirements": "\"Finding Hidden Messages in DNA\" is the suggested prerequisite for taking this course, but it is not a strict prerequisite.If you are aiming at earning a standard certificate in this class, then you do not need to have any experience in biology or programming. &nbsp;The only prerequisite is the enthusiasm to learn about how computational approaches are used in modern biology :)If you are aiming at earning a certificate with distinction, then you should either know the basics of programming in the language of your choice (there is no required language for this course) or be willing to learn about programming before the course begins. In this case, in addition to the first course in this series,&nbsp;&nbsp;we have the following suggestions for resources that will help you learn programming:The language tracks on&nbsp;Codecademy, particularly the Python track.An Introduction to Interactive Programming with Python, the acclaimed Coursera course.Introductory problems on&nbsp;Rosalind, a resource for learning bioinformatics created by the course instructors.",
    "effort": "4-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/assembly",
    "title": "Genome Sequencing (Bioinformatics II)",
    "courseraId": "2858",
    "subjects": "Computer Science: Software Engineering, Mathematics, Computer Science: Theory"
}