{
    "source": "Coursera",
    "description": "Join\nus for the exciting journey to learn about GEOINT’s application in business,\nlaw enforcement, and defense. Advances in satellites, GPS, unmanned aerial\nsystems, wireless communications, handheld computing, and the ability to automate\nlaborious map analysis processes has transformed what used to be called\ngeographic intelligence, or GEOINT, and the nature of the insights provided to\nmanagers and leaders. GEOINT is more than just analysts working with GIS in a secure intelligence facility. We have gone from mountains of hardcopy maps to amazing\nautomated systems that provide previously unavailable understanding. GEOINT\nhelps us daily with real-time apps to guide decision making. GEOINT combines geographic information\nscience and technologies with an analytic tradecraft. In this course you will experience the\nvalue of GEOINT. You will learn how to design and execute a geospatial analysis project using GEOINT\ntools and tradecraft. The course is designed for the individual who wants to learn the basics of GEOINT and it is not designed for the geospatial intelligence professional. We're eager to welcome you to the Revolution. Learn how the revolution in geospatial technology combined with the tradecraft of Geospatial Intelligence (GEOINT) have changed how we develop insights about how humans use geography, and discover the power of GEOINT.",
    "contents": "Week One:&nbsp;What is GEOINT? Learn what GEOINT is and how it provides a powerful way of thinking about and finding solutions to complex humanitarian, military, economic, and cultural problems. We'll discuss the role of secrecy and its challenges. \nWeek Two:&nbsp; GEOINT Data. Examine the types and nature of data used to create GEOINT, including textual information, imagery, and geospatial data. Discuss how location-based data is changing conceptions of privacy.\nWeek Three:&nbsp;GEOINT Data Sources. Understand how GEOINT data is collected by a variety of methods including satellites, drones, crowdsourcing, and through social media.\nWeek Four:&nbsp;The GEOINT Tradecraft. Apply the art and science of extracting meaning from GEOINT data to uncover and investigate relationships and patterns.\nWeek Five:&nbsp;Applying GEOINT Principles. Use GEOINT principles to evaluate and transform raw data into descriptions, explanations, or judgments about a place.",
    "requirements": "No background is required; all are welcome. If you're already a GEOINT\nProfessional, then you will find this class a bit basic, in which case I hope\nyou'll consider taking the online courses that we offer at\nPenn State.",
    "effort": "6-9 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/geoint",
    "title": "Geospatial Intelligence & the Geospatial Revolution",
    "courseraId": "1572",
    "subjects": "Information, Tech & Design, Statistics and Data Analysis"
}