{
    "source": "Coursera",
    "description": "This course explores how we in the globalized world manages the environmental challenges. Pollution problems, lack of clean water and other resources are mainly a result of human actions and the way we have chosen to live. We are are all connected, for better or worse, polluting across boarders, consuming things that are supplied and produced in other parts of the world. Every society has strengths and weaknesses and we will look at how environmental challenges are handled differently in different societies.&nbsp;The course will focus on environmental technologies and how they are managed.&nbsp;We will present and discuss this on systemic level, focusing on getting a clear understanding of advantages and drawbacks, the related technologies and their viability in different settings around the world.&nbsp;It is important to understand that a technology and management solution has to work in the environment and society it is meant for. Learn about the best environmental technologies for a sustainable development and how they are managed in various settings around the world.",
    "contents": "Week one is spent on getting up to date with the global trends, like what we know about global warming, demographic development and global resources; where we are right now?&nbsp;Week two and three the focus is on management aspect, how storm water and solid waste are managed by utilities, how decisions are taken locally and globally and how people are involved in these processes.&nbsp;In week four&nbsp;and five&nbsp;we look at the technical solutions: What are the state of the art technologies when it comes to avoid polluting drinking water sources? How can we recycle scarce resources? How to better utilize land resources?&nbsp;",
    "requirements": "At least two years an undergraduate study of any science somehow related the environment.",
    "effort": "7-9 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/globalenvmanangement",
    "title": "Global Environmental Management",
    "courseraId": "3497",
    "subjects": "Engineering"
}