{
    "source": "Coursera",
    "description": "The new field of 2-dimensional (2-d) materials has seen\nexponential growth since the isolation of graphene, a single atomic layer of\ncarbon atoms, at University of Manchester in 2004. What is a 2-d material, and\nhow is it different to 3-dimensional materials that we encounter every day? How\ndoes the 2-d nature affect the material’s properties, for instance, how do\nelectrons living in a 2-d world behave? How would we harness the unique\nproperties of 2-d materials and put them to use in real-world applications? We\nwill answer these questions and more in this course on Graphene and other 2-d\nmaterials. \n\nThe course will describe how a number of key\naspects of the broader field of nanomaterials are applied to study 2-d\nmaterials, including methods of production such as chemical vapour deposition,\ncharacterisation techniques such as Raman spectroscopy and electron microscopy,\nand the production of nano-electronic and nano-composite structures. Gain a foundational understanding of the world of 2-dimensional materials, including Graphene. This course provides an overview of this exciting new field of study, starting with the concept of what a 2-dimensional material is, how they are produced, their unique and superlative properties, and the range of potential applications.",
    "contents": "Week 1: Introduction\n\nWhat is graphene? Atomic structure of graphene.Why is graphene a 2-d material?Relationship of graphene to other nano-carbon materialsProperties of graphene overview\n\nWeek 2: Production of graphene and 2-d materials\n\nScotch-tape method, finding graphene flakes, optical\ncontrastCVD grapheneCVD of other 2-d materialsSolution-exfoliation 1 – graphene oxideSolution-exfoliation 2 – graphene and other 2-d materials\n\nWeek 3: Electronic properties and devices\n\nFirst graphene device and anomalous quantum hall effectGraphene device fabricationGraphene electronic device measurementsGraphene quantum dotsGraphene superconductivityGraphene optoelectronicsGraphene plasmonics\n\nWeek 4: Chemistry of graphene\n\nRaman spectroscopy of grapheneX-ray photoemission spectroscopy of graphene oxideDifferent ways to functionalise grapheneDerivatives – reduced graphene oxide, fluorographene and\ngraphaneBottom-up production of nano-graphene materials\n\nWeek 5: Mechanical properties and devices \n\nMeasuring the mechanical properties of grapheneGraphene resonators, NEMS and speakerGraphene compositesGraphene strain sensors\n\nWeek 6: other applications of graphene\n\nGraphene filtration and barrier membranesGraphene chemical sensorsGraphene batteries and supercapacitors\n\nWeek 7: Biomedical applications and toxicology\n\nGraphene toxicologyGraphene drug deliveryGraphene tissue engineeringGraphene cancer therapy\n\nWeek 8: 2-d materials, 2-d Lego and outlook\n\nGraphene tunnelling transistorOther heterostructure devicesCross-section TEM of heterostructuresFuture of 2-d materials",
    "requirements": "This\nis a general interest course that will appeal to a broad range of audience who\nhave an interest in science and future of graphene and 2-dimensional materials.\nA good knowledge of general physics and chemistry will aid in understanding the\nconcepts. A deeper knowledge in the areas of materials science and\nnanotechnology will facilitate deeper understanding and appreciation of the\nsubject material.",
    "effort": "1-3 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/graphene",
    "title": "Graphene and 2-dimensional Materials",
    "courseraId": "3187",
    "subjects": "Engineering"
}