{
    "source": "Coursera",
    "description": "Paper or plastic? Local or imported food? Which is\nbetter for the environment? To answer these questions, one must take\na holistic systems view using a quantitative approach known as life cycle\nassessment.\n\nLife cycle assessment (LCA) is a fundamental method for assessing the\nenvironmental impacts of products and technologies from a \"cradle to grave\"\nsystems perspective. It is an essential tool for anyone who performs\nenvironmental analyses or uses the results of such analyses for decision\nmaking.&nbsp;\n\nThe course will provide an introduction to LCA methods and applications. Students taking this course will emerge with a solid understanding of why\nan LCA systems perspective is important, basic skills for sound application\nof the LCA method and proper interpretation of its results, and an appreciation\nfor the strengths and limitations of LCA in practice. The course\nwill cover the four major steps in LCA: (1) goal and scope definition;\n(2) life-cycle inventory compilation; (3) life-cycle impact assessment;\nand (4) interpretation and management. The course will include a\nhands-on modeling project, which the students will perform in parallel\nto the lectures to reinforce learning objectives and to gain experience\nin LCA application.\n In this course you will learn the basics of the life-cycle assessment (LCA) method for holistic environmental analysis of products, technologies, and systems. LCA sheds light on the environmental implications of the consumption and behavioral choices we all make on a daily basis.",
    "contents": "- The basics of energy and mass flows and exchanges with the environment\n- Working with unit processes and unit process inventory data- Study design: goal definition, system boundaries, and functional units\n- Compiling the data: life-cycle inventory methods (process-based and\ninput-output methods)\n- Understanding impacts: life-cycle impact analysis for land, air, water,\nand health\n- Building a simple LCA model using spreadsheet software- Results interpretation and reporting",
    "requirements": "Familiarity with spreadsheet software (Microsoft Excel or OpenOffice Calc), basic\nskills in algebra, matrix operations, and statistics, and some exposure\nto environmental issues related to energy use, air pollution, water pollution, waste\ngeneration, and climate change.",
    "effort": "5-7 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/introtolca",
    "title": "How Green Is That Product? An Introduction to Life Cycle Environmental Assessment",
    "courseraId": "477",
    "subjects": "Engineering, Statistics and Data Analysis"
}