{
    "source": "Coursera",
    "description": "In this course, you will learn how to design technologies that bring people joy, rather than frustration. You'll learn several techniques for rapidly prototyping and evaluating multiple interface alternatives -- and why rapid prototyping and comparative evaluation are essential to excellent interaction design. You'll learn how to conduct fieldwork with people to help you get design ideas. How to make paper prototypes and low-fidelity mock-ups that are interactive -- and how to use these designs to get feedback from other stakeholders like your teammates, clients, and users. You'll learn principles of visual design so that you can effectively organize and present information with your interfaces. You'll learn principles of perception and cognition that inform effective interaction design. And you'll learn how to perform and analyze controlled experiments online. In many cases, we'll use Web design as the anchoring domain. A lot of the examples will come from the Web, and we'll talk just a bit about Web technologies in particular. When we do so, it will be to support the main goal of this course, which is helping you build human-centered design skills, so that you have the principles and methods to create excellent interfaces with any technology. Helping you build human-centered design skills, so that you have the principles and methods to create excellent interfaces with any technology.",
    "contents": "This course will be available in a self-paced format. The courses in the Interaction Design Specialization may be taken in any order.This course will help you build human-centered design skills, so that you have the principles and methods to create excellent interfaces with any technology.Module 1: IntroductionModule 2: NeedfindingModule 3: Rapid PrototypingModule 4:&nbsp;Heuristic EvaluationModule 5: Direct Manipulation and RepresentationsModule 6: Visual Design and Information DesignModule 7: Designing experiments",
    "requirements": "No background is required; all are welcome!",
    "effort": "10-12 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/hcidesign",
    "title": "Human-Computer Interaction Design",
    "courseraId": "2396",
    "subjects": "Computer Science: Software Engineering, Information, Tech & Design"
}