{
    "source": "Coursera",
    "description": "What is image and video processing? Images and videos are everywhere, from those we take with our mobile devices and share with our friends to those that we receive from Mars and the ones we see in the movie theatre, without forgetting the whole ensemble of images of our bodies that are taken in hospital visits. Image and video processing is the art of working with such images and movies, from making it possible to store and transmit them to making those dark and blurry images look nice, as well as interpreting and analyzing the medical data and recognizing our friends’ faces in social pictures. This discipline is also fascinating because it uses tools from many areas of applied mathematics. In this class you will look behind the scenes of image and video processing, from the basic and classical tools to the most modern and advanced algorithms. The course will start with an introduction to the basics of image formation and the fundamental concepts that translate a physical scene into a digital image. We will then describe the underlying concepts of image compression, the enabling technology that makes it possible for images to be sent from Mars and videos to be stored in our mobile phones. We will cover the most fundamental tools in image enhancement, showing how simple tools can significantly improve images. Both geometric and non-geometric tools as well as spatial and non-spatial operations will be presented. Details on image segmentation will be provided, one of the most fundamental and useful problems in image processing. The above topics will be extended to color images and video. Once we have covered the fundamentals, which both provide the basis for modern image and video processing and serve many important applications until today, we will move into recent progress in the area, covering image inpainting (how to remove objects from images and video), image processing via sparse modeling and compressed sensing, geometric partial differential equations for image analysis, image processing for HIV and virus research, and image processing for neurosurgery and other medical applications. In this class you will look behind the scenes of image and video processing, from the basic and classical tools to the most modern and advanced algorithms.",
    "contents": "Week 1- Introduction to Image and Video Processing: We will cover the fundamentals, including some elements of visual perception, sensing, sampling, and quantization. Week 2- Image and Video Compression: We will learn the fundamental tools enabling us to receive images from Mars, to upload images to the web, and to store a lot of images and videos in our mobile phones. Week 3- Spatial Processing: This week we will learn some of the most classical and fundamental tools that help us still today to make noisy, blurry, and dark images look much better. Week 4- Image Restoration: When something is known or estimated about the degradation process, we can do much better, and in this week we will learn how. Week 5- Image Segmentation: How do we split an image or video in its core components? Week 6- Geometric PDEs: We will learn about the use of partial differential equations and geometric deformations for problems like image enhancement and object detection. Week 7- Image and Video Inpainting: How to make objects disappear and other special effects. Week 8- Sparse Modeling and Compressed Sensing: We will cover some of the most modern tools for image enhancement and image analysis. Week 9- Medical Imaging: As an example of medical image analysis, we will illustrate examples and techniques in the areas of brain research and virus analysis.Computer Exercises- See below for more details on this.",
    "requirements": "Image and video analysis can be approached from numerous areas of mathematics, from linear algebra to geometry, optimization, and differential equations. We plan to make all the lectures as self-contained as possible, but basic background in linear algebra and digital signal processing will be helpful.",
    "effort": "4 - 6 hours\/ week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/images",
    "title": "Image and video processing: From Mars to Hollywood with a stop at the hospital",
    "courseraId": "153",
    "subjects": "Computer Science: Artificial Intelligence, Mathematics, Engineering"
}