{
    "source": "Coursera",
    "description": "When taking online courses at a U.S.-based university or &nbsp;telecommuting for a U.S. company, foreign-born\nstudents and professionals oftentimes run into pitfalls, no matter how technologically\nsavvy they are in their native environments. This is because U.S. online\nenvironments tend to be based on American culture and American ways of doing\nthings. This may make even ordinary things confusing to non-Americans abroad.\nIn order to better understand and master American eLearning and other U.S.\nvirtual environments, international students and foreign-born professionals\nneed to know how American universities and companies use the Internet to\norganize work and study, develop and execute projects, communicate ideas,\ncollaborate and solve organizational and technical problems. By taking this\ncourse, you will learn how to enhance your cultural knowledge and assess\npotential skill gaps that may hinder your online experience or negatively\nimpact your performance in U.S. virtual work environments. Throughout the\ncourse you will systematically review competencies required for online work, come\nto better understand common barriers for non-native students and professionals\nin U.S. virtual work environments, learn about effective strategies and develop\nplans for self-improvement\n\nBy the end of the course, you’ll be able to:\n\n·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nRecognize six key competency areas (domains)\nthat you should better understand in order to master American eLearning and\nU.S. virtual work environments.\n\n·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nFor each competency area, you’ll systematically\nreview and examine required levels of proficiency in terms of awareness,\nknowledge, skills and attitudes.\n\n·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nExamine how gaps in awareness, knowledge, skills\nand attitudes can cause barriers to learning and work performance in American\neLearning and other U.S.-style virtual environments.\n\n·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nIdentify and explore effective strategies, best\npractices, skill-building techniques and helpful resources that can be used to\neliminate gaps and alleviate barriers; discuss those with peers across the\nglobe.\n\n·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nSelf-assess your perceived level of mastery in\nvarious levels of competencies, identify gaps in your awareness, knowledge,\nskills and attitudes and develop personal strategies for improvement.\n\n·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nAs a result, perform more effectively in\nAmerican eLearning and U.S. virtual work environments, develop self-directed\nlearning skills and enhance employability skills.\n\nThe course can be used in a variety of ways. It can be taken as a\nstand-alone course on Coursera or it can be integrated with credit-bearing\ncourses offered by the State University of New York’s Empire State College (see\nModule 8 for details). In addition, it may be integrated with orientation\ncourses offered for incoming and on-campus international students by SUNY and\nother U.S –based universities and adopted as part of credit-bearing activities\nby international universities outside the U.S.Download course poster. This competency-based, skill-building course will help non-U.S. students, first generation immigrants and foreign-born professionals better understand and master American eLearning as well as other U.S. virtual environments for college and career success.",
    "contents": "The course consists of eight modules. \n\nModule 1:&nbsp;&nbsp; Introduction: Learn about barriers to effective online\nlearning in U.S.-style virtual environments and how a competency-based approach\ncan help overcome these and other barriers\n\nModule 2:&nbsp;&nbsp; Review technology-related competencies \n\nModule 3:&nbsp;&nbsp; Learn how to overcome barriers of language and culture\n\nModule 4:&nbsp;&nbsp; Learn how to communicate ideas effectively \n\nModule 5:&nbsp;&nbsp; Understand the United States academic system\n\nModule 6:&nbsp;&nbsp; Examine the specific competencies and prerequisites\nrequired to successfully navigate American professional contexts&nbsp; \n\nModule 7:&nbsp;&nbsp; Conclusion: Learn how to make sense of\nself-assessments and to plan for the future\n\nModule 8:&nbsp;&nbsp; Find out how you can get U.S. college credit for this\ncourse",
    "requirements": "Primary audiences for this course include international (non-U.S.)\nstudents&nbsp;studying online at U.S. universities and foreign professionals\nresiding outside of the U.S. and&nbsp;working remotely for U.S.-based employers\nor considering employment-based migration. Incoming international students and\nfirst generation immigrants in the U.S. also can benefit significantly from the\ncourse. While most of the examples and cases are based on undergraduate studies\nin business and management, the course&nbsp;is also suitable for postgraduate\nstudents and those seeking professional development opportunities regardless of\nacademic discipline.\n\nPlease note that this course is not intended to substitute any mandatory\norientation or counseling sessions offered for enrolled international students\nby their host institutions in the U.S.",
    "effort": "3-5 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/imooc",
    "title": "iMOOC101: Mastering American eLearning",
    "courseraId": "1728",
    "subjects": "Information, Tech & Design"
}