{
    "description": "Learn how to implement predictive analytics solutions using Hadoop machine learning technologies like Mahout and Spark on Microsoft Azure HDInsight. In this four-week course, you will learn the basic concepts of data science and also use R programming on an HDInsight cluster.\n\nThis course is the third in a series that explores big data and advanced analytics techniques with HDInsight; and builds on the concepts and skills learned in DAT202.1x: Processing Big Data with Hadoop in Azure HDInsight and DAT202.2x: Implementing Real-Time Analysis with Hadoop in Azure HDInsight.\n\nNote: To complete the hands-on elements in this course, you will require an Azure subscription and a Windows client computer. You can sign up for a free Azure trial subscription (a valid credit card is required for verification, but you will not be charged for Azure services).  Note that the free trial is not available in all regions. It is possible to complete the course and earn a certificate without completing the hands-on practices How to:\n\nIdentify core concepts and techniques for data science and machine learning.\n\tInstall and use R on an HDInsight cluster.\n\tUse Apache Mahout to create predictive solutions that classify data and produce recommendations.\n\tUse Apache Spark to build a machine learning solution.",
    "contents": "Course Syllabus\n        Module 1: Introduction to Data Science and Machine Learning\nThis module introduces the core concepts of data science and machine learning before describing how to process data by using R in an HDInsight cluster.\n Module 2: Using Mahout\nThis module introduces Apache Mahout, and describes how to use Mahout libraries to implement clustering and recommendation solutions.\n Module 3: Using Spark Machine Learning\nThis module introduces Machine Learning support in Spark clusters, and describes how to implement a predictive solution using Spark.\n Final Exam\nThe fourth week of the course is given over the final exam. You must achieve a score of 50% or higher to pass this course and earn a certificate.",
    "instructors": "Graeme Malcolm",
    "requirements": "Familiarity with Hadoop clusters in HDInsight\n\tFamiliarity with database concepts and basic SQL query syntax\n\tFamiliarity with basic programming constructs (for example, variables, loops, conditional logic)\n\tA basic knowledge of mathematics, including linear equations and functions\n\tA willingness to learn actively and persevere when troubleshooting technical problems is essential",
    "length": "5 weeks",
    "effort": "3 - 4 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "Microsoft",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/implementing-predictive-analytics-hadoop-microsoft-dat202-3x",
    "title": "Implementing Predictive Analytics with Hadoop in Azure HDInsight"
}