{
    "description": "Learn how to implement low-latency and streaming Big Data solutions using Hadoop technologies like HBase, Storm, and Spark on Microsoft Azure HDInsight. You’ll learn to create and query HBase and Apache Spark tables to address problems and find solutions using Big Data.\n\nThis course is the second in a series that explores big data and advanced analytics techniques with HDInsight; and builds on the batch processing techniques learned in DAT202.1x: Processing Big Data with Hadoop in Azure HDInsight. A third course in this series will follow this one to cover predictive analytics in HDInsight.\n\nNote: To complete the hands-on elements in this course, you will require an Azure subscription and a Windows client computer. You can sign up for a free Azure trial subscription (a valid credit card is required for verification, but you will not be charged for Azure services). Note that the free trial is not available in all regions. However, it is possible to complete the course and earn a certificate without completing the hands-on practices. How to:\n\nCreate and query HBase tables.\n\tBuild Microsoft .NET client applications for HBase.\n\tImplement Microsoft .NET based Storm topologies for streaming data.\n\tIntegrate Storm with HBase and Azure Event Hub.\n\tCreate and query Spark in-memory tables.\n\tUse Spark Streaming to process event data.",
    "contents": "Course Syllabus\n        Module 1: Using HBase for NoSQL Data\nThis module introduces Apache HBase, describes how to create and query HBase tables, and explains how to build applications that use HBase as a NoSQL data store.\n Module 2: Using Storm for Streaming Data \nThis module introduces Apache Storm clusters, and explains how to use Storm to implement event processing for streams of data.\n Module 3: Using Spark for In-Memory Data and Streaming\nThis module introduces Spark clusters, and discusses the ways in which Spark can support low-latency data solutions through in-memory tables and stream processing.\n Final Exam\nThe fourth week of the course is given over the final exam. You must achieve a score of 50% or higher to pass this course and earn a certificate.",
    "instructors": "Graeme Malcolm",
    "requirements": "Familiarity with Hadoop clusters and Hive in HDInsight\n\tFamiliarity with database concepts and basic SQL query syntax.\n\tFamiliarity with basic programming constructs (for example, variables, loops, conditional logic). Experience with C# and Visual Studio is preferred.\n\tA willingness to learn actively and persevere when troubleshooting technical problems is essential.",
    "length": "3 weeks",
    "effort": "3 - 4 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $49",
    "institutions": "Microsoft",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/implementing-real-time-analytics-hadoop-microsoft-dat202-2x",
    "title": "Implementing Real-Time Analytics with Hadoop in Azure HDInsight"
}