{
    "description": "XSeries Program Overview\nEveryone can be a great leader—one who inspires and makes others feel included and engaged. Inclusive leadership is about supporting people and making them feel both valued for their unique talents and like they belong. Leading inclusively and intentionally brings out your fullest potential and the potential of those around you. This Inclusive Leadership Training XSeries is an opportunity to develop the skills and behaviors of an inclusive leader with Catalyst, a global expert in the field.\nThis three-course series is directed at individuals at all levels. Learners will learn how to apply an inclusive leadership mindset—the “EACH mindset”—which includes leadership behaviors of Empowerment, Accountability, Courage, and Humility. Through learning and understanding the Catalyst EACH mindset, you will have the opportunity to hone in on and practice skill-building inclusive behaviors that will help you foster team citizenship and innovation at work and in all parts of your life.\n\n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about Inclusive Leadership Training\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Become a successful leader by learning 21st-century leadership skills and applying concepts to the real world. Develop communication skills that bring out the best in you—and in others. Beyond work-life \"balance\"—develop skills for achieving work-life effectiveness as an individual and as a leader.",
    "instructors": [
        "Deepali Bagati",
        "​Krista Brookman",
        "Emily V. Troiano",
        "Amelia Costigan",
        "Liz Mulligan-Ferry",
        "Laura Sabattini, Ph.D.",
        "Dnika J. Travis PhD"
    ],
    "length": "3 courses ; Each course 4 weeks",
    "effort": "1-2 hours a week",
    "prices": "$50 per course",
    "institutions": "CatalystX",
    "subjects": "Business & Management",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/inclusive-leadership-training"
}