{
    "description": "This MIS course will cover supporting tech infrastructures (Cloud, Databases, Big Data), the MIS development\/ procurement process, and the main integrated systems, ERPs, such as SAP®, Oracle® or Microsoft Dynamics Navision®, as well as their relationship with Business Process Redesign.\n\nManagement Information Systems (MIS) are an integral part of today’s professional landscape. From customer relationship management (CRM) systems handling the daily interactions with clients and prospects, to financial systems issuing invoices and paying bills, day-to-day working life is increasingly controlled by these systems that dictate what to do and how.\n\nThis course will focus on what MIS are, how they influence your current or prospective jobs, why they impose specific - and sometimes seemingly absurd - operational procedures, and how to use this knowledge to your advantage in your professional life.\n\nGrasping the key concepts in MIS does not need to be daunting. We will use real world examples to illustrate key concepts, and strive to strike a proper balance between clarity \/ amenity and conceptual soundness. Join us on this stimulating journey that will allow you to better understand and perform in your current or desired job. Understand Management Information Systems (MIS) and their role in today’s organizations.\n\tIdentify how MIS shapes and controls current (or prospective) jobs and how to use this insight to improve your own job performance and satisfaction and and enhance your career prospects.\n\tBecome familiar with the major trends in MIS and MIS infrastructures (Cloud, Big Data, ERPs, outsourcing) and how these evolutions will affect workplaces and business strategies.\n\tBridge the MIS-related second “digital gap” that exists, after basic computer literacy, in most professional jobs.",
    "instructors": [
        "Alfonso Durán Heras",
        "Iván García Miranda",
        "Jorge Solera Camino",
        "Juan A. Baratas Moreno"
    ],
    "requirements": "Basic user-level computer literacy\nBusiness awareness is recommended",
    "length": "7 weeks",
    "effort": "3 - 4 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "UC3Mx",
    "subjects": "Business & Management",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/introduction-management-information-uc3mx-im-1x",
    "title": "Introduction to Management Information Systems (MIS): A Survival Guide"
}