{
    "source": "Coursera",
    "description": "In this 17-week course we will introduce the fundamentals of computational arts–covering basic programming, simple image processing and elementary sound recording. This class has been taught for seventeen years at Stony Brook University, and is an accessible introduction to combining arts and computing.*For programming we will be using the free and open source programming language and integrated development environment, Processing. The course will provide the essentials of programming in a visual context, allowing you to visualize, design, and create generative art with Processing.For visuals we will cover Photoshop CS5 and GIMP, which is a free open-source tool offering the same functionality as Photoshop. Whether you have access to one or the other, you will learn how to create and manipulate digital images, and most importantly, you will become comfortable enough to expand on what you learn here, after the end of our course.For sound we will teach both Logic and Soundation. Logic is Apple’s DAW or Digital Audio Workstation while Soundation is a free web-based multi-track audio editor. We’ll be teaching the basics of digital audio–including recording, and automating effects. You will complete both technical assignments and artistic projects, and learn how to participate in an aesthetic critique. We’ll cover the history of sound and art in the Twentieth and 21st Centuries to give context for your artistic endeavors.Peer review is integral to the success of this class; we will also teach you how to give constructive criticism. By the end of the 15 weeks you should have a strong foundation for how computers work and deal with data, specifically how image and sound are represented by the computer.Additionally, you will create an online portfolio of digital art projects, and be able to communicate ideas about art. &nbsp;Each week you will watch two video series - one on the theory and one on the practice. There will be technical assignments and artistic projects which will be peer reviewed. We’re looking forward to working with you. *If you are interested in just a part of this course, you may want to consider enrolling in the individual segments in the Spring (Intro to Computational Arts Processing, Visual Arts and Audio.) &nbsp;These courses will not include the use of eportfolio and will not have a summative capstone.&nbsp; This multidisciplinary production class serves as an introduction to, and exploration of electronic media in the arts. Lectures will cover concepts and presentations of artists working in various capacities with computers, as well as tutorials on specific software packages. ",
    "contents": "\nIntroduction to Computational Arts\nConsortium  for Digital Arts &amp; Technology (CDACT)\nStony Brook University and Coursera \nCOURSE INFORMATION&nbsp;\nInstructors\n  Dr. Margaret Schedel\n  Catherine Katsafouros (TA)\nCourse Description\nThis multidisciplinary production class serves as an introduction to,  and exploration of electronic media in the arts. Lectures will cover concepts  and presentations of artists working in various capacities with computers, as  well as tutorials on specific software packages.\nPrerequisite\nNo prerequisites or prior knowledge needed. Familiarity with computers  is helpful but not necessary. \n\nCourse Requirements\n\n  \n    Internet connection\n    Windows or Apple computer\n    Ability to install software on your machine  (admin account) \n    Processing software: http:\/\/processing.org\/\n    Visual arts software: You may use either\n    Photoshop: http:\/\/www.adobe.com\/products\/photoshopfamily.html \n      or Gimp: http:\/\/www.gimp.org\/\n    Sound software: You may use either \n    Logic: http:\/\/www.apple.com\/logic-pro\/&nbsp; (Mac ONLY) \n      or Soundation http:\/\/soundation.com\/\n    Digication e-Portfolio account (links and  details will be provided)\nCourse Learning Outcomes \nLearners who successfully complete this course will have learned basic  skills in three programs: Processing, Photoshop or Gimp, and Logic or  Soundation. Throughout the three primary modules, students will be learn to  give critical feedback to their peers about technical and artistic matters  through a grounding in the history of technology and the arts. A digital  portfolio will showcase your work from this course which culminates in a  computational artwork using all three programs.&nbsp;\nProcessing Outcomes:\n\n  \n    Understand  the basics of computers, input and output devices, memory, and disks as  demonstrated through quizzes and projects\n    Navigate  file systems in Windows and Mac OS X\n    Demonstrate  creative\/conceptual awareness of generative design through peer critique \n    Install  and set-up a digital environment using Processing language.\n    Generate  and manipulate type, image and sound, incorporating principles of color, shape  and grids.\n  \n\nVisual Arts Outcomes:\n\n  \n    Create,  edit, manipulate digital images using the basic functions of visual arts  software\n    Demonstrate  creative\/conceptual awareness of visual design through peer critique \n    Produce  an artistic image using software\n  \n\nSound Art Outcomes:\n\n  \n    Record,  edit, and process digital sound using the basic functions of a Digital Audio  Workstation.\n    Demonstrate  creative\/conceptual awareness of sound art through peer critique \n    Produce  an effective 1-3 minute sound work with a formal structure\n  \n\nTextbook  &amp; Course Materials&nbsp;\nRequired  Text: No required texts\nOptional  Texts:\nPROCESSING: \nGenerative Design: Visualize, Program, and Create with  Processing\nby Hartmut Bohnacker (Author), Benedikt Gross  (Author), Julia Laub (Author), Claudius Lazzeroni (Editor) ISBN-13: 978-1616890773 \nPublisher:  Princeton Architectural Press \nVISUALS:\n  Art of the Digital Age\n  by Bruce Wands \n  ISBN-13:  978-0500286296\n  Publisher:  Thames &amp; Hudson\nMUSIC:\n  Electronic Music (Cambridge Introductions to Music) \n  by Nick Collins&nbsp;  (Author) , Margaret Schedel&nbsp;  (Author) , Scott Wilson&nbsp; (Author)\n  ISBN-13:  978-1107648173\n  Publisher:  Cambridge University Press \nWEB:\n  HTML and CSS: Design and Build Websites \n  by Jon Duckett \n  ISBN-13: 978-1118008188\n  Publisher:  Wiley\nGRADING  POLICY &amp; COURSE REQUIREMENTS\nGrading&nbsp;\n  Assignments and projects are graded through a peer-review process;  quizzes are multiple-choice and are graded by the computer. Your work on the  assignments, projects and group presentation will be assessed two ways: your  individual work to complete the assignment, project or presentation, and your  own review of your peers’ work. Peer review counts as the participation  component of your own grade, which means for everything you hand in you will  also make substantive comments on the assignments which will be graded, and  rate others’ comments\n\n\n&nbsp;\n\n    \n        \n            \n                Description&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;Weight &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Participation    Component\n            \n        \n        \n            \n                Quizzes (14) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; 15 % &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;0 %\n        \n        \n            \n                Assignments (12) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; 20 % &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;20 % &nbsp;\n        \n        \n            \n                Project 1 (visual) &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp;20 % &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; &nbsp; &nbsp;25 %\n        \n        \n            \n                Project 2 (sound) &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp; 20 % &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 25 %\n        \n        \n            \n                Final Project\n                    (visual, sound, programming) &nbsp; &nbsp; 25 % &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 25 %\n        \n    \n\n\nPassing Grade = 75%\nQuizzes&nbsp;\nAfter watching each video lecture series, you  will take a multiple choice quiz which will count towards your final grade. You  can only take these quizzes once. There are also “in-video questions,” and you  must answer these questions correctly in order to advance the video, but these  questions are NOT graded, you can re-do the “in-video” quiz as many times as  you need to.\nAssignments\nAssignments are purely technical; each module  will include a detailed explanation of how to complete and grade each assignment.  There will be 1 assignment (which may have multiple components)&nbsp; every week that there is no project due.&nbsp; Each assignment should take you no more than  one hour.\nProjects\nProjects are both aesthetic and technical; there  will be an explanation of how to grade projects but you must remember that art  is subjective. There are only three projects, and together they are worth the  majority of your grade. You can expect these projects to take at&nbsp; least 3-4 hours to complete. (Final project  should take 6 hours.)\nGroup  Presentation\n  In groups of 4-7, you will create a five-minute  presentation that the other students can view. You can use any method or  technology for loading this that works with your eportfolio site and  collaborating. There will be a list of topics to choose from on a movement in  twentieth or 21st century art or music. \nDisclaimer: “The course schedule, policies, procedures,  and assignments in this course are subject to change in the event of  extenuating circumstances, by mutual agreement, and\/or to ensure better student  learning.”\nCOURSE SCHEDULE\n\n  Week 01-04 Introduction to Computing  and Processing\n    Week 05-09 Introduction to Digital Art  and Photoshop\/Gimp\n    Week 10-14: Introduction to Electronic  Music and Logic\/Soundation\n    Week 15: Putting it All Together:  Programming, Visuals and Sound\n\n  \n    Assignments    due:\n    Week 1 &nbsp; &nbsp;Install Programs\n  \n    Week 2 &nbsp; &nbsp;Processing Assignment 1\n  \n  \n    Week 3 &nbsp; &nbsp;Processing Assignment 2\n  \n  \n    Week 4 &nbsp; &nbsp;Processing Assignment 3\n  \n  \n    Week 5 &nbsp; &nbsp;Image Assignment 1\n  \n  \n    Week 6 &nbsp; &nbsp;Image Assignment 2\n  \n  \n    Week 7 &nbsp; &nbsp;Image Assignment 3\n  \n  \n    Week 8 &nbsp; &nbsp;Image Assignment 4\n  \n  \n    Week 9 &nbsp; &nbsp;Project 1 (Image)\n  \n  \n    Week    10 &nbsp; Sound Assignment 1\n  \n  \n    Week    11 &nbsp;&nbsp;Sound Assignment 2\n  \n  \n    Week    12 &nbsp;&nbsp;Sound Assignment 3\n  \n  \n    Week    13 &nbsp;&nbsp;Project 2 (Sound)\n  \n  \n    Week    14 &nbsp;&nbsp;Portfolio Assignment 1\n  \n  \n    Week    15 &nbsp;&nbsp;Project 3 (Processing, Sound and Image)\n  \n\nWeek 16 &amp; 17 Project completion and peer grading&nbsp;\nCourse  Questions - FAQ\n  Have a question about the content of the course?  Check the Course FAQs discussion board and if you don’t see the answer to your  question there, create a new thread and post your question.&nbsp; The course instructors will monitor the FAQ discussion  board and will respond to questions posted.&nbsp;&nbsp;&nbsp; \nTechnical Assistance\nTechnical problems with Coursera should be reported to the support forums in two  ways: \n\n  Click: HELP WITH COURSERA \n  Using the in-context “report a problem” links on the course pages.\n\nBe sure to note: The page where the problem occurred and what problem  you had.\n&nbsp;\nPEER FEEDBACK  GRADING RUBRIC\nYou will grade each other’s work, and also grade each other’s comments.  There will be instructions on how to grade the assignments, projects, and  presentation, and each assignment will come with it's own grading chart (rubric) to follow.&nbsp;\n ",
    "requirements": "No background is required; all are welcome!",
    "effort": "3-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/cdt208",
    "title": "Introduction to Computational Arts",
    "courseraId": "743",
    "subjects": "Information, Tech & Design, Computer Science: Theory"
}