{
    "source": "Coursera",
    "description": "This course introduces acoustics by using the concept of impedance. In the previous part, the course starts with vibrations and waves, demonstrating how vibration can be envisaged as a kind of wave, mathematically and physically. They are realized by one-dimensional examples, which provide mathematically simplest but clear enough physical insights. Then the part 1 ends with explaining waves on a flat surface of discontinuity, demonstrating how propagation characteristics of waves change in space where there is a distributed impedance mismatch.&nbsp;Following the part 1, part 2 starts with radiation, scattering, and diffraction, which can be explained in a unified way by seeing the changes of waves due to spatially distributed impedance. Lastly, the course covers sound in closed space, which is considered to be a space that is surrounded by spatially distributed impedance, and introduces two spaces: acoustically large and small space.&nbsp;This course is for graduate students and advanced undergraduates in acoustics, audio engineering, and noise control engineering. Practicing engineers and researchers in audio engineering and noise control, or students in engineering and physics disciplines, who want to gain an understanding sound and vibration concepts, are also welcome. For the continuity of the lecture, taking part 1 of the course is recommended (but not required).&nbsp; Learn about acoustics by using the concept of impedance. Following part 1, radiation, scattering, and diffraction are studied. Wave propagation in closed space is also covered. Leads to understand essentials as well to cover graduate level topics. ",
    "contents": "Week 1. Radiation – Breathing &amp; Trembling Sphere\nProblem\n\n-&nbsp;What happens\nif we have a certain discontinuity that is a function of three spatial\nvariables (e.g. x,y,z for Cartesian coordinate)?-&nbsp;What are the\nradiation characteristics of a breathing sphere, which is assumed to vibrate\nomni-directionally with equal magnitude?\n\n-&nbsp;What is the\ndifference between a breathing sphere and a trembling sphere, which vibrates in\na certain direction with a uniform velocity?\n\nWeek 2. Radiation – Baffled Piston &amp; Finite Vibrating\nPlate Problem\n\n-&nbsp;How can we\ngenerate sound? By the fluctuation of fluid particles or the vibration of\nstructures? How are they related?\n\n-&nbsp;How can we\nunderstand the radiation of a finite vibrating plate? Can we assume this plate\nas numerous vibrating pistons?\n\n&nbsp;Week 3. Scattering\n&amp; Diffraction \/ Kirchhoff-Helmholtz Equation\n\n-&nbsp;How can we\nexpress the wave propagation when it is reflected due to the presence of discontinuities\nin space?\n\n-&nbsp;How can we\nexplain the circumstances under which we can hear sound but cannot see the\nsound source?\n\n-&nbsp;What is the relation\nbetween the wavelength and the diffraction?\nWeek 4. Wave Propagation in Space \/ Reverberation Period and its Design\nApplication\n\n-&nbsp;If there are\ndifferent types of impedance distribution in space, how can we explain the\npropagation characteristics?\n\n-&nbsp;How can we\nacoustically define ‘large’ or ‘small’ space’? Is it related to the frequency?\n\n-&nbsp;Is there any\nmeasure that can represent the characteristics of the space?Week 5. Wave\nPropagation in Space \/ Duct Acoustics\n\n-&nbsp;How can we\nexpress the sound field that is neither fully diffuse field nor only a direct\nfield? \n\n-&nbsp;When the size\nof the space is small relative to wavelength, what happens to the propagation\nof sound?\n\n-&nbsp;When the\nlength of one direction is significantly greater than the cross-sectional\ndirection of the space, how does the wave propagate with respect to its\nwavelength?",
    "requirements": "Elementary knowledge about vibration, dynamics and calculus is required. For the continuity of the lecture, taking part 1 of the course is recommended (but not required).&nbsp;",
    "effort": "3-6 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/acoustics2",
    "title": "Introduction to Acoustics (Part 2)",
    "courseraId": "1870",
    "subjects": "Engineering"
}