{
    "description": "Broadly speaking, functional programming is a style of programming in which the primary method of computation is the application of functions to arguments. Among other features, functional languages offer a compact notation for writing programs, powerful abstraction methods for structuring programs, and a simple mathematical basis that supports reasoning about programs.\n\nFunctional languages represent the leading edge of programming language design, and the primary setting in which new programming concepts are introduced and studied. All contemporary programming languages such as Hack\/PHP, C#, Visual Basic, F#, C++, JavaScript, Python, Ruby, Java, Scala, Clojure, Groovy, Racket, … support higher-order programming via the concept of closures or lambda expressions.\n\nThis course will use Haskell as the medium for understanding the basic principles of functional programming. While the specific language isn't all that important, Haskell is a pure functional language so it is entirely appropriate for learning the essential ingredients of programming using mathematical functions. It is also a relatively small language, and hence it should be easy for you to get up to speed with Haskell.\n\nOnce you understand the Why, What and How that underlies pure functional programming and learned to “think like a fundamentalist”, we will apply the concepts of functional programming to “code like a hacker” in mainstream programming languages, using Facebook’s novel Hack language as our main example. This course assumes no prior knowledge of functional programming, but assumes you have at least one year of programming experience in a regular programming language such as Java, .NET, Javascript or PHP.\n\nLICENSEThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License. Understand the Why, What and How that underlies pure functional programming, and learn to “think like a fundamentalist”\n\tApply the concepts of functional programming to “code like a hacker” in mainstream programming languages\n\t ",
    "instructors": "Erik Meijer",
    "requirements": "This course assumes no prior knowledge of functional programming, but advises at least one year of programming experience in a regular programming language such as Java, .NET, Javascript or PHP.",
    "length": "7 weeks",
    "effort": "4 - 6 hours\/week",
    "prices": "Free\n        \n         \n         Verified Certificate option closed",
    "institutions": "DelftX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/introduction-functional-programming-delftx-fp101x-0",
    "title": "Introduction to Functional Programming"
}