{
    "description": "Develop a good working knowledge of Linux using both the graphical interface and command line, covering the major Linux distribution families.\n\nLinux powers 94% of the world’s supercomputers, most of the servers powering the Internet, the majority of financial trades worldwide and a billion Android devices. In short, Linux is everywhere. It appears in many different architectures, from mainframes to server to desktop to mobile and on a staggeringly wide variety of hardware.\n\nMoreover, 97 percent of hiring managers reported that they will prioritize hiring Linux talent relative to other skills areas in the next six months, and 44 percent of hiring managers saying they’re more likely to hire a candidate with Linux certification.\n\nThis course explores the various tools and techniques commonly used by Linux system administrators and end users to achieve their day-to-day work in a Linux environment. It is designed for experienced computer users who have limited or no previous exposure to Linux, whether they are working in an individual or Enterprise environment.\n\nUpon completion of this training you should have a good working knowledge of Linux, from both a graphical and command line perspective, allowing you to easily navigate through any of the major Linux distributions. You will be able to continue your progress as either a user, system administrator or developer using the acquired skill set.\n\nJoin the 250,000+ students who are already enrolled in this course and start your Linux journey. A good working knowledge of Linux\n\tHow to navigate through major Linux distributions\n\tSystem configurations and graphical interface of Linux\n\tBasic command line operations\n\tCommon applications of Linux",
    "instructors": "Jerry Cooperstein PhD",
    "requirements": "None. However, the course does assume familiarity with computers and common software, such as would be had from daily computer use.",
    "length": "8 weeks",
    "effort": "Most users will find that thoroughly covering the material will take anywhere from  40 to 60 hours",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $99",
    "institutions": "LinuxFoundationX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/introduction-linux-linuxfoundationx-lfs101x-2",
    "title": "Introduction to Linux"
}