{
    "description": "This course is the first of a two-course sequence: Introduction to Computer Science and Programming Using Python, and Introduction to Computational Thinking and Data Science. Together, they are designed to help people with no prior exposure to computer science or programming learn to think computationally and write programs to tackle useful problems. Some of the people taking the two courses will use them as a stepping stone to more advanced computer science courses, but for many it will be their first and last computer science courses.\n\nSince these courses may be the only formal computer science courses many of the students take, we have chosen to focus on breadth rather than depth. The goal is to provide students with a brief introduction to many topics so they will have an idea of what is possible when they need to think about how to use computation to accomplish some goal later in their career. That said, they are not \"computation appreciation\" courses. They are challenging and rigorous courses in which the students spend a lot of time and effort learning to bend the computer to their will.\n\nFAQ\n\nWhat type of computing environment do I need for this course?\n\n\tYou need to have a computer running one of the following operating systems:\n\t\tMicrosoft Windows, version XP or greater (XP, Windows Vista, or Windows 7)\n\t\tApple OSX, version 10.2 or greater\n\t\tLinux - most distributions that have been released within the past two years should work\n\t\tIn addition, you will need the ability to download, install, and run software on your computer.\n\t\n\tWhat browser should I use?\n\tWe strongly recommend that you use the Chrome browser while visiting the edX site. This site is optimized for viewing in Chrome. \n\t\tIf you cannot use Chrome, you should use the Firefox browser. Be advised you may have trouble with site functionality if you choose to use an alternate browser.\n\t\n\tWhat programming language(s) will this course use?\n\t6.00x will be using the Python programming language, version 2.7. \n\t\tYou are not expected to have any prior programming knowledge - this course is intended for students who have little to no experience with any programming language.\n\t\n\tWhat is the format of the class?\n\tThe class will consist of lecture videos, which are broken into small chunks, usually between eight and twelve minutes each. Some of these may contain integrated \"check-yourself\" questions. \n\t\tThere will also be programming assignments and standalone exams\/quizzes, which are not part of the video lectures.\n\t\n\tWill the text of the lectures be available?\n\tYes, transcripts of the course will be made available.\n\t\n\tDo I need to watch the lectures live?\n\tNo. You can watch the lectures at your leisure - you do not need to watch the lectures at any set time.\n\t\n\tHow much does it cost to take the course?\n\tNothing: the course is free. A Notion of computation\n\tThe Python programming language\n\tSome simple algorithms\n\tTesting and debugging\n\tAn informal introduction to algorithmic complexity\n\tData structures",
    "instructors": [
        "Eric Grimson",
        "John Guttag",
        "Ana Bell"
    ],
    "requirements": "High school algebra and a reasonable aptitude for mathematics. Students without prior programming background will find there is a steep learning curve and may have to put in more than the estimated time effort.",
    "length": "9 weeks",
    "effort": "15 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $49",
    "institutions": "MITx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/introduction-computer-science-mitx-6-00-1x-6",
    "title": "Introduction to Computer Science and Programming Using Python"
}