{
    "description": "Do you want to become a better problem solver?\n\nThis Java course will provide you with a strong understanding of basic Java programming elements and data abstraction using problem representation and the object-oriented framework. As the saying goes, “A picture is worth a thousand words.” This course will use sample objects such as photos or images to illustrate some important concepts to enhance understanding and retention. You will learn to write procedural programs using variables, arrays, control statements, loops, recursion, data abstraction and objects in an integrated development environment.\n\nThis course is comprised of two 5-week parts.\n\nPart 1 introduces programming fundamentals.\n\nProblem solving\n\tPrimitive data types and arithmetic expressions\n\tObject-oriented programming basics\n\tBranching and Loops\n\tArrays\nPart 2 covers the following topics.\n\nString manipulation\n\tFile I\/O\n\tSimple event-driven programming\n\tRecursion\n\tAbstract data types\nFAQ\n\nWhat software will be required for this course?\n\nWe will use Java Platform, Standard Edition Runtime Environment (JRE) or Java Platform, Standard Edition Development Kit (JDK) to give the computer the capability to run java programs and use BlueJ as the Integrated Development Environment (IDE) for developing Java programs.\n\nWhich version of Java will be used in this course?\n\nThe course is based on Java Version 7. It is fine that if you would like to use Java Version 8, but the new features introduced in Version 8 will not be covered by this course.\n\nWhat are the system requirements for MS Windows users?\n\nJava Version 7 and BlueJ are supported by MS Windows XP or above (except Windows RT). Java Platform, Standard Edition Runtime Environment (JRE) will need to be installed on the system. You will also need Internet Explorer 8+ or Firefox 3.6+ or Google Chrome to access the demonstration programs on the course web site. Documentation on the setup details can be found in the course handout to be given in week 1.\n\nWhat are the system requirements for Mac users?\n\nJava Version 7 and BlueJ are supported by Mac OS X 10.7.3 (Lion) or above. Java Platform, Standard Edition Runtime Environment (JRE) will need to be installed on the system. You will also need Safari 5.1.3+ or Firefox 3.6+ (64-bit) to access the demonstration programs on the course web site. Google Chrome is not supported. Documentation on the setup details can be found in the course handout to be given in week 1.\n\nWhat are the system requirements for Linux users?\n\nJava Version 7 and BlueJ are supported by Ubuntu\/Debian Linux. OpenJDK, an implementation of the Java Platform, Standard Edition Development Kit (JDK), will need to be installed on the system. You will also need Firefox 3.6+ to access the demonstration programs on the course web site. Documentation on the setup details can be found in the course handout to be given in week 1.\n\nCan I use an Integrated Development Environment (IDE) other than BlueJ?\n\nIn this course, we would recommend BlueJ to beginning programmers as it is compact and provides just enough features for learning programming. Most of the programming examples in this course assume using BlueJ. However, you may use other professional IDEs such as Eclipse and NetBeans according to your own preference.\n\nWill I be required to view Java Applets for learning the course materials?\n\nThere will be some demonstration programs shown as Java Applets in this course. However, these applets will only act as supplementary materials. Inaccessible to the applets would not affect the learning of the course materials. To access the applets, you will have to enable or activate Java plug-in on the browser. The plug-in requires 32-bit version of Java Platform, Standard Edition Runtime Environment (JRE) on MS Windows, 64-bit version of JRE on Mac OS X or 32\/64-bit version of OpenJDK on Linux depending on the architecture of the system. Take a “real-life” problem and abstract out&nbsp;the pertinent aspects necessary to solve it in an algorithmic manner.\n\tFormulate formal solutions to well-defined problems using the logic of a programming language.\n\tImplement formal solutions in Java using an integrated development environment.\n\tUnderstand the basics of data abstraction using the object-oriented framework.\n ",
    "instructors": [
        "Ting-Chuen PONG",
        "Tony W K Fung",
        "Leo P M Fan"
    ],
    "length": "5 weeks",
    "effort": "3-5 hours per week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "HKUSTx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/introduction-java-programming-part-1-hkustx-comp102-1x",
    "title": "Introduction to Java Programming – Part 1"
}