{
    "description": "We all know beautiful sites are a dime a dozen these days, and hideous sites are even more frequent. This course will teach you how the essential elements to designing an elegant website.\n\nDo you add great sites to your bookmark collection or pinterest board frequently? Maybe you peruse Siteinspire and gush over the latest and greatest in web design. The most beautiful sites are always easy to use, clean and refreshing. Their effortless appearance makes you say, “I could design something like that, right?”. Wrong.\nJust kidding, you’re right! With a few simple photoshop tips and tricks, you can learn how to make beautiful buttons and containers, stunning avatars and pair attractive colors to make the user say “Oh my!”.\nWhat You'll Learn\nBasics of Web Design. The bread and butter: Layout, Typography, Color.\nCreating Assets. You'll create brand elements such as button styles, avatars, and containers.\nUX Interactions and Rollovers. Your design will include popular user interactions such as rollover amd carousel. \nPutting It All Together. You'll package all of the components of your design into a beautiful one pager.\n\nWhat You'll Make\nTogether, we’ll put together photography, illustrations, icons, typography, and good feelings to make something usability-tastic! By the end of this course you will have designed a home page for any business of your choice— real or fake. \n\nRequired Class SuppliesAdobe Photoshop. If you don’t have the program you can download a 30 day free trial here. All class tutorials are recorded on a Mac using Photoshop CS6. You do not need a Mac or the most recent version of Photoshop (CS6) to follow along. Most of the tools are consistent across all versions of Photoshop.\nPlease note: Photoshop Elements is a limited version of Photoshop and is not recommended for this course.\nDon't know Photoshop? Try my Introduction to Photoshop class!\n* This is a design only course. No development will be taught!",
    "instructors": "Meg Lewis",
    "url": "https:\/\/www.coursetalk.com\/providers\/skillshare\/courses\/intro-to-web-design-friendly-design-for-startups-and-small-business",
    "title": "Intro to Web Design: Friendly Design for Startups and Small Business",
    "language": "en",
    "source": "coursetalk"
}