{
    "source": "Coursera",
    "description": "In this 5-week course we’ll introduce the fundamentals of programming. This is the first part of a class which has been taught for seventeen years at Stony Brook University, and is an accessible introduction to combining arts and computing. The other two portions are Introduction to Computational Arts: Image Manipulation and Introduction to Computational Arts: Sound Art.For programming we’ll be using the free and open source programming language and integrated development environment, Processing. The course will provide the essentials of programming in a visual context, allowing you to visualize, design, and create generative art with Processing.You will complete both technical assignments and an artistic project, and learn how to participate in an aesthetic critique. We’ll cover the history of generative  art in the Twentieth and 21st Centuries to give context for your artistic endeavors.Peer review is integral to the success of this class; we will also teach you how to give constructive criticism. By the end of the 5 weeks you should have a strong foundation for how computers work and deal with data.Additionally, you’ll create an online portfolio of digital art projects, and be able to communicate ideas about art.  Each week you’ll watch two video series - one on the theory and one on the practice. There will be technical assignments and artistic projects which will be peer reviewed. We’re looking forward to working with you. In this 5-week course we’ll introduce the fundamentals of programming in Processing, an accessible introduction to combining arts and computing. The course will provide the essentials of programming in a visual context, allowing you to visualize, design, and create generative art with Processing.",
    "contents": "Introduction to Computational Arts: ProcessingJan 2014Consortium for Digital Arts & Technology (CDACT)Stony Brook University and CourseraCOURSE INFORMATION InstructorsDr. Margaret Schedel & Timothy VallierCourse DescriptionThis multidisciplinary production class serves as an introduction to, and exploration of electronic media in the arts. Lectures will cover concepts and presentations of artists working in various capacities with computers, as well as tutorials on specific software packages.PrerequisiteNo prerequisites or prior knowledge needed. Familiarity with computers is helpful but not necessary.Course RequirementsInternet connectionWindows or Apple computerAbility to install software on your machine (admin account)Processing software: http:\/\/processing.org\/Digication e-Portfolio account (links and details will be provided) or other web-based sharing Course Learning Outcomes Learners who successfully complete this course will have learned the basic skills of Processing, Students will be learn to give critical feedback to their peers about technical and artistic matters through a grounding in the history of technology and the arts. A digital portfolio will showcase your work from this course.Outcomes:Understand the basics of computers, input and output devices, memory, and disks as demonstrated through quizzes and projectsNavigate file systems in Windows and Mac OS XDemonstrate creative\/conceptual awareness of generative design through peer critiqueInstall and set-up a digital environment using Processing language.Generate and manipulate type, image and sound, incorporating principles of color, shape and gridsCreate a multi-media Processing Sketch and host on a websiteTextbook & Course MaterialsRequired Text  No required textsOptional Texts:PROCESSING: Generative Design: Visualize, Program, and Create with Processingby Hartmut Bohnacker (Author), Benedikt Gross (Author), Julia Laub (Author), Claudius Lazzeroni (Editor) ISBN-13: 978-1616890773 Publisher: Princeton Architectural PressWEB:HTML and CSS: Design and Build Websites by Jon Duckett ISBN-13: 978-1118008188Publisher: WileyGRADING POLICY & COURSE REQUIREMENTSGrading Assignments and your final project are graded through a peer-review process; quizzes are multiple-choice and are graded by the computer. Your work on the assignments, projects will be graded by your peers using unique rubrics for each task. Quizzes (5) 30%Assignments (4) 40%Project (1) 30 %Quizzes After watching each video lecture series, you will take a multiple choice quiz which will count towards your final grade. You can only take these quizzes ONCE. We are using this MOOC to flip the classroom and we do not give our students multiple chances.  There are also “in-video questions,” and you must answer these questions correctly in order to advance the video, but these questions are NOT graded, you can re-do the “in-video” quiz as many times as you need to.AssignmentsAssignments are purely technical; each module will include a detailed explanation of how to complete and grade each assignment. There will be one assignment (which may have multiple components)  every week that there is no project due.  Each assignment should take you no more than one hour.ProjectThe final project is both aesthetic and technical; there will be an explanation of how to grade the project but you must remember that art is subjective. You can expect the project to take at  least 4 hours to complete. Disclaimer: “The course schedule, policies, procedures, and assignments in this course are subject to change in the event of extenuating circumstances, by mutual agreement, and\/or to ensure better student learning.” COURSE SCHEDULEWeek 1 Introduction to Computing and ProcessingWeek 2 Drawing in Processing: Arguments, Functions, and PrimitivesWeek 3 Dynamic Drawing: Code blocks, text, and loops.Week 4 External Input and Interactive SketchesWeek 5 Sound, Images, and Publishing",
    "requirements": "No background is required; all are welcome!",
    "effort": "1-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/compartsprocessing",
    "title": "Introduction to Computational Arts: Processing",
    "courseraId": "1322",
    "subjects": "Information, Tech & Design, Computer Science: Theory"
}