{
    "description": "The goal of this course is to provide high school students and college freshman a broad outline of engineering and help them decide on a career in engineering. The first part of this course is focused on exploring the different disciplines of engineering and providing participants with a broad background in different areas of engineering.\n \nDo you want to learn how race-cars are built? How robots are able to work independently? How unmanned vehicles are designed and built? How is energy harvested? How is energy stored? How are organs built? How is the body imaged? How do you design an aircraft? How do electrons travel in micro and nanoelectronics? How are drugs delivered in the body? How do you build on soils that are unstable? How do robots see? How is light used in devices? How is data stored and managed? How is pollution mitigated? How are electrical signals processed? How are strong and tough materials designed and built? How is thermal energy managed? How is data transmitted? How are systems integrated? How do you make sure goods and services reach their destination? How do you start a company? What are the underlying ethical and social responsibilities of being a professional engineer? These are all things that engineers are dealing with on a daily basis and will form the basis of the first part of the course.\n Introduction to Engineering Mathematics\n \nMathematics is an integral part of engineering and Engineering Mathematics is the process of applying the principles of mathematics to solve real life engineering problems.  A reference textbook will be used for this part of the course and is entitled “Introductory Mathematics for Engineering Applications” by Kuldip S. Rattan and Nathan W. Klingbeil. Publisher: John Wiley and Sons, ISBN:978-1-118-14180-9.\n \nTopics to be covered in mathematics will include: application of algebra in engineering in linear and quadratic equations, trigonometry in motion of robots, application of complex numbers in electrical circuits, use of systems of equations to solve problems in statics, dynamics and DC circuits. Concepts of derivatives will be introduced and its application in engineering problems such as dynamics, electrical circuits and mechanics will be explored. In a similar fashion concepts of integrals will be examined in the context of engineering applications such as statics, dynamics and electrical circuits. The intent of this course is not to establish mastery of mathematics but rather develop an understanding of the role played by mathematics to help solve engineering problems. Participants in this course will have a better understanding of calculus and differential equations and their relevance in solving engineering problems as they progress in their engineering education.Learn more about our High School and AP* Exam Preparation Courses. Learn the role of Engineering in the development of technology\n\tOutline of different fields of engineering\n\tPrinciples of Engineering Design and its application\n\tEntrepreneurship and Engineering\n\tApplication of  Mathematics in Engineering\n\t ",
    "instructors": [
        "Pranesh B. Aswath",
        "R. Stephen Gibbs",
        "​William E. Dillon",
        "Panos Shiakolas",
        "Alan Bowling"
    ],
    "requirements": "High school mathematics including basic concepts of algebra, trigonometry, geometry and calculus. High school physics, chemistry and biology.",
    "length": "12 weeks",
    "effort": "4 - 6 hours\/week",
    "prices": "Free\n        \n         \n         Verified Certificate option closed",
    "institutions": "UTArlingtonX",
    "subjects": "Electronics",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/introduction-engineering-engineering-utarlingtonx-engr1-0x",
    "title": "Introduction to Engineering and Engineering Mathematics"
}