{
    "description": "I'm the founder and designer of Lower East Side-based Assembly New York. I launched my menswear line in 2009 and presented my first womenswear collection at Milk Studios for NYFW in 2012. As a self-taught designer, everything I know about starting and running my own fashion label I learned by doing. Hindsight is 20\/20 and in this class I'm going to teach you the fundamentals I wish I had access to earlier.\n\nWhat You'll Learn\nOne of the most crucial lessons I learned over the past 5 years is that knowing what you're talking about - whether to potential partners, buyers, investors - makes all the difference in your success. Here are the fundamentals we'll cover:\nEstablishing Your Niche Market. Most small startups cannot even finance an entire collection, deciding what categories or articles you will focus on will offer legible and fiscally realistic goals. Staring out with a wide net  is a plan for difficult challenges, everything you may “catch” is a new, unplanned for, moving part you are now accountable for. Best to start with spearfishing and select your targets\nArticulating Your Designer Mission. Independent designers are required to learn the language of their business and current marketplace attitude to effectively communicate their goals and needs relevantly\nDeveloping Key Relationships. Labels live and die by their relationships with suppliers (fabric and trim providers) and producers (sewers) - how to successfully develop and maintain these relationships. \nProduction Management. Understanding the production cycle and the key relationships necessary to produce your garments is foundational and often misunderstood\/fantasized. \nDesigning Sales + Marketing Strategies. How to get people to know about you and your product. Do you need a show room? A press show room? Tradeshow access? \nBuilding In-House Sales Processes. How to navigate the logistics of receiving, producing and shipping orders - surprisingly crucial skills for not losing money on your orders!\nSecuring Investment. What to consider when you don't have the luxury of someone else's cash. \n\nWhat You'll Do\nIn this class you'll be able to start the process of launching your label with some foundational first steps: establishing your niche market and articulating your designer mission. You'll have the opportunity to share your work for feedback from fellow classmates all over the world. ",
    "instructors": "Greg Armas",
    "url": "https:\/\/www.coursetalk.com\/providers\/skillshare\/courses\/introduction-to-starting-your-own-fashion-label",
    "title": "Introduction to Starting Your Own Fashion Label",
    "language": "en",
    "source": "coursetalk"
}