{
    "description": "Learn the key concepts of Structured Query Language (SQL), and gain a solid\nworking knowledge of this powerful and universal database programming\nlanguage. In this course, you'll learn about the basic structure of relational\ndatabases and how to read and write simple and complex SQL statements and\nadvanced data manipulation techniques. First, you'll learn about the\ntraditional database structure, the structure and history of the relational\ndatabase, and what structured query language (SQL) is and how it relates to\nthe relational-database structure.Next, you'll discover how to use SQL to sort\nand retrieve data from tables and how to use SQL to filter retrieved data.\nYou'll learn how to reformat retrieved data with calculated fields and how to\nmerge columns and create alternate names for columns. You'll also learn how to\ngather significant statistics from data using aggregate functions, and you'll\nsee how to extract data from multiple tables simultaneously using joins and\nsubqueries. In addition, you'll learn how to manipulate data using the INSERT,\nUPDATE, and DELETE statements.We'll also cover how to use SQL to create and\nmaintain tables, and you'll learn how to create and use views to simplify\ncomplex queries, summarize data, and manipulate data stored in tables. You'll\ndiscover how transaction processing, constraints, and indexes are implemented\nin SQL. And finally, you'll discover how stored procedures, triggers, and\ncursors are implemented in SQL.By the end of this course, you'll have a solid\nworking knowledge of structured query language. You'll feel confident in your\nability to write SQL queries to create tables; retrieve data from single or\nmultiple tables; delete, insert, and update data in a database; and gather\nsignificant statistics from data stored in a database.",
    "instructors": "",
    "url": "https:\/\/www.coursetalk.com\/providers\/ed2go\/courses\/introduction-to-sql-2",
    "title": "Introduction to SQL",
    "language": "en",
    "source": "coursetalk"
}