{
    "description": "This class is a self-paced version of the first week of the iOS course I've developed for The Flatiron School in NYC. The goal of this class is to teach you the core building blocks required to be able to program your own iOS apps. You'll leave this class having developed your own working app and, more importantly, the foundation you need to progress with other self-taught resources.\n\nThis class will be very hands-on. You'll make your own image messaging app very similar to SnapChat, except without the time sensitive features. Let's go! \nWhat You'll Learn\nThe class will break down into five units, outlined below. \nUnit 1: Intro to Programming with Objective-C\nA basic introduction to programming\nGetting started: Writing Hello World\nUnderstanding Data Types and Objective-C\nUnderstanding control structures and looping and adding test data to the app\n Unit 2: Creating Views\nAdding objects to views (in our case, creating the basic image viewer)\nUnderstanding the view layers (in our case, adding in the abel and buttons to save images)\nUnit 3: Working with the IOS SDK\nUnderstanding the Model View Controller\nGetting to know properties and Object Oriented Programming\nGetting to know IBAction and IBOutlets (most basic version of the app will work at this point!)\nUnit 4: The View Lifecycle\nAdding navigation and tab bar controllers (in our case, so users can list all images they've taken)\nApplication and view lifecyling - writing code to initialize app with sensible defaults and save all work when app is backgrounded\nUnit 5: iOS Code Design Patterns + Common Controllers\nDelegate and protocol patterns\nUsing UITableViewControllers. Add TableView as first view for app. Lists all images taken\nUsing the UIImagePickerViewController (in our case, allows users to actually take pictures and then annotate them)\nCommunicating with other apps (in our case, sending pictures view text or email)",
    "instructors": "Joe Burgess",
    "url": "https:\/\/www.coursetalk.com\/providers\/skillshare\/courses\/ios-fundamentals-introduction-to-mobile-app-development",
    "title": "iOS Fundamentals: Introduction to Mobile App Development",
    "language": "en",
    "source": "coursetalk"
}