{
    "description": "Interested in learning a computer programming language but unsure of how and where to begin? This course, Learn to Program Using Python, is a great place to start.\n\nPython is an easy and fun language to learn, and it is now one of the most popular programming languages, suitable for almost any task from developing graphical user interfaces to building web applications.\n\nThis course is an introduction to the Python programming language. This course is open to all learners who wish to gain an understanding of the basic components of computer programming. You will learn basic computer programming concepts and terminologies such as variables, constants, operators, expressions, conditional statements, loops, and functions. This Python course includes hands-on exercises to help you understand the components of Python programming while incrementally developing more significant programs. The exercises in this course will be based on small assignments which will relate to real-world problems.\n\nNo previous programming knowledge needed. Upon completing this course you will be able to:\n\nGet user-input data and manipulate it using Python.\n\tImplement basic Python structures such as if statements, loops, and functions.\n\tRead and write external data files using Python.\n\tImplement functions and call built-in Python functions.\n\tImport and use library function modules from the Python library.\n\tDebug an entire program and handle errors in Python.",
    "instructors": "Farhad Kamangar",
    "requirements": "High school algebra. No prior programming experience is required.",
    "length": "9 weeks",
    "effort": "6 - 8 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "UTArlingtonX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/learn-program-using-python-utarlingtonx-cse1309x",
    "title": "Learn to Program Using Python"
}