{
    "description": "XSeries Program Overview \n\nTaught by instructors with decades of experience on Wall Street, this series will equip analysts and associates with the skills they need to rise in the M&A field. Directors and managers who have transitioned, or hope to transition, to M&A from other areas, such as equities or fixed income, can use this course to eliminate skill gaps.\n The M&A Professional Certificate is presented in five modules – Concepts and Theories: An Introduction, Concepts and Theories: Advanced Topics, Structuring the Deal, Free Cash Flow: A Powerful Decision-Making Metric, and Accounting for Mergers & Acquisitions. There is a final module consisting of the M&A Professional Certification Examination.\n \nThose participants who pass the Examination will receive an accredited certificate bearing the New York Institute of Finance (NYIF) name. A NYIF certificate, highly valued in the finance industry, will bolster a resume or LinkedIn profile and prove the skills you’ve gained to potential employers. \n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about M&A Professional Certificate\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Complete the required exam to earn your professional certificate in Mergers &amp; Acquisitions from the New York Institute of Finance. If your goal is a career on a broker-dealer’s M&amp;A desk, this is the course for you! If your goal is a career on a broker-dealer’s M&amp;A desk, this is the course for you! If your goal is a career on a broker-dealer’s M&amp;A desk, this is the course for you! If your goal is a career on a broker-dealer’s M&amp;A desk, this is the course for you! If your goal is a career on a broker-dealer’s M&amp;A desk, this is the course for you!",
    "instructors": [
        "Jeff Hooke",
        "Steve Literati"
    ],
    "length": "4 weeks\/course",
    "effort": "1 - 2 hours\/week",
    "prices": "Average $250\/course",
    "institutions": "New York Institute of Finance",
    "subjects": "Economics & Finance",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/ma-professional-certificate"
}