{
    "source": "Coursera",
    "description": "If you have been interested in the media explosion discussing \"sports analytics\" this course is for you. You will learn lots about sports, Excel, analytics, and how they interface. Cool topics include setting point spreads, choosing daily fantasy sports lineups, evaluating football play selection and NBA lineups. The course is self-contained with no real requirements beyond high school algebra and knowledge of the Excel Copy Command. Learn how probability, math, and statistics can be used to help baseball, football and basketball teams improve, player and lineup selection as well as in game strategy.",
    "contents": "Week 1: You will\nlearn how to predict a team’s win loss record from the number of runs, points,\nor goals scored by a team and its opponents. Then we will introduce you to multiple\nregression and show how multiple regression is used to evaluate baseball\nhitters. Excel data tables, VLOOKUP, MATCH, and INDEX functions will be\ndiscussed.\n\nWeek 2:&nbsp; You will concentrate on learning important Excel\ntools including Range Names, Tables, Conditional Formatting,&nbsp; PivotTables, and the family of COUNTIFS,\nSUMIFS, and AVERAGEIFS functions.\n\nWeek 3: You will\nlearn how Monte Carlo simulation works and how it can be used to evaluate a\nbaseball team’s offense and the famous DEFLATEGATE controversy.\n\nWeek 4: You will learn\nhow to evaluate baseball fielding, baseball pitchers, &nbsp;and evaluate in game baseball decision-making.\nThe math behind WAR (Wins above Replacement) and Park Factors will also be\ndiscussed. Modern developments such as infield shifts and pitch framing will\nalso be discussed.\n\nWeek 5: You will\nlearn basic concepts involving random variables (specifically the normal random\nvariable, expected value, variance and standard deviation.) You will learn how regression\ncan be used to analyze what makes NFL teams win and decode the NFL QB rating\nsystem. You will also learn that momentum and the “hot hand” is mostly a myth.\nFinally, you will use Excel text functions and the concept of Expected Points\nper play to analyze the effectiveness of a football team’s play calling.\n\nWeek 6: You will\nlearn how two-person zero sum game theory sheds light on football play\nselection and soccer penalty kick strategies. Our discussion of basketball\nbegins with an analysis of NBA shooting, box score based player metrics, and\nthe Four Factor concept which explains what makes basketball teams win.\n\nWeek 7: You will learn\nabout advanced basketball concepts such as Adjusted plus minus, ESPN’s RPM,\nSportVu data, and NBA in game decision-making.\n\nWeek 8: You will\nlearn how to use game results to rate sports teams and set point spreads. Simulation\nof the NCAA basketball tournament will aid you in filling out your 2016\nbracket. Final 4 is in Houston!\n\nWeek 9: You will\nlearn how to rate NASCAR drivers and get an introduction to sports betting\nconcepts such as the Money line, Props Bets, and evaluation of gambling betting\nsystems.\n\nWeek 10: You will\nlearn how Kelly Growth can optimize your sports betting, how regression to the\nmean explains the SI cover jinx and\nhow to optimize a daily fantasy sports lineup. We close with a discussion of golf\nanalytics.",
    "requirements": "The more knowledge you have of basic probability, multiple regression, and Excel the better. If you work hard and are good at algebra, no prior knowledge should be necessary.",
    "effort": "6-8 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/mathletics",
    "title": "Math behind Moneyball",
    "courseraId": "3123",
    "subjects": "Mathematics"
}