{
    "description": "What's the sure road to success in calculus? The answer is simple:\nPrecalculus. Traditionally studied after Algebra II, this mathematical field\ncovers advanced algebra, trigonometry, exponents, logarithms, and much more.\nThese interrelated topics are essential for solving calculus problems, and by\nthemselvesare powerful methods for describing the real world, permeating all\nareas of science and every branch of mathematics. Little wonder, then, that\nprecalculus is a core course in high schools throughout the country and an\nimportant review subject in college.Unfortunately, many students struggle in\nprecalculus because they fail to see the links between different\ntopics—between one approach to finding an answer and a startlingly different,\noften miraculously simpler, technique. As a result, they lose out on the\nenjoyment and fascination of mastering an amazingly useful tool box of\nproblem-solving strategies.And even if you're not planning to take calculus,\nunderstanding the fundamentals of precalculus can give you a versatile set of\nskills that can be applied to a wide range of fields—from computer science and\nengineering to business and health care.Mathematics Describing the Real World:\nPrecalculus and Trigonometry is your unrivaled introduction to this crucial\nsubject, taught by award-winning Professor Bruce Edwards of the University of\nFlorida. Professor Edwards is coauthor of one of the most widely used\ntextbooks on precalculus and an expert in getting students over the trouble\nspots of this challenging phase of their mathematics education.\"Calculus is\ndifficult because of the precalculus skills needed for success,\" Professor\nEdwards points out, adding, \"In my many years of teaching, I have found that\nsuccess in calculus is assured if students have a strong background in\nprecalculus.\"A Math Milestone Made ClearIn 36 intensively illustrated half-\nhour lectures, supplemented by a workbook with additional explanations and\nproblems, Mathematics Describing the Real World takes you through all the\nmajor topics of a typical precalculus course taught in high school or college.\nThose who will especially benefit from Professor Edwards's lucid and engaging\napproach include high school and college students currently enrolled in\nprecalculus who feel overwhelmed and want coaching from an inspiring teacher\nwho knows where students stumble; parents of students, who may feel out of\ntheir depth with the advanced concepts taught in precalculus; those who have\nfinished Algebra II and are eager to get a head start on the next milestone on\nthe road to calculus; beginning calculus students who want to review and hone\ntheir skills in crucial precalculus topics; anyone motivated to learn\nprecalculus on his or her own, whether as a home-schooled pupil or as an adult\npreparing for a new career.",
    "instructors": "Professor Bruce H. Edwards",
    "url": "https:\/\/www.coursetalk.com\/providers\/the-great-courses\/courses\/mathematics-describing-the-real-world-precalculus-and-trigonometry-dvd-course",
    "title": "Mathematics Describing the Real World: Precalculus and Trigonometry - DVD course",
    "language": "en",
    "source": "coursetalk"
}