{
    "description": "Learn to use the open development tool, App Inventor, to program on Android devices. You will learn how to design and build mobile apps -- apps that are aware of their location, send and receive text messages, and give advice and directions. The only limit on the types of apps you will learn to build is your own imagination!\n\nHowever, computer science is not just about coding and building apps. We will also learn some of  the fundamental principles of computer science. We'll learn about the potential and the limitations of computing and coding. We'll learn how the Internet works and about the positive and negative aspects of computing in today's society, and much more!\n\nFor these broader computing concepts we will work within an emerging curricular framework -- the Computer Science Principles (CSP). The CSP framework is being developed by leading computer science educators from around the country under the auspices of the College Board and with funding support of the National Science Foundation.\n\nIn addition to programming and CSP the course is project-based and emphasizes writing, communication, and creativity. Multiple-choice questions, in the style that students can expect to encounter on the AP exam, will also be a key component of this course. How to design and create Android mobile apps using App Inventor\n\tHow computer science principles apply to algorithms, programming, the Internet and society\n\tHow to think creatively, analytically and abstractly about computational problems ",
    "instructors": "Ralph A. Morelli",
    "requirements": "None",
    "length": "6 weeks",
    "effort": "8 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "TrinityX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/mobile-computing-app-inventor-cs-trinityx-t002x",
    "title": "Mobile Computing with App Inventor – CS Principles"
}