{
    "description": "Modelling and Simulation using MATLAB Technical progress wouldn’t be possible\nwithout modelling and simulation. They are starting point and basis in most\ncases of research and development. Modelling and simulation make a particular\npart or feature of the world easier to define, visualize, quantify and\nunderstand. Both require identifying and selecting relevant aspects of a\nsituation in the real world and then using different types of models for\ndifferent aims and defining the best fitting model parameters. MATLAB is a\nhigh-level programming language and an environment for numerical computation\nand visualization. You can analyse data and create models for a wide range of\napplications, including signal processing and communications, image and video\nprocessing, control engineering and computational finance. In this course you\nwill learn the basics of modelling and simulation from an interdisciplinary\nperspective. In addition, we will teach you how to develop models using MALTAB\nand the block diagram environment Simulink. Why this MOOC is interdisciplinary\nScientific disciplines have their own ideas about specific types of modelling.\nSuch as conceptual models to better understand the subject, graphical models\nto visualize the subject, operational models to operationalize and\nmathematical models to quantify the subject. In this course, our experts from\nthree disciplines look at modelling concepts from various angles:\nTechnological view Economic perspective Importance of knowledge management.\nCourse Contents The course is divided in two sections. The first part (A)\nteaches the basics and is mandatory to all participants. Within the second\npart of the course (B) you have the opportunity to choose from a catalogue of\napplications (MOOClets) to work on selected examples. Part A –\nInterdisciplinary Introduction to modelling and simulation Modelling\nSimulation Introduction to MATLAB concepts Building a business case Methods to\nsolve formal problems Knowledge management Introduction to Simulink Part B –\nSelectable Applications of modelling and simulation (MOOClets) You can choose\nthree to five applications according to your preference and knowledge from the\nfollowing catalogue: Simulation of a water treatment plant Application\n'modelling a business base' Application 'knowledge management' Control\nengineering I – 'controlling Lego® NXT robots' Control engineering II – 'line\ntracking with Lego® Segway' Control engineering III – 'a Segway – how does it\nwork?' Image processing I – ‘statistics for image processing and machine\nlearning’ Image processing II – 'a brief introduction to image processing'\nImage processing III – ‘application of machine learning algorithms in a\nnutshell' Quality measurement of video cameras (lenses and sensors) Acoustic\nsimulation of musical instruments … (further chapters are planned) Learning\nwith the MOOC During the term of the MOOC we will offer video lectures that\nconvey modelling and simulation step by step in a descriptive way. You will\nexercise the issues in interactive tasks and weekly homework. The MOOC\nplatform is a networking tool. You can benefit from the peer-to-peer learning\nand the forum within the course. While not required, we recommend creating\nlearning groups and to engage in the community. Experimentation and playful\nlearning are part of the MOOC. Learning Outcomes Students are acquainted with\nthe concepts of modelling and simulation from an interdisciplinary point of\nview Students are able to implement and simulate models using MATLAB\/Simulink\nDepending on the selected applications in part B of the course students get\ndeeper know how in control engineering, image processing, machine learning,\nbusiness case modelling, knowledge management and simulation of a water\ntreatment plant. Enthusiastic students with only simple programming knowledge\nget an understanding of the basic MATLAB programming. Workload Approx. 8-12\nhours per week. 12 Units including individual selected applications of Part B.\nExperimentation and a deeper look at the topics as you like. FAQ",
    "instructors": "Prof. Dr.-Ing. Georg Fries",
    "institutions": "School: \n                                Hochschule RheinMain - University of Applied Sciences - Wiesbaden Rüsselsheim",
    "url": "https:\/\/www.coursetalk.com\/providers\/iversity\/courses\/modelling-and-simulation-using-matlab",
    "title": "Modelling and Simulation using MATLAB",
    "language": "en",
    "source": "coursetalk"
}