{
    "source": "Coursera",
    "description": "In 2003, the deadly Severe Acute Respiratory Syndrome (SARS) virus caused panic as it swept around the globe in a few weeks. But where did SARS come from? By constructing an evolutionary tree of the unknown virus as well as viruses taken from other species, we can not only understand which animal gave us SARS, but also reconstruct its path around the globe. This is just one of many problems in modern biology related to constructing evolutionary trees.In 2007, a team of biologists announced that some proteins had miraculously survived within a 68 million year old dinosaur fossil. Moreover, they concluded that the amino acid sequences of these dinosaur proteins were nearly identical to sequences in modern-day chickens. Based on this discovery, famed paleontologist Jack Horner (who inspired the character of Dr. Grant from Jurassic Park) hopes to resurrect dinosaurs by genetically re-engineering a chicken. &nbsp;But did these peptides really come from T. rex? To answer this question, we will need to explore the field of computational proteomics.In the end of the course, a Bioinformatics Application Challenge&nbsp;will let you apply popular bioinformatics software tools to construct an evolutionary tree of different Ebola viruses and hypothesize where the 2014 Ebola outbreak came from. In this course, we will see how evolutionary trees resolve quandaries from finding the origin of a deadly virus to locating the birthplace of modern humans. We will then use methods from computational proteomics to test whether we can reconstruct Tyrannosaurus rex proteins and prove that birds evolved from dinosaurs.",
    "contents": "Which Animal Gave Us SARS?&nbsp;(Evolutionary Tree Reconstruction)The Fastest OutbreakTransforming Distance Matrices into Evolutionary TreesToward An Algorithm for Distance-Based Phylogeny ConstructionAdditive PhylogenyUsing Least Squares to Construct Approximate Distance-Based PhylogeniesUltrametric Evolutionary TreesThe Neighbor-Joining AlgorithmCharacter-Based Tree ReconstructionThe Small Parsimony ProblemThe Large Parsimony ProblemEpilogue: Evolutionary Trees Fight CrimeWas T. rex Just a Big Chicken?&nbsp;(Computational Proteomics)Paleontology Meets ComputingWhat Proteins Are Present in This Sample?Decoding an Ideal SpectrumFrom Ideal to Real SpectraPeptide SequencingPeptide IdentificationPeptide Identification Meets the Infinite Monkey TheoremSpectral DictionariesT. rex Peptides: Treasure Trove of Ancient Proteins or Artifact of Contamination?Epilogue: From Unmodified to Modified PeptidesBioinformatics Application Challenge: Identifying the Origin of the Latest Ebola Outbreak",
    "requirements": "\"Comparing Genes, Genomes, and Proteins\" is the suggested prerequisite for taking this course, but it is not a strict prerequisite.If you are aiming at earning a standard certificate in this class, then you do not need to have any experience in biology or programming. &nbsp;The only prerequisite is the enthusiasm to learn about how computational approaches are used in modern biology :)If you are aiming at earning a certificate with distinction, then you should either know the basics of programming in the language of your choice (there is no required language for this course) or be willing to learn about programming before the course begins. In this case, in addition to the first three courses in this series, we have the following suggestions for resources that will help you learn programming.The language tracks on&nbsp;Codecademy, particularly the Python track.An Introduction to Interactive Programming with Python, the acclaimed Coursera course.Introductory problems on&nbsp;Rosalind, a resource for learning bioinformatics created by the course instructors.",
    "effort": "4-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/molecularevolution",
    "title": "Molecular Evolution (Bioinformatics IV)",
    "courseraId": "3048",
    "subjects": "Computer Science: Software Engineering, Mathematics, Information, Tech & Design, Computer Science: Theory"
}