{
    "source": "Coursera",
    "description": "Nanotechnology is an exciting research area that spans disciplines from electrical engineering to biology. &nbsp;Over the last two decades the basic science of this area has launched new technologies, the first examples of which are finding their way into commercial products. &nbsp;This four week course will provide students with a bird's eye view into this fast moving area and leave students with an appreciation of the importance and foundation of super-small materials and devices. Nanotechnology is an emerging area that engages almost every technical discipline – from chemistry to computer science – in the study and application of extremely tiny materials.  This short course allows any technically savvy person to go one layer beyond the surface of this broad topic to see the real substance behind the very small.",
    "contents": "Nanotechnology: The BasicsWeek 1: Small, strange and useful! This first week we will introduce nanotechnology.&nbsp; As you will learn, defining the term itself can be a challenge and the discipline has a rich and somewhat controversial history.&nbsp; We will conclude the week with a tour of the different types of materials in the nanotechnology pantheon that sets up the class for the weeks to come.Week 2: Electronics when materials are super small.&nbsp; There is no doubt our lives have been changed by the small and powerful computers we now use in everything from our cell phones to our coffeemakers.&nbsp; This week you will learn how nanotechnology has been a part of this revolution and what the limits are to making wires and transistors super, super small.Week 3: How magnets change when they are made small.&nbsp; Magnetism is quite mysterious and the foundation of such cool technologies as flash drives and MRI imaging.&nbsp; Nanotechnology has played a crucial role in advancing all of these diverse applications and in week 3 you'll gain some insight into how that is possible.Week 4: Shedding light on nanoscale materials and photonics.&nbsp; Compared to electrons, photons are difficult things to trap and control with normal materials.&nbsp; Nanomaterials offer completely new approaches to manipulating light.&nbsp; Whether its through diffraction, or plasmonics, nanotechnology can provide new capabilities for solid state lasers as well as super resolution microscopes.",
    "requirements": "We expect some knowledge of freshman chemistry and physics, as well as algebra.&nbsp; Access to a spreadsheet program would also be of value.&nbsp; However, we recognize that for some interested participants this knowledge may be rusty and will provide where possible optional review videos to go over terminology and concepts relevant to the week's material.",
    "effort": "4-8 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/nanotech",
    "title": "Nanotechnology: The Basics",
    "courseraId": "93",
    "subjects": "Engineering"
}