{
    "description": "The transistor has been called the greatest invention of the 20th century – it enables the electronics systems that have shaped the world we live in. Today’s nanotransistors are a high volume, high impact success of the nanotechnology revolution. If you are interested in understanding how this scientifically interesting and technologically important nano-device operates, this course is for you!\n\nThis nanotechnology course provides a simple, conceptual framework for understanding the essential physics of nanoscale transistors.  It assumes only a basic background in semiconductor physics and provides an opportunity to learn how some of the fascinating new discoveries about the flow of electrons at the nanoscale plays out in the context of a practical device.\n\nThe course is divided into four units:\n\nTransistors fundamentals\n\tTransistor electrostatics\n\tBallistic MOSFETs\n\tTransmission theory of the MOSFET\nThe first two units provide an introduction for students with no background in transistors or a quick review for those familiar with transistors.  The third unit treats the ballistic transistor in which electrons move without resistance (in the traditional sense). The last unit uses that Landauer Approach to electron transport, which was developed to understand some striking experiments in nanophysics, to develop an understanding of how electrons flow in modern nanotransistors.  This short course describes a way of understanding MOSFETs that is much more suitable than traditional approaches when the channel lengths are of nanoscale dimensions. Surprisingly, the final result looks much like the traditional, textbook, MOSFET model, but the parameters in the equations have simple, clear interpretations at the nanoscale.\n\nMy objective for this course is to provide students with an understanding of the essential physics of nanoscale transistors as well as some of the practical technological considerations and fundamental limits. The goal is to do this in a way that is broadly accessible to students with only a very basic knowledge of semiconductor physics and electronic circuits. The course is designed for anyone seeking a sound, physical, but simple understanding of how nanoscale transistors operate. The course should be useful for advanced undergraduates, beginning graduate students, as well as researchers and practicing engineers and scientists.\n\nThis course is the latest in a series offered by the nanoHUB-U project which is jointly funded by Purdue and NSF with the goal of transcending disciplines through short courses accessible to students in any branch of science or engineering. These courses focus on cutting-edge topics distilled into short lectures with quizzes and practice exams. Transistor fundamentals (IV characteristics and device metrics)\n\tMOS electrostatics (in one and two dimensions)\n\tThe Landauer Approach to electron transport\n\tThe transmission theory of the MOSFET and its relation to traditional and Virtual Source transistor models",
    "contents": "Course Syllabus\n        Weeks 1 & 2: Transistor FundamentalsWeeks 3 & 4: MOS ElectrostatisticsWeeks 5 & 6: The Ballistic NanotransistorWeeks 7 & 8: The Transmission Theory of the MOSFET",
    "instructors": [
        "Mark Lundstrom",
        "Piyush Dak",
        "Evan Witkoske"
    ],
    "requirements": "Basic semiconductor understanding\nNo familiarity with electronics or transistors is assumed.",
    "length": "8 weeks",
    "effort": "6 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "PurdueX",
    "subjects": "Engineering",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/nanotechnology-fundamentals-purduex-nano530x",
    "title": "Nanotechnology: Fundamentals of Nanotransistors"
}