{
    "description": "SAP HANA is an in-memory data platform that is deployable either as an\r\nappliance or in the cloud. At its core, it is an innovative, in-memory,\r\nrelational database management system that exploits all the capabilities of\r\ncurrent hardware to increase application performance, reduce total cost of\r\nownership, and enable new scenarios and applications that were not possible\r\nbefore.SAP HANA enables you to build applications that integrate the business\r\nlogic, the control logic, and the database layer with unprecedented\r\nperformance. As a developer, one of the key issues is how to minimize data\r\nmovements. The more you can do directly on the data in memory next to the\r\nCPUs, the better the application will perform.This course will build upon last\r\nyear’s Introduction to Software Development on SAP HANA course and go deeper\r\ninto each of the major topics around SAP HANA native development. We will\r\nexplore the many advances in the programming model and tooling that came with\r\nSAP HANA SPS6, SPS7, and SPS8.\r\n\r\nDuring the course, we will use SAP HANA studio as well as several new Web-\r\nbased tools (for example, the Web-based Development Workbench, SAP HANA\r\nLifecycle Management, and SAP HANA XS Administration Tool).\r\n\r\nWe will also go well beyond the basics of each of the programming models,\r\nallowing discussion of deeper, real-world patterns and anti-patterns. We will\r\nlook at the architecture of applications that are not just read-only or\r\nanalytic but also transactional or provide an interface with transactional\r\nsystems. We will also look at the extended capabilities of SAP HANA, from\r\nbeyond a database to a complete application platform.Registration, learning\r\ncontent, final exam, and Record of Achievement are free of charge. However, to\r\nfully benefit from the course, you can access a fee-based system environment\r\nto develop your own code.",
    "instructors": "Thomas Jung, Rich Heilman",
    "url": "https:\/\/www.coursetalk.com\/providers\/opensap\/courses\/next-steps-in-software-development-on-sap-hana",
    "title": "Next Steps in Software Development on SAP HANA",
    "language": "en",
    "source": "coursetalk"
}