{
    "description": "Optimizing Microsoft Windows Server storage is key to keeping pace with your organization’s ever increasing data needs. Once you have initially configured your Microsoft Windows Server storage you will want to take advantage of three key features: iSCSI Storage, Storage Spaces and Data Deduplication.\n\niSCSI is a protocol that supports remote access to SCSI-based storage devices over a TCP\/IP network. It provides and easy to use alternative to Storage Area Networks (SANs) and can use existing infrastructure.\n\nStorage Spaces lets you group physical disks together and present them as a single logical disk. This makes it easy to manage and dynamically allocate storage.\n\nData Deduplication is a service that identifies and removes duplications within data. The goal of Data Deduplication is to maximize the use of disk space.\n\nThis course follows INF201.21, Implementing Microsoft Windows Server Disks and Volumes but it is not required.\n\nGo beyond simple storage strategies and take control of your organization’s storage needs! How to implement Microsoft Windows Server iSCSI infrastructure to access storage devices on the network\n\tHow to implement Microsoft Windows Server Storage Spaces including storage layout, drive allocation and provisioning.\n\tHow to implement the Microsoft Windows Server Data Deduplication service to maximize the use of disk space.",
    "contents": "Course Syllabus\n        Lesson 1: iSCSI Storage\n\nDescribe the iSCSI infrastructure and identify the components.\n\tImplement an iSCSI infrastructure using Server Manager.\n\tImplement high availability using MPIO.\n\tLearn about best practices for installing and configuring an iSCSI infrastructure.\nLesson 2: Storage Spaces\n\nDescribe the Storage Spaces feature and its components.\n\tDescribe common usage scenarios for storage spaces, and weigh their benefits and limitations.\n\tImplement Storage Spaces including storage layout, drive allocation, and provisioning schemes.\n\tIdentify different storage space resiliency models and when to use them. \nLesson 3: Data Deduplication\n\nImplement the data deduplication service and configure the settings.\n\tUse Windows PowerShell to manage and monitor data deduplication jobs.\n\tIdentify common usage scenarios for data deduplication and expected disk space savings.\n\tDescribe how data deduplication works and how other tasks, like backup and restore, are affected.\n\tIdentify data deduplication considerations and limitations. ",
    "instructors": [
        "Cynthia Staley",
        "Marcin Policht"
    ],
    "requirements": "Learners should have some general understanding of server and storage concepts. This course will only review fundamental information where necessary to illustrate how Microsoft implements a Windows Server feature.  \n\tIt would be helpful to have taken INF201.12, Introduction to Windows Server. This ensures a strong foundation in Server Manager, server roles, and server features.\n\tIt would be helpful to have taken INF201.21, Implementing Windows Server Disks and Volumes. This ensures a strong foundation in implementing, configuring and securing, disks and volumes.\n\tWindows PowerShell will be the tool of choice when implementing the features in this course. Therefore, it would be helpful to have completed INF201x, Windows PowerShell Fundamentals. This ensures you have a strong foundation in accessing and using simple Windows PowerShell commands.  ",
    "length": "6 weeks",
    "effort": "2 - 4 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $49",
    "institutions": "Microsoft",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/optimizing-microsoft-windows-server-microsoft-inf201-22x",
    "title": "Optimizing Microsoft Windows Server Storage"
}