{
    "description": "Organic electronic devices are quickly making their way into the commercial world, with innovative thin mobile devices, high-resolution displays, and photovoltaic cells. The future holds even greater potential for this technology, with an entirely new generation of ultralow-cost, lightweight and even flexible electronic devices, which will perform functions traditionally accomplished with much more expensive components based on conventional semiconductor materials, such as silicon.\n\nLearn more about this highly promising technology, which is based on small molecules and polymers, and how these materials can be implemented successfully in established (e.g., organic light-emitting devices (OLEDs), organic photovoltaic (OPV) devices) and emerging (e.g., thermoelectric (TE) generators) organic electronic modules.\n\nIn this course you will gain the ability to tie molecular transport phenomena with macroscopic device response such that you will be well-prepared to analyze, troubleshoot, and design the next generation of organic electronic materials and devices.\n \nThis course has short lectures with quizzes, homework, and exams.\n\nThis course is the latest nanoHUB-U project in a series offered is jointly funded by Purdue University and the NSF with the goal of transcending disciplines though short courses accessible to students in any branch of science or engineering.  Synthesis of Organic Semiconductors. \n\tIdentify common mechanisms for the synthesis of small molecule and polymer semiconductors\n\t\tDescribe the mechanism of controlled polymerization techniques for macromolecular semiconductors\n\t\tInterpret spectroscopic, chromatographic, and molecular characterization data in order to predict the structure of the organic semiconductor.\n\t\n\tCharge Generation and Transport and Optoelectronic Characterization of Organic Semiconductors. \n\tExplain how molecular orbital levels are related to the optoelectronic properties of organic semiconductors\n\t\tDistinguish between different models for charge transport in organic semiconductors; describe clearly the difference between charge generation and transport in organic and inorganic semiconductors.\n\t\n\tDevice Application of Organic Semiconductors. \n\tExplain how organic electronic devices operate and how to apply known equations to evaluate device performance\n\t\tCritique the potential for organic electronic materials to supplement or replace inorganic semiconducting devices.",
    "instructors": [
        "Bryan Boudouris",
        "Edward P. Tomlinson"
    ],
    "requirements": "This course is suited for undergraduates with two semesters of general chemistry and two semesters of general physics.  Familiarity with solid-state physics or elementary circuits is recommended but not required.",
    "length": "7 weeks",
    "effort": "6 hours per week",
    "prices": "Free\n        \n         \n         Verified Certificate option closed",
    "institutions": "PurdueX",
    "subjects": "Electronics",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/organic-electronic-devices-purduex-nano515x",
    "title": "Organic Electronic Devices"
}