{
    "source": "Coursera",
    "description": "Are you overwhelmed by the tidal wave of new technology tools available for teachers and learners? Powerful Tools for Teaching and Learning: Web 2.0 Tools can help channel that flood into a manageable power source for student engagement and motivation in your classroom! This course is designed to provide teachers with strategies to effectively integrate Web 2.0 technologies into their instruction. You will learn how to use these tools effectively in your classroom\nthrough unique problem-based scenarios that will help you understand how to\nchoose the best Web 2.0 tool. Our approach focuses on the task rather than the tool in an effort to improve communication,\ncollaboration, presentation, creativity, problem solving, and critical thinking in your learners. You will take part in a robust exchange of practical ideas while participating in online discussion\nforums and sharing your experiences and learning from fellow teachers about best practices with Web 2.0 tools in your content area. Learn about innovative Web 2.0 tools in K-12 instruction and how to effectively integrate these technologies into classroom practices and to create engaging student activities.",
    "contents": "Our Web 2.0 explorations during Weeks One, Two and Three are based on ideas in the article, Implementing the Seven Principles: Technology as Lever by Arthur Chickering and Stephen C. Ehrmann.\n\nWeek One: Can you hear me now? Exploring Web 2.0 Tools for Communication.In Week One, we will explore the first of the seven principles, \"Good Practice Encourages Contacts Between Students and Faculty.\" Communicating effectively through words and writing in diverse environments using technology is one of the most important aspects of learning and growth in education. Every one of us has faced some type of\ncommunication problems in class and may have struggled sometimes to tackle them\neffectively in this digital age. Consider this question: What is a communication issue in your teaching environment that could be resolved by using new technologies?\n\nWeek Two: Do we have to do group work? Exploring Web 2.0 Tools for CollaborationIn Week Two, we will consider the second principle, \"Good Practice Develops Reciprocity and Cooperation Among Students.\" Working together in a group is always a challenge. To effectively collaborate with peers in a diverse team using technology is one of the most important aspects of learning and growth in education. Every one of us has faced some type of collaboration problems in class and may have struggled\nsometimes to tackle them effectively in this digital age. Consider this question: What is a collaboration issue in your teaching environment that could be resolved by using new technologies?\n\nWeek  Three: Another PowerPoint? Exploring Web 2.0 Tools for CreativityIn Week Three, we will look at another principle, \"Good Practice Respects Diverse Talents and Ways of Learning.\" Being creative is not just about creating new ideas; it is also about techniques that will help to develop, nurture and evaluate worthwhile ideas. Encouraging and inculcating creative techniques in teaching is one of the most critical aspects of learning and growth in education especially in this digital age. Consider this question: What is a creativity issue in your teaching environment that could be resolved by using new technologies?\n\nWeek Four:&nbsp;Oh! So That’s How It Fits Together,&nbsp;Utilizing My Toolbox.\nIn Week Four, you will apply what you have learned in a mini action research project in your classroom. Using Web 2.0 tools is not about the technology but about improving student learning. In this module, we will highlight the connections between the things you have learned and the various instructional technology standards for 21st century learners and educators. Consider this question: What are the student outcomes in each of these tool categories? In other words, what skill set do we want our students to have as they use instructional technology in accomplishing their learning objectives?&nbsp;\n\nWeek Five: It does not end here! Lifelong Learning\nIn Week Five,&nbsp;we will wrap things up with ways you can keep adding tools to your Web 2.0 toolbox. &nbsp;We will also share ideas on developing personal learning networks (PLNs) to support lifelong learning. Finally, you will finish the course with a great set of Web 2.0 tool resources to further explore and learn.",
    "requirements": "The course is primarily for:\n\nTeachers working with children K-12 i.e., elementary,\n     middle, and high school teachers.Instructors working with further education, community\n     college or vocational students.Continuing education or in-service facilitators supporting\n     teachers and faculty.Educators interested in educational technology and\/or\n     online instruction.\n\nPlease note that although this program\nis offered to participants from around the world, many of the examples and\nexperiences shared will be based on the education structure and processes of\nthe United States. Participants will be encouraged to discuss their own\ncountry-based experiences in the forums.",
    "effort": "3-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/newtechtools",
    "title": "Powerful Tools for Teaching and Learning: Web 2.0 Tools",
    "courseraId": "1546",
    "subjects": "Information, Tech & Design"
}