{
    "description": "XSeries Program Overview\n\nThis introductory college-level business information systems XSeries is designed to help you pass the CLEP Information Systems and Computer Applications exam and introduce you to the amazing world of Information Technology (IT).\n \nThrough this series, you will learn the basic concepts of information systems and their application, and gain familiarity with the terminology used within the IT field.\n \nThis series covers the following topic areas:\n Information Systems and Office Application Software in Organizations\n\nStandard office suite tools, office systems (email, conferencing, etc...), basics of desktop operating systems,\n\tInternet, web browsers,  Electronic Data Interchange and enterprise wide systems\n Hardware and Systems Technology\n\nComputers and their components, data representation and processing\n\tComputer networks, client\/server architecture, operating systems architecture and wireless computing\n Information Systems Software Development\n\nSoftware development, systems development, information processing, user interface design and standards\n\tProject management\n Programming Concepts and Data Management\n\nProgramming languages and logic, object oriented methods, data types and structures, file types, databases, SQL,\n\tWeb technologies and development, data warehousing and data mining\n Business, Social, and Ethical Implications and Issues\n\nEconomic effects, business strategies, privacy concerns, security and controls, intellectual property\n\tCareers in information technology \nBy completing this XSeries, you will be prepared to pass the CLEP Information Systems and Computer Applications Exam.\n \n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about Preparing for CLEP Information Systems and Computer Applications Exam\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Prepare for the CLEP Information Systems and Computer Applications exam. Part 3 will focus on software development. Prepare for the CLEP Information Systems and Computer Applications exam. Part 4 will cover the programming elements of the exam. Prepare for the CLEP Information Systems and Computer Applications exam. Part 5 will cover the social implications of technology. Prepare for the CLEP Information Systems and Computer Applications exam. Part 1 will focus on IT in organizations. Prepare for the CLEP Information Systems and Computer Applications exam. Part 2 will focus on hardware.",
    "instructors": [
        "Vicent Botti Navarro",
        "Tanja Vos",
        "Carlos Turró",
        "Ignacio Despujol",
        "Miguel Rebollo"
    ],
    "length": "18 weeks total",
    "effort": "3 hours\/week",
    "prices": "$50\/course",
    "institutions": "UPValenciaX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/preparing-clep-information-systems"
}