{
    "source": "Coursera",
    "description": "What are Probabilistic Graphical Models?\nUncertainty is unavoidable in real-world applications: we can almost never predict with certainty what will happen in the future, and even in the present and the past, many important aspects of the world are not observed with certainty. Probability theory gives us the basic foundation to model our beliefs about the different possible states of the world, and to update these beliefs as new evidence is obtained. These beliefs can be combined with individual preferences to help guide our actions, and even in selecting which observations to make. While probability theory has existed since the 17th century, our ability to use it effectively on large problems involving many inter-related variables is fairly recent, and is due largely to the development of a framework known as Probabilistic Graphical Models (PGMs). This framework, which spans methods such as Bayesian networks and Markov random fields, uses ideas from discrete data structures in computer science to efficiently encode and manipulate probability distributions over high-dimensional spaces, often involving hundreds or even many thousands of variables. These methods have been used in an enormous range of application domains, which include: web search, medical and fault diagnosis, image understanding, reconstruction of biological networks, speech recognition, natural language processing, decoding of messages sent over a noisy communication channel, robot navigation, and many more. The PGM framework provides an essential tool for anyone who wants to learn how to reason coherently from limited and noisy observations.\nIn this class, you will learn the basics of the PGM representation and how to construct them, using both human knowledge and machine learning techniques; you will also learn algorithms for using a PGM to reach conclusions about the world from limited and noisy evidence, and for making good decisions under uncertainty. The class covers both the theoretical underpinnings of the PGM framework and practical skills needed to apply these techniques to new problems. In this class, you will learn the basics of the PGM representation and how to construct them, using both human knowledge and machine learning techniques.",
    "contents": "Topics covered include:\n\nThe Bayesian network and Markov network representation, including extensions for reasoning over domains that change over time and over domains with a variable number of entities\nReasoning and inference methods, including exact inference (variable elimination, clique trees) and approximate inference (belief propagation message passing, Markov chain Monte Carlo methods)\nLearning parameters and structure in PGMs\nUsing a PGM for decision making under uncertainty.\n\nThere will be short weekly review quizzes and programming assignments (Octave\/Matlab) focusing on case studies and applications of PGMs to real-world problems:\n\nCredit Scoring and Factors\nModeling Genetic Inheritance and Disease\nMarkov Networks and Optical Character Recognition (OCR)\nInference: Belief Propagation\nMarkov Chain Monte Carlo and Image Segmentation\nDecision Theory:&nbsp;Arrhythmogenic Right Ventricular Dysplasia\nConditional Random Field Learning for OCR\nStructure Learning for Identifying Skeleton Structure\nHuman Action Recognition with Kinect\n\nTo prepare for the class in advance, you may consider reading through the following sections of the&nbsp;textbook (discount code DKPGM12)&nbsp;by Daphne and Nir Friedman:\n\nIntroduction and Overview.&nbsp;Chapters 1, 2.1.1 - 2.1.4, 4.2.1.\nBayesian Network Fundamentals.&nbsp;Chapters 3.1 - 3.3.\nMarkov Network Fundamentals.&nbsp;Chapters 4.1, 4.2.2, 4.3.1, 4.4, 4.6.1.\nStructured CPDs.&nbsp;Chapters 5.1 - 5.5.\nTemplate Models.&nbsp;Chapters 6.1 - 6.4.1.\n\nThese will be covered in the first two weeks of the online class.\nThe slides for the whole class can be found&nbsp;here.\n",
    "effort": "15-20 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/pgm",
    "title": "Probabilistic Graphical Models",
    "courseraId": "3",
    "subjects": "Computer Science: Artificial Intelligence"
}