{
    "source": "Coursera",
    "description": "Data science is the profession of the\nfuture, because organizations that are unable to use (big) data in a smart way\nwill not survive. It is not sufficient to focus on data storage and data\nanalysis. The data scientist also needs to relate data to process analysis. Process\nmining bridges the gap between traditional model-based process analysis (e.g.,\nsimulation and other business process management techniques) and data-centric\nanalysis techniques such as machine learning and data mining. Process mining\nseeks the confrontation between event data (i.e., observed behavior) and\nprocess models (hand-made or discovered automatically). This technology has\nbecome available only recently, but it can be applied to any type of operational\nprocesses (organizations and systems). Example applications include: analyzing\ntreatment processes in hospitals, improving customer service processes in a\nmultinational, understanding the browsing behavior of customers using a booking\nsite, analyzing failures of a baggage handling system, and improving the user\ninterface of an X-ray machine. All of these applications have in common that\ndynamic behavior needs to be related to process models. Hence, we refer to this\nas \"data science in action\".\n\nThe course explains the key analysis\ntechniques in process mining. Participants will learn various process discovery\nalgorithms. These can be used to automatically learn process models from raw\nevent data. Various other process analysis techniques that use event data will\nbe presented. Moreover, the course will provide easy-to-use software, real-life\ndata sets, and practical skills to directly apply the theory in a variety of\napplication domains. Process mining is the missing link between model-based process analysis and data-oriented analysis techniques. Through concrete data sets and easy to use software the course provides data science knowledge that can be applied directly to analyze and improve processes in a variety of domains.",
    "contents": "This course starts with an overview\nof approaches and technologies that use event data to support decision making\nand business process (re)design. Then the course focuses on process mining as a\nbridge between data mining and business process modeling. The course is at an\nintroductory level with various practical assignments.\n\nThe course covers the three main\ntypes of process mining.&nbsp;The first type of process mining is discovery. A\ndiscovery technique takes an event log and produces a process model without\nusing any a-priori information. An example is the Alpha-algorithm that takes an\nevent log and produces a process model (a Petri net) explaining the behavior recorded in the log.&nbsp;The second type of process mining is conformance. Here, an existing process\nmodel is compared with an event log of the same process. Conformance checking\ncan be used to check if reality, as recorded in the log, conforms to the model\nand vice versa.The third type of process mining is enhancement. Here, the idea\nis to extend or improve an existing process model using information about the\nactual process recorded in some event log. Whereas conformance checking\nmeasures the alignment between model and reality, this third type of process\nmining aims at changing or extending the a-priori model. An example is the\nextension of a process model with performance information, e.g., showing\nbottlenecks. Process mining techniques can be used in an offline, but also\nonline setting. The latter is known as operational support. An example is the\ndetection of non-conformance at the moment the deviation actually takes place.\nAnother example is time prediction for running cases, i.e., given a partially\nexecuted case the remaining processing time is estimated based on historic information\nof similar cases.\n\nProcess mining provides not only a\nbridge between data mining and business process management; it also helps to\naddress the classical divide between \"business\" and \"IT\".\nEvidence-based business process management based on process mining helps to\ncreate a common ground for business process improvement and information systems\ndevelopment.\n\nThe course uses many examples using\nreal-life event logs to illustrate the concepts and algorithms. After taking\nthis course, one is able to run process mining projects and have a good\nunderstanding of the Business Process Intelligence field.After taking this course you should:- have a good understanding of Business Process Intelligence techniques (in particular process mining),- understand the role of Big Data in today’s society,- be able to relate process mining techniques to other analysis techniques such as simulation, business intelligence, data mining, machine learning, and verification,- be able to apply basic process discovery techniques to learn a process model from an event log (both manually and using tools),- be able to apply basic conformance checking techniques to compare event logs and process models (both manually and using tools),- be able to extend a process model with information extracted from the event log (e.g., show bottlenecks),- have a good understanding of the data needed to start a process mining project,- be able to characterize the questions that can be answered based on such event data,- explain how process mining can also be used for operational support (prediction and recommendation), and- be able to conduct process mining projects in a structured manner.",
    "requirements": "A basic understanding of logic, sets,\nand statistics (at the undergraduate level) is assumed. Basic computer skills\nare required to use the software provided with the course (but no programming\nexperience is needed). Participants are also expected to have an interest in\nprocess modeling and data mining but no specific prior knowledge is assumed as\nthese concepts are introduced in the course.&nbsp;",
    "effort": "4-6 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/procmin",
    "title": "Process Mining: Data science in Action",
    "courseraId": "1567",
    "subjects": "Computer Science: Artificial Intelligence, Information, Tech & Design, Statistics and Data Analysis"
}