{
    "source": "Coursera",
    "description": "Google’s Android OS runs 81% of smartphones worldwide and has shipped over one billion units this past year alone. Meanwhile, the search for talented Android developers continues, making it one of the most in-demand software development skills today.If you want to learn Android app development, and have a background in Java, this course will get you started with:Android Studio and the Android Development EnvironmentScreen configurations and sizesActivity Class, Intents and Permission, FragmentsDesigning user interfacesYou’ll apply what you’ve learned through hands-on labs and exercises, including developing an app inspired by the Museum of Modern Art in New York. From there, you’ll continue on to Part 2 learn about features that support more advanced Android applications, such as Threads, AsyncTasks, Handlers, User Notifications and BroadcastReceivers.\n\nA Comprehensive Program for Android DevelopersThis course is a part of the Mobile Cloud Computing with Android Specialization, a comprehensive program in which you will learn to create&nbsp;create&nbsp;complex, cloud-based Android applications, applying what you've learned through hands-on activities and a final project designed with industry partners.\"This is an excellent resource for any developer wishing to enter the growing mobile app industry. We’ve seen lots of great apps come out of this program.\" &nbsp; &nbsp; - Ankur Prasad, Amazon Appstore team\"The professors provided high-quality course materials and the forums and my fellow students were extremely helpful. To top it all off, being able to participate in the Capstone project and then voted into the top 30 apps was an absolutely amazing experience.&nbsp; I have now achieved my goal of working as a professional Android developer primarily due to the skills I obtained in this specialization.\"&nbsp; &nbsp; - Daun Davids, program graduateJoin our growing community of over 800,000 learners and get started with Android app development today! This course introduces you to the design and implementation of Android applications for mobile devices. You will develop an app from scratch, assuming a basic knowledge of Java, and learn how to set up Android Studio, work with various Activities and create simple user interfaces to make your apps run smoothly. ",
    "contents": "Objective 1: In this lesson, I discuss the Android Platform and the Android Development Environment and walk through the logistics of how to get started as an Android application developer.understand the components comprising the Android Platformuse various tools found in the Android Development EnvironmentObjective 2:&nbsp;In this lesson, I explain the basic components from which all Android applications are created. I also present the Activity class - one of the main class responsible for displaying an application's user interface.recognize the four fundamental components of Android applicationswork with the lifecycle of the Activity classcreate a simple Android applicationObjective 3: In this lesson, I explain the Intent class and Permissions. I also present the Fragment class - another key class responsible for displaying an application's user interface.By the end of this lesson, you should be able to: create applications comprising more than one Activityunderstand how to define and enforce permissionsdesign applications that run on multiple, differently-sized devicesObjective 4: In this lesson, I summarize and demonstrate the many class Android provides for creating user interfaces.By the end of this lesson, you should be able to:define and deploy applications with sophisticated and elegant user interfaces.Mini-project - Modern Art User Interfaces: Students will build a complete app from scratch. Collaborators from the Museum of Modern Art will help student draw some inspiration from the work of several Modern Art masters.",
    "requirements": "This course is created for students who already know how to program in Java, but are not expected to have studied mobile application development. This corresponds roughly to Sophomore- or Junior-level undergraduate students in a computer science related discipline or the equivalent.If you don't already know Java, but have strong familiarity with other programming languages, you can improve your Java knowledge by taking one of the many Java tutorials and online courses available on the web.As discussed above, this course assumes previous programming knowledge. It also assumes that you are willing to search for, read and learn from Android's developer documentation. This is both a necessary skill for success in the class, and, in our experience, a necessary skill for successful Android developers at all levels.In short, this course is not designed for truly novice programmers. If your background is not appropriate for this class, consider first taking a less programming-intensive introduction to Android such as \"Creative, Serious and Playful Science of Android Apps\", by Lawrence Angrave of the University of Illinois and Urbana-Champaign.",
    "effort": "5-10 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/androidpart1",
    "title": "Programming Mobile Applications for Android Handheld Systems: Part 1",
    "courseraId": "2599",
    "subjects": "Computer Science: Software Engineering, Information, Tech & Design"
}