{
    "source": "Coursera",
    "description": "Is popularity relevant to your life as an adult?&nbsp; You probably think about popularity as something you talked about in high school, and you surely have changed a lot since then.&nbsp; Maybe you don’t even want to think about popularity any more.&nbsp; After all, it is ancient history, right?&nbsp;Wrong.&nbsp; The psychology of popularity has been studied for decades because it helps us understand so much about how we behave as adults in ways that we don’t even realize.&nbsp; Every office has people who are more influential than others.&nbsp; Every community has its social circles, and we all have successes and heartbreaks in our personal relationships.&nbsp; Research findings tell us that a lot of this has to do with our popularity experiences years ago.&nbsp; But not in the ways you might think.&nbsp; We have only recently learned about the effects of popularity now that we have uncovered the workings of the human brain, and the ways that our pasts affect us outside of conscious awareness.&nbsp; Popularity even has the power to change the expression of your DNA.Whether or not you decide to take the class, you can be a part of an important research study anonymously! &nbsp;Please visit projectpopularity.org for details! The level of popularity you experienced in childhood and adolescence is still affecting you today in ways that you may not even realize.  Learn about how psychologists study popularity and how these same concepts can be used in adulthood to be more successful at work, become better parents, and have a happier life. ",
    "contents": "Module 1: How is popularity affecting your life as an adult?&nbsp; We will review how popularity is changing your social information processing and DNA expression. Module 2: How is popularity studied scientifically by psychologists?&nbsp; We will discuss the ways that we have identified different subgroups of kids and adults who have different popularity profiles.Module 3: Why are some people more popular than others? (Part 1)We will discuss what behaviors popular people engage in, and what types of specific behaviors make people unpopular almost immediately. &nbsp;Implications for adult relationships will be discussed.Module 4: Why are some people more popular than others? (Part 2)We will review why facial and body attractiveness plays a role in popularity and how parents can make their children more popular.&nbsp; Module 5: How does popularity change our mood, feelings, and behaviors? (Part 1)We will discuss recent findings regarding the links between popularity and psychopathology.Module 6: How does popularity change our mood, feelings, and behaviors? (Part 2) We will review why popular people really do have better skills and life outcomes compared to others. &nbsp;",
    "requirements": "No background is required. All are welcome! ",
    "effort": "1-2 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/popularity",
    "title": "Psychology of Popularity",
    "courseraId": "2965",
    "subjects": "Computer Science: Software Engineering, Computer Science: Artificial Intelligence, Mathematics, Information, Tech & Design, Computer Science: Systems & Security, Computer Science: Theory, Engineering, Statistics and Data Analysis"
}