{
    "source": "Coursera",
    "description": "\n\nThis course provides an understanding of the key principles of PPPs and the role of PPPs in the delivery of infrastructure services, particularly in emerging markets. Participants will learn from practitioners, government officials, and academics with field experience, hearing firsthand about the opportunities and challenges of procuring and maintaining infrastructure services through effective PPPs.\n\n\n\nThe course includes video lectures, readings, quizzes and other learning materials designed and taught by experts from Harvard University, Johns Hopkins University, the Indian School of Business, the European Investment Bank, the International Monetary Fund, and the United Nations Economic Commission for Europe (UNECE), among other institutions.\n\n\n\nWhether you are a member of the general public, a practitioner, or a policy maker, there is something in this course for you.\n \n  Public-Private Partnerships (PPP) are one tool that governments can employ to help deliver needed infrastructure services. PPPs are a way of contracting for services, using private sector innovation and expertise, and they often leverage private finance. PPPs can, implemented under the right circumstances, improve service provision and facilitate economic growth. ",
    "contents": "\nOverview \nThis overview presents the main topics the course will include: \n\nWeek 1: Reducing the Infrastructure Service Gap: The Role of PPPs\n \nThis first module introduces how and why private sector expertise and resources should be considered by governments to assist in addressing the infrastructure gap.  In particular, it explains the importance of infrastructure to economic growth, the gap between the demand and existing supply for infrastructure services, and the challenges that governments have in addressing this gap. \n\n\nThe module presents the PPP concept, its defining features, and the types of contractual arrangements, which reflect the extent of the private sector’s participation. Not all arrangements between a public and private party are PPPs and explanations of what is not a PPP are also provided. Examples of successful and failed cases of PPPs are introduced to illustrate conditions for PPP success and to underscore the need for sound analysis and need for sustainability, stakeholder engagement and good governance.\n\nWeek 2: Getting Decision-Making Right: PPP Frameworks and Institutions\nWhether undertaking PPPs as a series of ad hoc projects or through a coordinated program, PPPs require a change of approach and mind-set to delivering services and infrastructure. What does this mean for government institutions and what approaches are needed to manage this change? \n\n\n\nThis module examines the principles, value and challenges of putting in place a supportive framework to facilitate the execution of PPP projects with the aim of increased infrastructure investment and improved service delivery. While there is no “model” legal or organizational framework for PPPs, a clear and well-communicated articulation of the policy rationale for PPPs as well as the organization of laws, processes and institutional responsibilities that define how PPPs will be implemented are common elements that help ensure a positive private sector response.  You will be introduced to lessons learned from the execution of PPPs and how these lessons can be incorporated into successful PPP frameworks. In Week 2, an overview of the different stages of the PPP life cycle is also presented and the first stage of the PPP project cycle (project identification and screening) is explained. This overview provides the foundation for the discussions in weeks three and four, which will go into deeper into the procurement and contract management stages of the PPP project cycle.\n\nWeek 3: Attracting the Right Partner: Procuring PPPs\nBeing able to engage the right private sector partner starts with a well-prepared, commercially sustainable project. This module begins with a discussion about what is needed to demonstrate the “business case” to take forward a project as a PPP and the importance of structuring the PPP arrangements to ensure an appropriate risk allocation between the private sector sponsor, the financiers of the project, and the government. A well-designed and implemented transaction process is equally important, to ensure the best deal for government and to interest potential private sector partners who are able to achieve the desired efficiency and other improvements for the public users. &nbsp;However, managing a PPP transaction through to contract award is a complex and iterative process. This module walks through the stages of the tender process and explains the challenges in achieving a successful outcome. &nbsp;Finally, the module introduces the management of unsolicited proposals which, while outside a competitive tender process, may be a useful source of innovative ideas, but need to be subject to a thorough evaluation to ensure they respond to government needs efficiently.\n\nWeek 4: Making the Partnership Work: Implementing PPPs\nWhen a PPP contract is signed with a private party, the work of the partnership begins, and both private and public parties have to live up to their responsibilities. PPP contracts attempt to identify and plan for the potential events that could occur during the life of the PPP but can rarely imagine all events into the future. Consequently, developing a strong and trustful partnership and a solid contract management approach is important to achieve the long-term objectives of the PPP. This stage spans the life of the PPP agreement beginning when the PPP contract is signed until the partnership ends. This module presents the fundamentals and challenges of contract management, enforcing the PPP contract requirements and, potentially, renegotiating or terminating contracts. \n\n \n\nCourse Tracks\n\nParticipants can participate in one of two tracks:\n\n\n\nTrack 1: PPP Awareness (2 hours\/week).\nTrack 2: Policy and Practice (3-4 hours\/week).\n\nParticipants can move from the PPP Awareness track to the Policy and Practice track at any point during the course. \n\nWe encourage participants to join the Policy and Practice track to deepen their knowledge of the subject.\n\nTrack 1 – PPP Awareness\n \n\nTarget Audience\nThis track is suitable for anyone with a general interest in PPPs and desire to increase their understanding about PPPs.  The course provides insight into key concepts and issues in developing, procuring and implementing PPPs. \n \nCommon Objective\nTo understand PPPs and their role in increasing the delivery of quality infrastructure services.\n\nAssignments\n\nAssignments focus on facilitating an understanding of the mandatory course material that is covered in the video talks and core readings through multiple choice quizzes and one peer-reviewed opinion piece on a key topic about PPPs.\n\nTrack 2 – Policy and Practice\n \n\nTarget Audience\nThis track is designed for those wishing to gain greater knowledge of PPPs, and to develop networks of practice with counterparts from around the world. While this course only touches the surface of knowledge and experience about PPPs, references and next steps will be offered for those wishing to continue their learning. \n \n\nCommon Objective \nTo understand PPPs and their role in increasing the delivery of quality infrastructure services.\n\n\nAssignments\nIn additional to multiple choice quizzes and the Track 1 assignment, this track includes a project where participants identify an infrastructure project that could be developed as a PPP and create a digital artifact that can be used as a proposal to convince the government to undertake the project. The digital artifact should clearly articulate the value of the project to the government (and for its citizens) and demonstrate how the project would have a balanced risk allocation between the government and the private sector.\n\n Connect\n\nCommunicate and share resources via Twitter using #PPPMOOC, and follow the discussion @WBG_PPP. \n\nSign up for a free account at http:\/\/twitter.com.",
    "effort": "2-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/effectiveppp",
    "title": "Public-Private Partnerships (PPP): How can PPPs help deliver better services?",
    "courseraId": "2786",
    "subjects": "Engineering"
}