{
    "description": "Quantum computation is a remarkable subject building on the great computational discovery that computers based on quantum mechanics are exponentially powerful. This course aims to make this cutting-edge material broadly accessible to undergraduate students, including computer science majors who do not have any prior exposure to quantum mechanics. The course starts with a simple introduction to the fundamental principles of quantum mechanics using the concepts of qubits (or quantum bits) and quantum gates. This treatment emphasizes the paradoxical nature of the subject, including entanglement, non-local correlations, the no-cloning theorem and quantum teleportation. The course covers the fundamentals of quantum algorithms, including the quantum fourier transform, period finding, Shor's quantum algorithm for factoring integers, as well as the prospects for quantum algorithms for NP-complete problems. It also discusses the basic ideas behind the experimental realization of quantum computers, including the prospects for adiabatic quantum optimization and the D-Wave controversy.\n\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\nDo I need a textbook for this class?\nNo. Notes will be posted each week. If you wish to consult other references, a list of related textbooks and online resources will be provided.\n\nWhat is the estimated effort for course?\nAbout 5-12 hrs\/week.\n\nWhy is the work load range so wide?\nHow long you spend on the course depends upon your background and on the depth to which you wish to understand the material. The topics in this course are quite open ended, and will be presented so you can understand them at a high level or can try to follow it at a sophisticated level with the help of the posted notes.\n\nHow much does it cost to take the course?\nNothing! The course is free.\n\nWill the text of the lectures be available?\nYes. All of our lectures will have transcripts synced to the videos.\n\nDo I need to watch the lectures live?\nNo. You can watch the lectures at your leisure. How to understand the fundamental principles of quantum mechanics using the concepts of qubits (or quantum bits) and quantum gates\n\tThe basics of quantum algorithms such as the quantum fourier transform, period finding, Shor's quantum algorithm for factoring integers, and the prospects for quantum algorithms for NP-complete problems\n\tThe ideas behind the experimental realization of quantum computers",
    "instructors": "Umesh V. Vazirani",
    "requirements": "A strong background in basic linear algebra, including vectors, matrices, complex numbers, inner products, eigenvalues and eigenvectors (a simple diagnostic quiz will help you assess your background). Mathematical maturity and familiarity with ideas of computer science such as big-Oh notation, algorithms and how to bound the running time of an elementary algorithm.\n\nOnce you have registered, you can access our simple optional diagnostic quiz and based on your answers you will be pointed to online resources that you can use to brush up on your background knowledge.",
    "length": "9 weeks",
    "effort": "About 5-12 hrs\/week.",
    "prices": "Free",
    "institutions": "UC BerkeleyX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/quantum-mechanics-quantum-computation-uc-berkeleyx-cs-191x",
    "title": "Quantum Mechanics and Quantum Computation"
}