{
    "description": "This short course teaches students and industry professionals how to design integrated optical devices and circuits, using a hands-on approach with commercial tools. We will fabricate your designs using a state-of-the-art ($5M) silicon photonic rapid-prototyping 100 keV electron-beam lithography facility. We will measure your designs using an automated optical probe station and provide you the data. You will then analyze your experimental data.\n\nWhy take this course?\n\nTo get hands on design experience with integrated optics\n\tTo learn how to use advanced optical design tools\n\tTo get your design fabricated, and obtain experimental data\nThe focus of this course is a design project, guided by lectures, tutorials and activities. As a first-time designer, you will design an interferometer, which is a widely used device in many applications such as communications (modulation, switching) and sensing. Specifically, it is Mach-Zehnder Interferometer, consisting of fibre grating couplers, two splitters, and optical waveguides. For advanced designers, this course is an opportunity to design many other devices, such as directional couplers, ring, racetrack and disk resonators, Bragg gratings including grating assisted contra-directional couplers, photonic crystals, multi-mode interference (MMI) couplers, polarization diversity components, mode-division multiplexing (MDM) components and circuits, novel waveguides such as sub-wavelength grating (SWG) and metamaterial waveguides, slot waveguides, etc.\n\nCommercial software tool licenses are provided in this course (Lumerical Solutions, Mentor Graphics, and MATLAB). Open-source alternatives are provided. Mentor Graphics tools are accessed remotely via a cloud service; the others can be run on your own computer.\n\nYou will earn a professional certificate from the University of British Columbia and edX upon successful completion of this course. Certificates can be uploaded directly to your LinkedIn profile.\n\nFAQ\n\nDo I need to buy a textbook?\n\nThe notes, videos and exercises are all sufficient to complete this course. The textbook is optional. Included in the course are several key chapters from the book \"Silicon Photonics Design\", by Lukas Chrostowski and Michael Hochberg, published by Cambridge University Press. The full version (ebook or hardcopy) is available for purchase at www.cambridge.org\/9781107085459.\n\nWhat are the fabrication details? \n\nYour devices will be fabricated on a Silicon on insulator (SOI) wafer with 220 nm silicon thickness, with a minimum isolated feature size of 60 nm. Each participant is allocated 410 µm x 605 µm of space, enough for >10 devices each (more available on request). One chip is being manufactured and measured for this course, and the measurement data will be provided to the course participants. \n\nWho will be doing the fabrication and measurements?\n\nThe fabrication will be performed by Richard Bojko, at the University of Washington, Nanofabrication Facility. The measurements will be performed by the team of Lukas Chrostowski, at The University of British Columbia.\n\nWill I be getting a physical chip in the mail?\n\nNo. Only one chip is being manufactured for this course, and the measurements will be performed at UBC. The measurement data will be provided to the course participants.\n\nAre there opportunities for fabrication beyond this course, including getting chips in the mail?\n\nYes. Either after, or during the course, you can purchase an entire chip. It will be sent to you directly. Optionally we can perform automated testing for you prior to sending it out. We typically do fabrication runs every two months. Additional options obtaining your own chips (EBeam or MPW foundries) will be discussed in the course.\n\nDo you have any advanced silicon photonics courses, and what can I take after Phot1x?\n\nYes. We offer advanced courses on silicon photonics, including on-site hands-on workshops on Passive silicon photonics (ring resonators, grating couplers, Bragg gratings, etc); Active silicon photonics (modulators, detectors); CMOS electronics for photonics; and Systems, Integration and Packaging. All these workshops include fabrication via MPW foundries. More details can be found at http:\/\/siepic.ubc.ca. Phot1X is a good background course for the above workshops. Optical modelling tools\n\tMask layout tools\n\tDesign of optical devices and circuits\n\tData analysis techniques",
    "instructors": "Lukas Chrostowski",
    "requirements": "No background with integrated optics is assumed.\n\nBackground in conventional optics is beneficial, for example a 2nd year undergraduate optics course, or an undergraduate electromagnetics course.",
    "length": "7 weeks",
    "effort": "3-8 hours\/week",
    "institutions": "UBCx",
    "subjects": "Engineering",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/silicon-photonics-design-fabrication-ubcx-phot1x-0",
    "title": "Silicon Photonics Design, Fabrication and Data Analysis"
}