{
    "description": "THIS COURSE IS CREATED FOR ONE SIMPLE PURPOSE :\nTo help you use and understand the basic functions and fundamentals of Sketch 3! Sketch gives you the power, flexibility and speed you always wanted in a lightweight and easy-to-use package. Finally you can focus on what you do best: Design.\nWhether you are - A total newbie on UI ans UX Design and clueless on how to get started:\nYou will gain a solid foundation on the WHATs and HOWs to designing Mobile Apps, User Interfaces and a whole lot more! This is a structured course that teaches you a systematic way to design and use Sketch that will save you years of time figuring things out on your own. \nAbout this course\nOver 10+ Lectures and 1 Hour of Content\nFull, free lifetime access\nAll future extra lectures and upgrades are always included for free\n30 day money-back guarantee -- my personal promise to your success!\nMonthly BONUS Lectures to enhance your Design Skills!\n24\/7 Instructor Chat Support -- I will personally help you\nAfter taking this course, you'll be able to...\nDesign Your Own Mobile Apps from Scratch using Sketch 3\nBuild A Working Mobile App Prototype that you can show to everyone!\nLearn How To Design Using Sketch 3 -- No Experienced needed!\nLearn UI\/UX Design Principles\nBuild Practice Mockups and Templates to enhance your design skills\nBy enrolling in this course, you will also receive support from me and I will be personally answering your questions in the student discussion area.\nIf you are willing to learn and put in the effort to implement what I teach you in this course, go ahead now and click the big blue button at the top to enroll yourself and start experiencing the results for yourself!\nI look forward to hear your personal success story and I'll see you on the other side!",
    "instructors": "Benjo Sabban",
    "url": "https:\/\/www.coursetalk.com\/providers\/skillshare\/courses\/sketch-3-mobile-app-design-ui-ux-design",
    "title": "Sketch 3 - Mobile App Design (UI & UX Design)",
    "language": "en",
    "source": "coursetalk"
}