{
    "description": "In the third edition of Solar Energy, you will learn to design a complete photovoltaic system. This course introduces the technology that converts solar energy into electricity, heat and solar fuels with a main focus on electricity generation. Photovoltaic (PV) devices are presented as advanced semiconductor devices that deliver electricity directly from sunlight. The emphasis is on understanding the working principle of a solar cell, fabrication of solar cells, PV module construction and the design of a PV system. You will gain a greater understanding of the principles of the photovoltaic conversion— the conversion of light into electricity. This course explores the advantages, limitations and challenges of different solar cell technologies, such as crystalline silicon solar cell technology, thin film solar cell technologies and the latest novel solar cell concepts as studied on lab-scale. We will discuss the specifications of solar modules and demonstrate how to design a complete solar system for any particular application.\n\nEducation Method\n\nThe class will consist of a collection of eight to twelve minute lecture videos, exercises, assignments and exams. Specified assignments and the three exams will determine the final grade. The new textbook on “Solar Energy, basics, technology and systems” from the Delft University of Technology will be available for the students on-line and free of charge. Your course staff will encourage and challenge you to learn from, and interact with, your fellow students by helping each other and sharing ideas and best practices, in the course forum. We were happy to see the incredible number of interesting student videos on solar energy systems from all over the world in the previous edition of this course. \n\nLICENSE\n\nThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License. The various methods of converting solar energy into electricity, heat and solar fuels\n\tThe physical working principles of photovoltaic conversion in solar cells\n\tHow to recognize and describe the various solar cell technologies, their current status and future technological challenges\n\tHow to analyze the performance of solar cells and modules\n\tHow to design a complete photovoltaic system for any particular application on paper",
    "contents": "Course Syllabus\n        Week 1\n\t\t\tIntroduction to Solar Energy\n\t\t\tAssignments 1\n\t\tWeek 2\n\t\t\tWorking Principle of a Semiconductor based Solar Cell\n\t\t\tAssignments 2\n\t\tWeek 3\n\t\t\tSolar Cell Operation, Performance and Design Rules\n\t\t\tExam 1\n\t\tWeek 4\n\t\t\tPV technology Based on Crystalline Silicon Wafers\n\t\t\tAssignments 3\n\t\tWeek 5\n\t\t\tThin-Film PV technologies\n\t\t\tAssignments 4\n\t\tWeek 6\n\t\t\tThird Generation PV and Other Ways to Utilize Solar Energy\n\t\t\tExam 2\n\t\tWeek 7\n\t\t\tPV Systems-Components and Concepts\n\t\t\tAssignments 5\n\t\tWeek 8\n\t\t\tPV Systems- Application and Design\n\t\t\tExam 3",
    "instructors": "Arno Smets",
    "requirements": "Basic knowledge of physics and mathematical skills such as integration and differentiation are preferred.",
    "length": "8 weeks",
    "effort": "8 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "DelftX",
    "subjects": "Electronics",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/solar-energy-delftx-et3034x",
    "title": "Solar Energy"
}