{
    "source": "Coursera",
    "description": "As a human being, we all consume products and\/or services all the time. This morning you got up and ate your breakfast, e.g., eggs, milk, bread, fresh fruits, and the like. After the breakfast, you drove your car to work or school. At your office, you used your computer, perhaps equipped with 27” LCD monitor. During your break, you drank a cup of coffee and played with your iPhone. So on and so forth. You probably take it for granted that you can enjoy all of these products. But if you take a closer look at how each of these products can be made and eventually delivered to you, you will realize that each one of these is no short of miracle. For example, which fruit do you like? Consider fresh strawberries. In order for the strawberries to be on your breakfast table, there must be numerous functions, activities, transactions, and people involved in planting, cultivating, delivering, and consuming strawberries. Moreover, all of these functions, activities, transactions, and people are connected as an integral chain, through which physical products like strawberries themselves and virtual elements such as information and communication flow back and forth constantly. By grouping related functions or activities, we have a supply chain, comprised of four primary functions such as supplier, manufacturer, distributor, and finally consumer. A supply chain is essentially a value chain.&nbsp;For the society or economy as a whole, the goal is to maximize value, i.e., to create satisfactory value without spending too much. In order to create the maximum value for the strawberry supply chain, every participant in the chain must carry out its function efficiently. In addition, all of the members must coordinate with each other effectively in order to ensure value maximization. We have to face the same issues for almost all the products and services we take for granted in our everyday life, e.g., cars, hamburgers, haircuts, surgeries, movies, banks, restaurants, and you name it!&nbsp;In this course, we want to understand fundamental principles of value creation for the consumers or the market. We try to answer questions like how the product or service is made, how the value-creating activities or functions are coordinated, who should play what leadership roles in realizing all these, and so on. As our course title hints, we approach all of these issues from a learning perspective, which is dynamic in nature and emphasizes long-term capability building rather than short-term symptomatic problem solving.&nbsp; Learn about how to create maximum value through effective supply chain management, in particular, from a dynamic learning perspective.",
    "contents": "Week 1 - Introduction to value, value creation, and supply chain managementValue, value creation, supply chain management; Efficiency-driven and responsiveness-driven value; Focal company in supply chain management; Value life cycle.Week 2: Management capabilitiesDefinition of management capability; Controllability, flexibility, and tradeoff between capabilities; Integrating capability; Dynamic changes of capability.Week 3: Learning perspectiveDefinition of learning, learning capability; Double-loop and single-loop learning; Cause-and-effect diagram; Learning propensity model.Week 4: Quality managementQuality is free?; Dimensions of quality; Order-qualifying versus order-winning attributes; Assignable versus common causes; Principles of statistical process control.Week 5: New product innovationSequential new product development process; Flexible or cross-functional new product development process; Implementation strategy; Integration with supply chain management.Week 6: Supply chain strategy I: structural and infrastructural dimensionsStructural dimension; Infrastructural dimension; Minimization of mismatch between supply and demand; Information quality.Week 7: Supply chain strategy II: coordination for value creationSupply chain coordination; Bullwhip effect; Postponement; Vendor-managed inventory (VMI).Week 8: Supply chain globalization and sustainabilityGlobal supply chain management; Scale, scope, and speed in global SCM; Sustainable SCM; Calculus, creativity, and commitment.",
    "requirements": "No background is required.",
    "effort": "2-3 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/supplychain",
    "title": "Supply Chain Management: A Learning Perspective ",
    "courseraId": "1663",
    "subjects": "Information, Tech & Design"
}