{
    "source": "Coursera",
    "description": "The purpose of this course is to help individuals and organizations\nsurvive when confronted with disruptive technologies that threaten their\ncurrent way of life.&nbsp; We will look at a\ngeneral model of survival and use it to analyze companies and industries that\nhave failed or are close to failing.&nbsp; Examples\nof companies that have not survived include Kodak, a firm over 100 years old,\nBlockbuster and Borders.&nbsp;&nbsp; It is likely\nthat each of us has done business with all of these firms, and today Kodak and\nBlockbuster are in bankruptcy and Borders has been liquidated.&nbsp; Disruptions are impacting industries like\neducation; Coursera and others offering these massive open online courses are a\nchallenge for Universities.&nbsp; In addition\nto firms that have failed, we will look at some that have survived and are\ndoing well.&nbsp; What are their strategies\nfor survival?\n\nBy highlighting the reasons for the decline of firms and\nindustries, participants can begin to understand how to keep the same thing\nfrom happening to them.&nbsp;&nbsp; Through the\nstudy of successful organizations, we will try to tease out approaches to\ndisruptions that actually work.&nbsp; Our\nultimate objective is to develop a strategy for survival in a world confronting\none disruptive technology after another.  The purpose of this course is to help participants and the organizations they encounter survive the waves of technological disruptions facing business, government, education and their daily lives.",
    "contents": "1. Survival: a simple model of the incumbent’s\ndilemma of how to respond to a potentially disruptive technology .2. Kodak misses its moment: the story of Kodak and\nhow, after inventing the digital camera, it failed to understand how it and the\nInternet changed the process of capturing and sharing images.3. Blockbuster vs Netflix.&nbsp; How could a leading company fail to respond\nto a clearly defined threat from a new competitor?4. Borders:&nbsp;\nwas the company asleep when Amazon came along and disrupted book sales,\npublishing and reading?5. The three amigos: what can we learn from Kodak,\nBorders and Blockbuster as a group of failed companies?6. Can I borrow your paper?&nbsp;&nbsp; How the Internet has savaged one of our\noldest types of media leading to the slow death of newspapers.7. Books and Publishers:&nbsp; trying to maintain two business models at\nonce.8. Education: the industry that moves at a glacial\npace faces radical innovation from non-profits to Coursera.9. Dictators: probably not a promising occupation\ngiven social media-how the Arab spring changed a profession.10. Risky business-are innovations in technology\nencouraging us to engage in too much risky business?11. Moving things: will the USPS disappear?&nbsp; How can it compete with UPS and FedEx?12. Some survivors:&nbsp;\na few have managed to incorporate disruptive technologies into their\nlives and to flourish, at least for now.13.&nbsp; Danger ahead: what new disruptions are on the\nhorizon and who will be disrupted?14. Strategies for survival: suggestions on&nbsp; how to deal with disruptive technologies and\nturn them into a successful innovation",
    "requirements": "The course should appeal\nmost to participants who have at least a general interest in new technologies\nand in the economy.&nbsp; It would be helpful\nfor you to following the general business press including web sites or print\nmedia of periodicals like The New York\nTimes, the Wall Street Journal, Bloomberg’s\nBusinessWeek, IEEE Spectrum, Technology Today and similar information\nsources.",
    "effort": "2-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/sdt",
    "title": "Surviving Disruptive Technologies",
    "courseraId": "268",
    "subjects": "Information, Tech & Design"
}