{
    "source": "Coursera",
    "description": "Sustainability is defining a generation of students and young professionals and their influence is transforming things like cities, companies, and laws around the world. Sustainability is often explained as meeting “the needs of the present without compromising\n    the ability of future generations to meet their own needs.” In practice, this means understanding connections, including connections across time. These connections create systems that are greater than the simple sums of their parts, with consequences\n    that are often unexpected by people paying attention to only one part of a system. This course provides an introduction to the ideas and practices that people are using to understand and change these connections in pursuing more sustainable processes,\n    communities, environments, and organizations.&nbsp;\n\nSystems theory appears in many guises and most disciplines claim some share of the systems approach to connections and consequences. In ways that we will explore in the course, design thinking is a method for putting systems theory into practice. Designers\n    and their way of thinking provide a significant contribution to sustainability in practice, from improving energy performance in buildings to identifying the value ecosystems services provide to human settlements. This course has several strategic\n    partners providing us with content and with platforms for discussion. These networks will provide the course with an extensive and diverse portfolio of problems, solutions, illustrations, and challenges with which to explore the ideas presented above.\n    We will use these very different venues as platforms for discussion and will organize student conversations and assignments using the network partners. &nbsp; &nbsp;&nbsp; Sustainability is a practice operating across a variety of scales and skills. We will explore the ways that decision makers use systems analysis and design thinking to confront the career-defining challenges facing the next generation of  leaders. Networks of practice from across North America and around the globe will provide case material and guest lectures. ",
    "contents": "Week 1:\nCONNECTIONS&nbsp; What is sustainability? Links between sustainability and earlier ideas. Who does it, why, and how? Examples of how sustainability is used as by governments and enterprises. What is a system? Illustrations of parts, linkages, feedbacks,\n    and leverage points.&nbsp;What is design thinking? &nbsp;&nbsp;\n    \n\n\nWeek 2:\nACCOUNTING What is an efficient allocation of resources? What are the consequences of mis-allocating resources? Examples of externalities, commons problems, and cognitive bias. Discussion of lifecycle costs, behavioral influence, and aligning incentives.\nWeek 3:\nRESILIENCE What is the relationship between mitigation of and adaptation to challenges to sustainability? What makes a system more and less resilient? How are people making cities and companies and landscapes more resilient in the face of challenges\n    such as sea-level rise or energy scarcity or food security?&nbsp;&nbsp;\n\n\nWeek 4:\nEMERGENCE Resource efficiency and system integrity seek to balance flows over time. What is emergence? How does design thinking generate productive emergence and what strategies exist for anticipating and responding to emergent threats?\n    \n\n\nWeek 5:\nJURISDICTION Who decides when resources have been accounted for, if a system is resilient enough, or whether an emerging trend is a threat or opportunity? At what scale and over what questions will such decisions be made?\n    \n\n\nWeek 6:\nPERFORMANCE Even once sustainable outcomes are legitimized into goals and decided on through commitments, how are these outcomes achieved? How would we know? Discussion of competitions and incentives, measurement and management, and new methods of\n    regulating performance and compliance.\n    \n\n\nWeek 7:\nDISRUPTION How are existing roles and professions being disrupted by the demands of sustainability? Discussion of big data, simplifying system complexity, and the adaptation of legacy assets to new purposes.\n    \n\n\nWeek 8:\nCONNECTIONS Summary of discussions and of emerging questions. Evaluate the claim that sustainability in practice is about using design thinking to understand and manipulate systems.",
    "effort": "2-5 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/sustaininprac",
    "title": "Sustainability in Practice",
    "courseraId": "680",
    "subjects": "Information, Tech & Design"
}