{
    "description": "XSeries Program Overview\n\nThis XSeries presents a programming method that will enable you to produce well-structured programs — programs that tell a clear story about what they do, are well tested, and are easy for others to improve. This series differs from other online programming courses by focusing on a general design method, rather than how to program in a specific language.\n \nThe approach is practical and hands on; most of your work in these courses will consist of you writing programs using the design method. Part 1 begins with simple programs, which many programmers could easily write without using the design method. By the end of Part 1 you will have learned the core of the design method, and will be ready to apply it to more challenging problems. In Part 2 you will learn about more elaborate forms of data and you will begin to learn how to independently expand your understanding of the design method. And in Part 3, you will apply the design method to programs that would challenge even experienced programmers.\n \nThe series is designed for beginners who have never programmed before. But at the same time, many experienced programmers have taken these courses, and reported that it made them better programmers. So you can take these courses as an introduction to programming, or later in your career to enhance your skills.\n\nThis is a series of 3 courses that are best taken in order. If the current start dates are inconvenient, please check back often as they are always being added. \n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about Systematic Program Design\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Learn the foundations of how to code well - writing programs that tell a clear story about what they do, are tested, and easy to improve. Adding abstraction and generative recursion to the design tools makes complex problems like puzzle solvers and graph search straightforward. Build on the core design method from Part 1 to learn how to easily program with more complex data like lists and trees.",
    "instructors": "Gregor Kiczales",
    "length": "5 weeks\/course",
    "effort": "5 hours\/week",
    "prices": "$50\/course",
    "institutions": "UBCx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/systematic-program-design-0"
}