{
    "description": "Mobile technologies and networks are increasingly expanding in their\nsophistication and capacity, and new applications are enhancing the ways in\nwhich individuals interact and engage in transactions- resulting in widespread\nsystems disruption.  In global health, mobile technologies are beginning to\nshow improvements in access to health services and information, quality of\ncare, and efficiency, yielding time and cost savings in addressing maternal\nand child health, HIV and AIDS, malaria, TB, universal access to health care,\nand other health issues.  Increasingly, Ministries of Health, industry, NGOs,\nand various bi-lateral and multi-lateral donors and organizations are looking\ntoward mobile phones as a critical element within their strategies for\nimproving health outcomes and well-being.  Many have expressed great interest\nin becoming better informed consumers and implementers of mHealth.\n\nTo support this demand, TechChange and the mHealth Alliance are pleased to\nannounce a four-week online certificate course on mHealth: Mobile Phones for\nPublic Health. The two organizations have partnered to provide the course\nbased on the pervasive interest in the topic of mobile health (mHealth) as\nwell as the need to develop more skills and exchange of best practices among\npractitioners in the sector.\n\nThe Mobile Phones for Public Health course will examine how mobile\ntechnologies are revolutionizing approaches to patient care and management,\npoint-of-care support for health workers, health education, diagnostics, and\nsupply chain management and logistics. Through case studies, guest expert\ninterviews, multimedia tutorials, interactive exercises, and live\ndemonstrations of tools, participants will explore delivery mechanisms, such\nas interactive voice recognition (IVR),  SMS (text message) communication\nprograms, smartphone applications, and health information systems for data\ncollection and management. The course aims to present a broad range of\nperspectives on mHealth, including those from to governments, private sector,\nacademia, NGOs, and bilateral and multi-lateral organizations and donors from\nAfrica, Asia, and Latin America.",
    "instructors": "Kendra Keith",
    "url": "https:\/\/www.coursetalk.com\/providers\/techchange\/courses\/tc309-mhealth-mobile-phones-for-public-health",
    "title": "TC309: mHealth - Mobile Phones for Public Health",
    "language": "en",
    "source": "coursetalk"
}