{
    "description": "3D printing is primed to change our physical world. Twenty years after the\nInternet and cell phones fundamentally changed how humans communicate with\neach other and exchange information, this new technology is set to\nrevolutionize the way that we make products by bringing factory to the people\nand ushering in a new era of innovation and creativity in manufacturing.\n\nAs 3D printers become more sophisticated and affordable and a number of\npatents expire, their potential to assist in response to global development\nand humanitarian challenges increases dramatically. Already 3D printers have\nbeen used to print low-cost soft-tissue prosthetics and medical supplies like\ncustomized tracheal valves, umbilical cord clamps, and splints. Efforts are\nunderway to make it possible to print things like solar panels, greenhouses,\ndental implants, and more.\n\nThis four-week online certificate course will explore case studies across a\nrange of sectors from disaster response to health, to agriculture, and energy.\nIt will attempt to address questions like: can 3D printing truly provide\nsignificant reductions in supply chain time and costs? How might it be\nintroduced inclusively into communities so as not to augment the digital\ndivide? How long before it can effectively benefit the world’s most\nmarginalized individuals?\n\nThe course will provide a basic introduction to the technical fundamentals of\n3D printing and assist you in connecting with local maker spaces and 3D\nprinting communities in your country. It will also consider various obstacles\nto adoption including: supply chain challenges, insufficient electricity and\ninternet coverage; and legal issues related to intellectual property. All\nTechChange online courses provide a unique hands-on learning environment with\nanimated videos, technology demos, practical activities, networking events,\nimmersive simulations and more.",
    "instructors": "",
    "url": "https:\/\/www.coursetalk.com\/providers\/techchange\/courses\/tc344-3d-printing-for-social-good",
    "title": "TC344: 3D Printing for Social Good",
    "language": "en",
    "source": "coursetalk"
}