{
    "source": "Coursera",
    "description": "While the primary aim of this course is to prepare high school teachers for teaching descriptive statistics, this course will enable any global citizen to understand the basic descriptive statistics presented by the media from breakfast to bedtime. Descriptive statistics, as the name implies, refers to the describing or summarizing of a set of data using graphics and number summaries. This course covers descriptive statistics for a single variable and for the relationship between two variables. Core principle videos will cover the statistical content, while satellite videos will discuss pedagogy, teaching resources, and analyzing data using JMP software.  These satellite videos will present concepts via examples spanning pop culture, sports, youth, and other topics suitable for high school classrooms. We prepare high school teachers for teaching descriptive statistics. Teachers will learn basic principles for summarizing data in meaningful ways. Satellite videos will discuss pedagogy and teach statistical software via examples spanning pop culture, sports, health and other topics suitable for high school classrooms.",
    "contents": "This class is taught in three units over 5 weeks\n\nGetting\n     started with data (1 week)Single\n     variable graphics and number summaries (1 week)Graphics\n     and number summaries describing the relationship between two variables (2\n     weeks)Review (1 week)\n\nThe full list of topics are as follows:\n\nUnit 1, Getting Started with Data01_01\n     Introduction01_02\n     Data, Variables, Unit of Observation\/Analysis \n\nUnit 2, Single Variable Description02_01\n     Graphics:&nbsp; Histogram, Boxplot02_02\n     Number Summaries: Center 02_03\n     Number Summaries: Spread02_04\n     Transformation and Standardization 02_05\n     Bell-shaped Curves \n\nUnit 3, Describing Relationships Between\nTwo Variables03_01\n     Two Categorical Variables: Mosaic Plots 03_02\n     Two Categorical Variables: Contingency Tables03_03\n     One Categorical, One Numeric Variable: Side by Side Boxplots03_04\n     Two Categorical Variables: Correlation03_05\n     Two Numeric Variables: Regression03_06:03_09&nbsp; Review of entire course\n\n",
    "effort": "5-8 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/teachstats1",
    "title": "Teaching Statistical Thinking: Part 1 Descriptive Statistics",
    "courseraId": "1809",
    "subjects": "Statistics and Data Analysis"
}