{
    "source": "Coursera",
    "description": "We are part of the 'TechniCity'. The increasing availability of\nnetworks, sensors and mobile technologies allows for new approaches to\naddress the challenges that our cities face. The way we understand cities\nis undergoing sweeping transformation, right along with the analytical\ntools we use to design our cities and the communication tools we use to\nengage people. Absorbing, studying and understanding the role of technology\nfrom a critical viewpoint allows us to generate creative ideas for improving\nour cities. \n\nThis course begins by examining how our cities are changing. We then jump\ninto how technology is used to engage with the public to support decision-making and the creative ways that every-day people are using technology to improve their cities.  \nStudents will be examining tools for analyzing the city. Then we move into exploring the fascinating ways that cities are using real-time, technology. You'll hear from technological innovators and thought leaders about all of these topics. You will get to engage around a topic you are most interested in to create a project in your own city. We live in real-time, technologically enhanced cities. Explore the sweeping changes that our cities are undergoing as a result of networks, sensors, and communication technology.",
    "contents": "Week One -&nbsp;Foundations of the&nbsp;TechniCity\n\nUnderstand the foundations of the TechniCity and what it means to be a city planner.Week Two -&nbsp;Infrastructure for the&nbsp;TechniCityYou'll learn how sensors and networks are transforming our cities.&nbsp;Week Three -&nbsp;Engaging the&nbsp;TechniCity\n\nThrough social networking and crowdsourcing platforms you'll learn how to engage in city building.Week Four -&nbsp;Entrepreneurial Urbanism&nbsp;You'll\nexplore how open data initiatives, hack-a-thons, and urban prototyping\nfestivals are creatively innovating our cities.\nWeeks Five &amp; Six -&nbsp;Analyzing the&nbsp;TechniCityFrom&nbsp;sentiment&nbsp;analysis to mashups, you'll experiment with analyzing data.Week Seven –&nbsp;Leading TechniCities&nbsp;Explore how cities across the globe are using Technology to advance their future.Week Eight-&nbsp;The Future of the TechniCity&nbsp;You'll engage in peer evaluation of your fellow classmates projects and participate in lively discussion around the future of the TechniCity.",
    "requirements": "While there is no specific prerequisite knowledge to take this course,\nthis course is targeted for students at an upper undergraduate or graduate\nlevel of education. This course is accessible to non-technical students.\nThe final project will be structured to allow all participants to creatively\nengage their wide ranging skills, whether they be technical or non-technical.\n",
    "effort": "6-8 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/techcity",
    "title": "TechniCity",
    "courseraId": "304",
    "subjects": "Information, Tech & Design"
}