{
    "description": "The knowledge base of the world is rapidly expanding, and much of this information is being put online as textual data. Understanding how to parse and analyze this growing amount of data is essential for any organization that would like to extract valuable insights and gain competitive advantage. This course will demonstrate how text mining can answer business related questions, with a focus on technological innovation. \n\nThis is a highly modular course, based on data science principles and methodologies. We will look into technological innovation through mining articles and patents and implement natural language processing. We will also utilize other available sources of competitive intelligence, such as the gray literature and knowledge bases of companies, news databases, social media feeds and search engine outputs. Text mining will be carried out using Python, and could be easily followed by running the provided iPython notebooks that execute the code.\n\nFAQ\n\nWho is this course for?\n\nThe course is intended for data scientists of all levels as well as domain experts on a managerial level. Data scientists will receive a variety of different toolsets, expanding knowledge and capability in the area of qualitative and semantic data analyses. Managers will receive hands-on oversight to a high-growth field filled with business promise, and will be able to spot opportunities for their own organization. You are encouraged to bring your data sources and business questions, and develop a professional portfolio of your work to share with others. The discussion forums of the course will be the place where professionals from around the world share insights and discuss data challenges.\n\nHow will the course be taught?\n\nThe first week of the course describes a range of business opportunities and solutions centered around the use of text. Subsequent weeks identify sources of competitive intelligence, in text, and provide solutions for parsing and storing incoming knowledge. Using real-world case studies, the course provides examples of the most useful statistical and machine learning techniques for handling text, semantic, and social data. We then describe how and what you can infer from the data, and discuss useful techniques for visualizing and communicating the results to decision-makers. \n\nWhat types of certificates does DelftX offer?\n\nUpon successful completion of this course, learners will be awarded a DelftX Professional Education Certificate.\n\nCan I receive Continuing Education Units?\n\nThe TU Delft Extension School offers Continuing Education Units for this course. Participants of TXT1x who successfully complete the course requirements will earn a Certificate of Completion and are eligible to receive 2.0 Continuing Education Units (2.0 CEUs)\n\nHow do I receive my certificate and CEUs?\n\nUpon successful completion of the course, your certificate can be printed from your dashboard. The CEUs are awarded separately by the TU Delft Extension School.\n\n \n\nLICENSE\nThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License. Apprehend the value of mining content in advancing the strategic opportunities of the organization. \n\tAppraise a variety of textual sources of intelligence, and match the content to your business needs.\n\tManage enterprise data in a format which can be cleanly read, updated, and reported upon.\n\tSelect appropriate modelling methods for analyzing textual data.\n\tEvaluate the suitability, accuracy and generalizability of your model.\n\tDraw inferences from your text content, generating actionable business intelligence.\n\tFind and communicate the message in your data.\n\tImplement a range of appropriate data visualizations in Python.\n\tAchieve a tight, design-oriented fit for integrating text mining solutions with business needs.\nThe course uses iPython notebook, which runs interactive workbooks right in your own browser. In each week we pre-provide a series of recipes for solving common text mining problems. Use our recipes directly, or use them as a basis for creating solutions to your own business intelligence needs. Amongst the many Python libraries used and discussed in the course there are BeautifulSoup, a leading solution for web scraping; Twitter, an interface to the Twitter data feed; and matplotlib, a library for building effective data visualizations. \n\nWatch a sneak preview of the course where Scott Cunningham introduces week 3 and discusses how text mining of patents can get you a competitive edge (taking Apple as an example).",
    "instructors": "Scott Cunningham",
    "requirements": "The course does not require a background in programming, and can be followed by using the provided iPython notebooks. However the course does assume that participants are comfortable with rigorous thinking and not intimidated by mathematical and programming-related concepts.",
    "length": "6 weeks",
    "effort": "4 - 6 hours\/week",
    "institutions": "DelftX",
    "subjects": "Data Analysis & Statistics",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/text-mining-analytics-delftx-txt1x",
    "title": "Text Mining and Analytics"
}