{
    "description": "The Beauty and Joy of Computing (BJC) is a computer science principles course developed at the University of California, Berkeley, intended to broaden participation in computing to non-traditional groups. Computing has profoundly changed the world, opening up wonderful new ways for people to connect, design, research, play, create, and express themselves. However, just using a computer is only a small part of the picture. The real transformative and empowering experience comes when one learns how to program the computer, to translate ideas into code.\n\nThis course teaches students how to do exactly that, using Snap! (based on Scratch), one of the friendliest programming languages ever invented. It's purely graphical, which means programming involves simply dragging blocks around, and building bigger blocks out of smaller blocks. But this course is far more than just learning to program. We focus on seven big ideas (creativity, abstraction, data and information, algorithms, programming, the Internet, and global impact), and six computational thinking practices (connecting computing, creating computational artifacts, abstracting, analyzing problems and artifacts, communicating, and collaborating). Throughout the course, relevance is emphasized: relevance to the student and to society. This fun, introductory course is not just for computer science majors, it’s for everyone… join us!\n\nLearn more about our High School and AP* Exam Preparation Courses The basics of computer programming using Snap!\n\tHow to apply the \"seven big ideas\" of creativity, abstraction, data and information, algorithms, programming, the Internet, and global impact\n\tHow to master the six computational thinking practices of connecting computing, creating computational artifacts, abstracting, analyzing problems and artifacts, communicating, and collaborating",
    "instructors": "Dan Garcia",
    "requirements": "None.",
    "length": "8 weeks",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "UC BerkeleyX",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/beauty-joy-computing-cs-principles-part-uc-berkeleyx-bjc-3x",
    "title": "The Beauty and Joy of Computing (CS Principles), Part 3"
}