{
    "description": "XSeries Program Overview\n\nCivil War and Reconstruction, which introduces students to the most pivotal era in American history. The Civil War transformed the nation by eliminating the threat of secession and destroying the institution of slavery. It raised questions that remain central to our understanding of ourselves as a people and a nation – the balance of power between local and national authority, the boundaries of citizenship, and the meanings of freedom and equality. This XSeries will examine the causes of the war, the road to secession, the conduct of the Civil War, the coming of emancipation, and the struggle after the war to breathe meaning into the promise of freedom for four million emancipated slaves. One theme throughout the series is what might be called the politics of history – how the world in which a historian lives affects his or her view of the past, and how historical interpretations reinforce or challenge the social order of the present.\n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about The Civil War and Reconstruction\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Learn about the political, social, and economic changes in the Union and the Confederacy and the Civil War’s long-term economic and intellectual impact. Learn about the political, social, and economic changes in the Union and the Confederacy and the Civil War’s long-term economic and intellectual impact. Discover how the issue of slavery came to dominate American politics, and how political leaders struggled and failed to resolve the growing crisis in the nation.",
    "instructors": [
        "Eric Foner",
        "Tim Shenk",
        "CCNMTL"
    ],
    "length": "3 courses; 8 - 10 weeks\/course",
    "effort": "6 - 8 hours\/week",
    "prices": "$50\/course",
    "institutions": "ColumbiaX",
    "subjects": "History",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/civil-war-reconstruction"
}