{
    "source": "Coursera",
    "description": "This is not a class as it is commonly understood; it is the set of materials from a summer school offered by Caltech and JPL, in the sense used by most scientists: an intensive period of learning of some advanced topics, not on an introductory level.&nbsp;The school will cover a variety of topics, with a focus on practical \ncomputing applications in research: the skills needed for a \ncomputational (\"big data\") science, not computer science. &nbsp;The specific \nfocus will be on applications in astrophysics, earth science (e.g., \nclimate science) and other areas of space science, but with an emphasis \non the general tools, methods, and skills that would apply across other \ndomains as well.&nbsp; It is aimed at an audience of practicing researchers who already have a strong background in computation and data analysis.&nbsp; The lecturers include computational science and \ntechnology experts from Caltech and JPL.Students can evaluate their own progress, but there will be no tests, exams, and no formal credit or certificates will be offered. This is an intensive, advanced summer school (in the sense used by scientists) in some of the methods of computational, data-intensive science.  It covers a variety of topics from applied computer science and engineering, and statistics, and it requires a strong background in computing, statistics, and data-intensive research.\n",
    "contents": "The anticipated schedule of lectures (subject to changes):Each bullet bellow corresponds to a set of materials that includes approximately 2 hours of video lectures, various links and supplementary materials, plus some on-line, hands-on exercises.1. Introduction to the school.&nbsp; Software architectures.&nbsp; Introduction to Machine Learning.2. Best programming practices.&nbsp; Information retrieval.3. Introduction to R.&nbsp; Markov Chain Monte Carlo.4. Statistical resampling and inference.5. Databases.6. Data visualization.7. Clustering and classification.8. Decision trees and random forests.9. Dimensionality reduction.&nbsp; Closing remarks.",
    "requirements": "The students should have a solid background in scientific computing and data analysis.&nbsp; The target audience includes upper-level undergraduate and graduate students, postdocs, or other researchers in science and technology fields.&nbsp; Good programming skills in at least one modern computer language (or the ability to quickly learn one) are needed, as well as some knowledge of statistics, and some experience with scientific data analysis.&nbsp; Background knowledge in computer science is a plus.",
    "effort": "20-25 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/bigdataschool",
    "title": "The Caltech-JPL Summer School on Big Data Analytics",
    "courseraId": "1973",
    "subjects": "Statistics and Data Analysis"
}