{
    "description": "Enhance your software skills and capabilities from a software innovation perspective. Do you have a career in the software industry? Join us for this 8-week course to find out.\n\nThe world is becoming increasingly digital and software is everywhere. Every company is affected by software so having the knowledge to succeed in this industry is essential. This course will introduce the skills necessary to create software. We will explain how people from different professions can work together in order to create innovative software. We will also present the most important activities for generating effective software products and services to meet tomorrow’s demands. Gain the skills needed to succeed as a software designer and software architect.\n\tUnderstand the  role of a software architect in the digital world\n\tLearn the importance of capturing all essential user needs and applying the  “Do it yourself” method to plan and build software pieces\n\tExplore the software design and testing activities addressing the new challenges of tech-focused times\n\tUnderstand new interaction paradigms, creativity and design methods that move the focus from the software to the humans who use it",
    "contents": "Course Syllabus\n        PART I: Decoding the talents of an architect in the digital world.\n\tPART 2: Envisioning needs and wishes.\n\tPART 3:  Discovering how to build an idea.\n\tPART 4: Shifting the focus from software-centric to human-centric development.",
    "instructors": [
        "Antonio de Amescua",
        "Maribel Sánchez Segura",
        "Juan Llorens",
        "Paloma Díaz",
        "Manuel Velasco",
        "Javier García-Guzmán"
    ],
    "requirements": "Curiosity\n\tContinuous learning\n\tDesire to excel",
    "length": "8 weeks",
    "effort": "2 - 3 hours\/week",
    "prices": "Free\n        \n         \n         Add a Verified Certificate for $50",
    "institutions": "UC3Mx",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/software-architect-code-building-digital-uc3mx-inf-1x",
    "title": "The Software Architect Code: Building the Digital World"
}