{
    "description": "SAP’s clients are increasingly interested in adopting cloud solutions. The prediction from IDC is that more than 65% of enterprise IT organizations will commit to hybrid cloud technologies before 2016. Companies that use SAP solutions can now choose between on-premise, cloud, and hybrid deployments – a combination of both on-premise and cloud. This freedom of choice allows companies to transform at their own pace, following their business priorities and markets, which can change at any time.If you’re asking yourself questions like “how do I get there?”, “what does the hybrid deployment model mean for my security and operations teams?” and “how can I ensure sufficient integration between the different environments?” then this openSAP course is for you. The questions are highly company-specific, so there is no one correct answer to them all. However, the aim of this openSAP course is to give you an understanding for what running a hybrid landscape means for integration, security, and operations, and how you can start your own hybrid transformation journey.Week 1 will provide you with an introduction to cloud and hybrid deployments.Week 2 offers a deep dive into the topic of integration, where we will give you an overview of the different integration technologies before going on to compare them.In week 3, we will talk about the security aspects you should consider in order to ensure that the data in your hybrid landscape is secure.In week 4, the focus will be on operating the new environment. How do operative tasks change when you move from an on-premise environment to a hybrid landscape?The course concludes with week 5 – the transformation. Here, the topics of adoption, organizational impact, strategy, and roadmap will be discussed.",
    "instructors": "Rob Glickman",
    "url": "https:\/\/www.coursetalk.com\/providers\/opensap\/courses\/transformation-to-hybrid-landscapes",
    "title": "Transformation to Hybrid Landscapes",
    "language": "en",
    "source": "coursetalk"
}