{
    "source": "Coursera",
    "description": "This course provides an overview of the United Kingdom's 2015 general election. Join us right up to and through election night as we explore the politics, issues and numbers that give British politics its enduring appeal. This year's election is one of the most exciting and unpredictable in recent memory. Old Westminster certainties like majority governments and the two-party system seem to be under increasing strain. Meanwhile, the implications rise of the Scottish National Party and the decline of the Liberal Democrats are still unclear.The course is designed both as a general introduction to UK politics for people all over the world and as a place for British citizens to come to find the information they need to make an informed choice. With expert commentary from Edinburgh University academics, we will try to shed light on the issues at stake, the electoral system and the territorial implications of this election. This course is unique because it happens in 'real time': we will change the course in response to events in the UK and your feedback. Tell us what you want to know and we'll try to include it in the course materials and in our weekly interactive live-streamed seminar Q&amp;A.Join us on Twitter - we're using the hashtag&nbsp;#ge15ed Learn about the UK's 2015 general election: how does the system work, what is at stake, and how will it affect you? Whether or not you have a vote, if you want to gain a better understanding of UK polls and political issues, join us for discussion and up-to-date insight before and after polling day.",
    "contents": "Week One (How does it work?): We will begin by explaining the UK's political system and how the First Past the Post electoral system works. We'll also consider how British politics has changed in the last five years.Week Two (What is at stake?): We will examine the main issues in the election campaign and the parties' stances. Who is in the running and what do they want?Week Three (Why did that happen?): We will analyse the results and try to set out the governing options in the House of Commons. What do the results tell us about the state of British politics?",
    "effort": "1-3 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/ge2015",
    "title": "Understanding the UK's 2015 General Election",
    "courseraId": "2848",
    "subjects": "Statistics and Data Analysis"
}