{
    "description": "XSeries Program Overview \n\nThis 3-course XSeries examines the modern history of Japan, from the 1850s to 1930s, as well as that of postwar Tokyo through the rich historical visual records.\n \nThe first course, “Visualizing Japan (1850s-1930s): Westernization, Protest, Modernity,” considers methodologies historians use to “visualize” the past and look into some historical events such as Commodore Perry’s 1853-54 expedition to Japan and Tokyo’s 1905 Hibiya Riot. It also examines modernity, as seen in the archives of the major Japanese cosmetics company, Shiseido.\n \nThe second and third courses, Visualizing Postwar Tokyo, Parts 1 & 2, focus on the changes and developments of Tokyo after World War II, as well as the gazes exchanged in postwar Tokyo, as a place of visualities.\n \nThis XSeries gives a great overview of Japan’s transition into the modern world and the transformation of postwar Tokyo.\n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about Visualizing Japan\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide A MITx\/HarvardX collaboration, this course explores Japan’s transition into the modern world through the historical visual record. Analyze the history of change and development in postwar Tokyo from different perspectives using archived photographs, films, and TV programs. Identify the geopolitics historically involved in the practice of “visualizing postwar Tokyo.”",
    "instructors": [
        "John W. Dower",
        "Andrew Gordon",
        "Shigeru Miyagawa",
        "Gennifer Weisenfeld",
        "Shunya Yoshimi"
    ],
    "length": "3 courses – 4 - 6 weeks\/course",
    "effort": "3 - 6 hours\/week",
    "prices": "$49 or $75\/course",
    "institutions": "HarvardX\n        \n          MITx\n        \n          UTokyoX",
    "subjects": "Art & Culture\n          \n        \n          \n            History\n          \n        \n          \n            Social Sciences",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/visualizing-japan"
}