{
    "description": "XSeries Program Overview\n\nSafe water supply and hygienic water treatment are prerequisites for the well-being of communities all over the world. This Water XSeries, offered by the water management experts of TU Delft, will give you a unique opportunity to gain access to world-class knowledge and expertise in this field.\n\nThis 3-course series will cover questions such as: How does climate change affect water cycle and public safety? How to use existing technologies to treat groundwater and surface water so we have safe drinking water? How do we take care of sewage produced in the cities on a daily basis? You will learn what are the physical, chemical and biological processes involved; carry out simple experiments at home; and have the chance to make a basic design of a drinking water treatment plant\n\n            \n              \n                \n                  \n                    \n                    \n                  \n                  See more\n                  \n                    about Water Management\n                  \n                \n\n                \n                  \n                    \n                    \n                  \n                  Hide Learn about urban water services, focusing on conventional technologies for drinking water treatment. Learn about urban water services, focusing on basic sewage treatment technologies. Explore how climate change, water availability, and engineering innovation are key challenges for our planet.",
    "instructors": [
        "Jules van Lier",
        "Merle de Kreuk",
        "Luuk Rietveld",
        "Doris van Halem",
        "Anke Grefte",
        "Nick van de Giesen",
        "Herman Russchenberg",
        "Hubert Savenije",
        "Marcel Stive"
    ],
    "length": "3 courses - 7 weeks\/course",
    "effort": "6 - 8 hours\/week",
    "prices": "$50\/course",
    "institutions": "DelftX",
    "subjects": "Environmental Studies\n          \n        \n          \n            Biology & Life Sciences\n          \n        \n          \n            Engineering",
    "language": "English",
    "url": "https:\/\/www.edx.org\/xseries\/water-management"
}