{
    "source": "Coursera",
    "description": "The past decade has witnessed the successful of application of many AI techniques used at `web-scale’, on what are popularly referred to as big data platforms based on the map-reduce parallel computing paradigm and associated technologies such as distributed file systems, no-SQL databases and stream computing engines. Online advertising, machine translation, natural language understanding, sentiment mining, personalized medicine, and national security are some examples of such AI-based web-intelligence applications that are already in the public eye. Others, though less apparent, impact the operations of large enterprises from sales and marketing to manufacturing and supply chains. In this course we explore some such applications, the AI\/statistical techniques that make them possible, along with parallel implementations using map-reduce and related platforms.\n\nThis course was offered thrice during Fall 2012, Spring 2012 and Fall 2013; in Fall of both years it was also taken for credit at IIT Delhi and IIIT Delhi. During this period, I also wrote a book to elucidate the ideas discussed in the course at a 'popular' level:\n\nThe Intelligent Web: Search, Smart Algorithms and Big Data published by Oxford University Press, UK, in November 2013.\n\n Now in this edition, the course is being offered in 'self-study' mode. This course is about building 'web-intelligence' applications exploiting big data sources arising social media, mobile devices and sensors, using new big-data platforms based on the 'map-reduce' parallel programming paradigm. In the past, this course has been offered at the Indian Institute of Technology Delhi as well as the Indraprastha Institute of Information Technology Delhi.",
    "contents": "Introduction and Overview&nbsp;\nLook: Search, Indexing and Memory\nListen: Streams, Information and Language, Analyzing Sentiment and Intent\nLoad: Databases and their Evolution, Big data Technology and TrendsProgramming: Map-Reduce\nLearn: Classification, Clustering, and Mining, Information Extraction\nConnect: Reasoning: Logic and its Limits, Dealing with UncertaintyProgramming: Bayesian Inference for Medical Diagnostics\nPredict: Forecasting, Neural Models, Deep Learning, and Research TopicsData Analysis: Regression and&nbsp;Feature Selection",
    "requirements": "Basic programming, SQL and data structures\nExposure to probability, statistics and matrices",
    "effort": "3-4 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/bigdata",
    "title": "Web Intelligence and Big Data",
    "courseraId": "145",
    "subjects": "Computer Science: Artificial Intelligence"
}