{
    "source": "Coursera",
    "description": "This course explores the development of web application architectures from an engineering perspective.&nbsp; We will consider the fundamental design patterns and philosophies associated with modern web application architectures, along with their major components. &nbsp;By the end of this course, I expect you to be able to:Design, develop and deploy a modern web application. &nbsp;This course is not about how to build a pretty web page, it's about how to build and deploy the full stack of protocols and technologies associated with a complete web app. &nbsp;That said, it is not possible for you to become an expert in this area in a few weeks. My goal, rather, is to put you on the right path by providing a solid foundation and framework for understanding web applications, allowing you to dig deeper and learn more on your own. The next bullet points describe how we're going to do this.Understand the major architectural components in web apps, and how they fit together. &nbsp;Modern web apps are complex. &nbsp;A typical application has a database along with numerous scripts on one end of the web stack, a web server in the middle that delivers information over the Internet, and a user's browser on the other end of the web stack. &nbsp;Even getting started in trying to understand these components can be overwhelming. Consider just the programming languages involved in a typical web stack: from the database (SQL), to the web server (scripting language), to the browser (JavaScript, HTML, CSS), we're dealing with five different programming languages, not to mention the protocols they're operating over\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n–&nbsp;and you need to know a little about them too! We'll introduce a number of software design patterns throughout the course that are aimed at helping you to manage this complexity.Use Ruby on Rails. &nbsp;We're going to learn about web apps through the Ruby on Rails framework.&nbsp;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRails is a framework for creating web\napplications that is built on top of the Ruby programming language.&nbsp;I believe this is one of the best frameworks\nfor learning about web applications, and it's also proving highly successful as\na platform for commercial offerings.&nbsp;\nThat said, there are many other frameworks available, and the concepts\nyou will learn using Rails are transferable to these other frameworks.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBetter understand modern software engineering\npractice.&nbsp; We’ll be using the latest tools and practices in\nsoftware development, source code control, testing, and application\ndeployment.&nbsp;This will include exposure\nto agile development practices, the numerous tools that software engineers are expected to know how to use, and the cloud-based resources that are\nbecoming increasingly important in web applications.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp; Learn how to build and deploy modern web application architectures – applications that run over the Internet, in the \"cloud,\" using a browser as the user interface.",
    "contents": "&nbsp;Week One&nbsp;–&nbsp;Module 1: Introduction and Background&nbsp;&nbsp; Lecture 1: Historical Perspective&nbsp; Lecture 2: What is a Web Application?&nbsp; Lecture 3: Web 1.0, 2.0, 3.0 Application Architectures&nbsp; Lecture 4: Design Patterns&nbsp; Lecture 5: Setting up Your Development EnvironmentWeek Two&nbsp;–&nbsp;Module 2: Ruby on Rails&nbsp;&nbsp;Lecture 1:&nbsp;Rails Overview&nbsp; Lecture 2: Your First Rails App&nbsp; Lecture 3: The Blog App&nbsp;– Iteration 1&nbsp; Lecture 4: Rails Philosophy&nbsp; Lecture 5: Version Control&nbsp; Lecture 6: Git and RailsWeek Three&nbsp;–&nbsp;Module 3: Database Interactions&nbsp;&nbsp;Lecture 1:&nbsp;Relational Databases&nbsp; Lecture 2: Databases in Rails&nbsp; Lecture 3: The Active Record Design Pattern&nbsp; Lecture 4:&nbsp;The Blog App&nbsp;– Iteration 2 (Associations)&nbsp; Lecture 5:&nbsp;The Blog App&nbsp;– Iteration 3 (Validations)Week Four&nbsp;–&nbsp;Module 4: The Ruby Programming Language&nbsp; Lecture 1: Ruby Background&nbsp; Lecture 2: Classes and Inheritance&nbsp; Lecture 3: Objects and Variables&nbsp; Lecture 4:&nbsp;Strings, Regular Expressions and Symbols&nbsp; Lecture 5:&nbsp;Expressions and Control Structures&nbsp; Lecture 6: Collections, Blocks and IteratorsWeek Five –&nbsp;Module 5: Middleware&nbsp; Lecture 1: What is Middleware?&nbsp; Lecture 2: The Hypertext Transfer Protocol (HTTP)&nbsp;–&nbsp;Introduction&nbsp; Lecture 3: HTTP – Request&nbsp; Lecture 4:&nbsp;HTTP&nbsp;–&nbsp;Response&nbsp; Lecture 5:&nbsp;The Model-View-Controller (MVC) Design Pattern&nbsp; Lecture 6:&nbsp;Rails Controllers&nbsp;–&nbsp;Request Handling&nbsp; Lecture 7:&nbsp;Rails Controllers&nbsp;–&nbsp;Response&nbsp; Lecture 8:&nbsp;MVC Implementation in Rails&nbsp; Lecture 9:&nbsp;The Blog App&nbsp;–&nbsp;Iteration 4Week Six –&nbsp;Module 6: Presentation\/User Interface&nbsp; Lecture 1: Introduction and Background&nbsp; Lecture 2: HTML&nbsp;–&nbsp;Basic Syntax&nbsp; Lecture 3: HTML – Document Structure&nbsp; Lecture 4:&nbsp;HTML – Forms&nbsp; Lecture 5: Dynamic Content&nbsp; Lecture 6: Cascading Style Sheets (CSS)&nbsp; Lecture 7: JavaScript and jQuery&nbsp; Lecture 8: Ajax&nbsp; Lecture 9:&nbsp;The Blog App&nbsp;–&nbsp;Iteration 5",
    "requirements": "This is a rigorous course that will involve a\nsignificant amount of programming and additional reading on your own in order\nto get the most out of the class.  I\nexpect you to be proficient in some object-oriented programming language, e.g.\nC++, C#, Python, Java, or Ruby.   Don’t worry if\nyou don’t know Ruby or Ruby on Rails at the moment, we’ll teach it to you as a part of\nthe course.",
    "effort": "6-9 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/webapplications",
    "title": "Web Application Architectures",
    "courseraId": "948",
    "subjects": "Computer Science: Software Engineering, Information, Tech & Design, Engineering"
}