{
    "description": "You may already be an avid user of the Web, but this introduction to Web Science will help you better understand it as both a social and technical system - a global information infrastructure, built from the interactions of people and technologies.\n\nThis free online course is based on our experience of trying to understand how the Web has grown and changed through technical innovation, economics, politics and everyday use.\n\nExplore the past and future of the Web\n\nIn Week 1, we’ll ask what would happen if the Web was switched off right now. We’ll use this question to explore the history of the Internet and find out why we’re so dependent on it today. You’ll have the opportunity to contribute to the course, by telling us how you use the Web in your part of the world.\n\nIn Week 2, we’ll look to the future, finding out how emerging trends – including big data, the semantic web and the Internet of Things – will change both the infrastructure of the Web and the ways in which we use it.\n\nBy following this course, you will have a greater understanding of the Web and begin to develop skills for the digital era – skills that are useful for everyday life and widely sought by the technology-driven employers of today.\n\nLearn with well-known experts in Web Science\n\nYou’ll learn with well-known experts from the University of Southampton’s Web Science Institute, including lead educators, Professors Leslie Carr and Susan Halford, and contributors, Professors Dame Wendy Hall and Sir Nigel Shadbolt.\n\nThey will provide you with an understanding of the way that the technology of the Web interacts with our economy, society and culture. Further Web Science courses, looking in-depth at topics such as networking and open data, will follow in 2016.",
    "instructors": "Leslie Carr",
    "institutions": "School: \n                                University of Southampton",
    "url": "https:\/\/www.coursetalk.com\/providers\/futurelearn\/courses\/web-science-how-the-web-is-changing-the-world",
    "title": "Web Science: How the Web Is Changing the World",
    "language": "en",
    "source": "coursetalk"
}