{
    "description": "What is graphene? Graphene is the world’s first 2-dimensional material and is the thinnest, strongest, and most flexible material known to exist. A special form of carbon, graphene can conduct electricity and heat better than anything else.\n\nThe course will introduce you to the exciting world of graphene science and technology. You will learn about the fundamentals of graphene and how this material offers new insights into nanotechnology and quantum physics. You will also learn about emerging practical applications for graphene. Topics covered include material properties, electronics, physics, physical chemistry, synthesis and device fabrication and application.\n\nIn order to benefit fully from this course you should have an adequate knowledge of general physics and university level mathematics.\n\nGraphene offers a wealth of potential future applications; in composites, solar cells, sensors, superchargers, etc. The list is endless.\n\nThis course takes a closer look at the particular potential graphene offers within electronics, e.g. optoelectronic devices using graphene produced via chemical vapor deposition (CVD), an industrially compatible technique.\n\nYou should expect to devote 6 hours weekly to the course. Each week features a series of lecture sequences supported by interactive video tutorials and interspersed exercises or problems. Students will work on a homework assignment or quiz each week. We offer an Honor Code Certificate.\n\nContent was developed at Chalmers University of Technology. Chalmers is the coordinator of the Graphene Flagship, EUs biggest research initiative ever. At the Chalmers Graphene Centre research and industry cooperate in the field to achieve interplay and synergies. Explain how to perform graphene material synthesis experiments\n\tAssess if and how graphene can be used in different electronic products to improve, enhance or add new properties\n\tComprehend scientific articles on graphene research\n\tIdentify existing and new areas of graphene application and evaluate its potential\n\tEvaluate whether or not graphene can contribute to your career advancement – be it in academia or industry",
    "instructors": "Jie Sun",
    "requirements": "In order to benefit fully from this course you should have an adequate knowledge of general physics and university level mathematics.\n ",
    "effort": "6 hours\/week",
    "prices": "Free",
    "institutions": "ChalmersX",
    "subjects": "Electronics",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/introduction-graphene-science-technology-chalmersx-chm001x",
    "title": "Introduction to Graphene Science and Technology"
}