{
    "source": "Coursera",
    "description": "The wind is a part of our everyday experience. Anyone who has lived on a coast or even vacationed there is familiar with waves and tides. That these naturally-occurring fluid flows contain energy is intuitively recognizable and indeed technologies to harvest wind and tidal energy were in use centuries ago. Our current quest for sustainable energy sources has led us to refocus once again on the potential of wind, waves and tides. This course will explain and describe the technologies to extract energy from each. The strengths and weaknesses of these various technologies will be discussed and illustrated through case studies of specific installations. Learn how energy is extracted from three naturally occurring fluid flows: wind, waves and tides. Strengths and weaknesses of the various technologies will be discussed and illustrated through case studies of specific installations.",
    "contents": "MODULE 1 - WIND ENERGY•\tPart A &nbsp;Wind sources and influences (week 1)•\tPart B &nbsp;Fundamentals of wind energy technology (week 2)•\tPart C &nbsp;Predicting wind turbine output (week 3)•\tPart D &nbsp;Economic and environmental issues (week 4)•\tPart E &nbsp;Case studies (week 4)MODULE 2 – WAVE ENERGY•\tPart A &nbsp;Wave energy fundamentals (week 5)•\tPart B &nbsp;Wave energy converters (week 6)MODULE 3 – TIDAL ENERGY (week 7)",
    "requirements": "The course is designed as a technical elective for final year undergraduates or beginning graduate students in Mechanical or Chemical Engineering or other engineering programs that cover the prerequisite material. &nbsp;Prerequisites include undergraduate level courses in thermodynamics and fluid mechanics, with some knowledge of heat transfer.",
    "effort": "5-7 hours\/week",
    "language": "en",
    "url": "https:\/\/www.coursera.org\/course\/windwavetide",
    "title": "Wind, Waves and Tides: Alternative Energy Systems",
    "courseraId": "2076",
    "subjects": "Engineering"
}