{
    "description": "Interested in learning how to quickly automate basic administrative functions? Windows PowerShell is rapidly becoming the solution that Operators turn to with its powerful combination of a scripting language, command line speed, and GUI tools.\n\nThis course is an introduction to Windows PowerShell where you'll have an opportunity to learn how to replace manual, repetitive, and time-consuming operations with an automated solution.\n\nIn this course, you'll be introduced to the Windows PowerShell console and the Integrated Scripting Environment (ISE) as the main command line interfaces you'll use to work with PowerShell commands. Learn the importance of the Windows PowerShell Help system as the quickest way to discover the commands and associated syntax you need for the particular task you want to accomplish. Take advantage of the ISE's Intellisense features to learn PowerShell through syntax completion and sorting and filtering commands with the Show Command add-on.\n\nThis course focuses on using the pipeline in Windows PowerShell to construct both simple and more complex commands that you can use to do things like obtaining Active Directory data, and then processing and reporting on that data. Also, learn also how PSProviders and PSDrives work with disparate data sources, such as registry keys, certificates, files, folders, and more.\n\nFor creating reports in Windows PowerShell, you'll learn how to do basic formatting to produce lists and tables and then some more advanced formatting functionality. You'll additionally see how to create custom formatting options like sorting and grouping, and using a grid view to display regular objects in an interactive, graphical grid.\n\nBy the end of this course, you should be well on your way to creating scripts that save you time, accomplish tasks with greater efficiency, and allow you to be even more productive on the job. ​Basic concepts of Windows PowerShell\n\tHow to navigate the Windows PowerShell Help system effectively\n\tAn interactive command line interface\n\tAn understanding of how to work with the Pipeline\n\tHow to create reports\n\tBasic and advanced formatting functionality, to sort, group and create an interactive, graphical grid",
    "instructors": "Rob Linsky",
    "requirements": "Experience with Windows desktop support, maintenance, and troubleshooting.",
    "length": "5 weeks",
    "effort": "2 - 4 hours\/week",
    "institutions": "Microsoft",
    "subjects": "Computer Science",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/windows-powershell-fundamentals-microsoft-inf201x-0",
    "title": "Windows PowerShell Fundamentals"
}