{
    "description": "How does cellular technology enable massive surveillance? Do users have rights against surveillance? How does surveillance affect how we use cellular and other technologies? How does it affect our democratic institutions? Do you know that the metadata collected by a cellular network speaks volumes about its users? In this course you will explore all of these questions while investigating related issues in WiFi and Internet surveillance. The issues explored in this course are at the intersection of networking technology, law, and sociology and will appeal to anyone interested in the technical, political, and moral questions inherent in the use of information networks. The course will include broad overviews for the novice, while pointing to the detailed resources needed for those engaged in the development of corporate or governmental policies.\n\nFAQ\n\n\n\tIs there a required textbook?\n\n\t\n\t\t​No. A list of supplemental resources, including textbooks, will be provided. The textbook, Cellular Convergence and the Death of Privacy, is optional.\n\t\t\n\t\n\t\n\tHow much time will I spend on the course during the week?\n\n\t\n\t\tExpect to spend 4-8 hours per week. This depends on a number of factors, including how much you want to engage with the material and the level of understanding you desire.\n\t\t\n\t\n\t\n\tDo I need to have taken an electrical and computer engineering course before? \n\n\t\n\t\tNo. Though there will be discussion of electrical and computer engineering (ECE) ideas, the professor will assume no prior ECE training.\n\t\t\n\t\n\t\n\tI am not familiar with U.S. or European history but I am interested in how the law regarding cell phones works. Can I take this course?\n\n\t\n\t\tYes. I will have relevant links to helpful background material for each section that should make it possible for those with no knowledge of U.S. or European history to take the class.\n\t\t\n\t\n\t\n\tIs this class about building a network?\n\n\t\n\t\tThis class is primarily about how historical privacy law has made it possible for current information technologies to be used to collect data and conduct surveillance rather than how to build a network. While the course will touch on important engineering developments and information technology uses, this class will focus more on the intersection of networking technology, law, and sociology. If you want to know how cell phones collect data and why this data can be used in court, this is the class for you.\n\t\t\n\t\n\t\n\tWill certificates be awarded?\n\n\t\n\t\tYes. If you complete the work and achieve a passing grade in the course, you can earn a Honor Code Certificate, which indicates that you have completed the course successfully. Certificates will be issued by edX under the name of CornellX, designating the institution from which the course originated.\n\t\t\n\t\n\t\n\tWhat are the learning outcomes of this course?\n\n\t\n\t\tUpon completion of this course, students will be able to:\n\n\t\t\n\t\t\tExplain the basic function of cellular telephone networks, WiFi, and other networking technologies.\n\t\t\t\n\t\t\t\n\t\t\tExplain the evolution of privacy rights through the U.S. constitution's 4th amendment, particularly as applied to content and context surveillance\n\t\t\t\n\t\t\t\n\t\t\tIdentify types of cryptography used to secure wired and wireless networks.\n\t\t\t\n\t\t\t\n\t\t\tConsider the implications of different forms of surveillance and how they impact an individual's privacy in society.\n\t\t\t\n\t\t\t\n\t\t\tEvaluate contemporary surveillance and security decisions\/ laws.\n\t\t\t\n\t\t\t\n\t\t\tIncrease their ability to apply ethical thinking and judgment to a wide range of privacy and surveillance situations.\n\t\t\t\n\t\t\t\n\t\t\tInterpret how using complex and powerful technologies to collect personal data can impact individuals, corporations, markets, and societies.\n\t\t\t  Explain the basic function of cellular telephone networks, WiFi, and other networking technologies.\n\tExplain the evolution of privacy rights through the U.S. constitution's 4th amendment, particularly as applied to content and context surveillance.\n\tIdentify types of cryptography used to secure wired and wireless networks.\n\tConsider the implications of different forms of surveillance and how they impact an individual's privacy in society.\n\tEvaluate contemporary surveillance and security decisions\/laws.\n\tIncrease their ability to apply ethical thinking and judgment to a wide range of privacy and surveillance situations.\n\tInterpret how using complex and powerful technologies to collect personal data can impact individuals, corporations, markets, and societies.",
    "instructors": "Stephen B. Wicker",
    "requirements": "None.",
    "length": "10 weeks",
    "effort": "4 hours\/week",
    "prices": "Free",
    "institutions": "CornellX",
    "subjects": "Social Sciences",
    "language": "English",
    "url": "https:\/\/www.edx.org\/course\/wiretaps-big-data-privacy-surveillance-cornellx-engri1280x",
    "title": "Wiretaps to Big Data: Privacy and Surveillance in the Age of Interconnection"
}