{
    "description": "Investigate how the early days of aviation gripped the imagination of the general public, galvanised industry and excited far-sighted members of the military, with this free online course from the University of Birmingham’s Centre for War Studies.\n\nAviation evolved rapidly during WW1, with modern and more effective aircraft soon replacing the very basic machines that took to the skies in 1914.\n\nWe’ll look at the innovations that turned the aeroplane into a machine of war and how British factories developed to supply the Western Front with aircraft and ammunition. We’ll examine how the aeroplane became commercially viable, with passenger and mail routes starting to appear, and how the government tried - and failed - to regulate the aviation industry.\n\nYou’ll learn with Dr Peter Gray, a former commander of 101 Squadron and Director of Defence Studies for the RAF, who now teaches Birmingham’s MA in Air Power - one of several postgraduate courses the university offers in military history and World War 1 studies.\n\nProduced in collaboration with the BBC and filmed at the Royal Air Force Museum at Hendon, this course draws on an array of first-hand interviews and archive material.\n\nYou can find out more in Peter’s posts on our blog - one looking at the first flights of World War 1, the other commemorating the Battle of Britain.\n\nThis course is part of a series designed in partnership with the BBC to commemorate the war.\n\n\n    World War 1: Paris 1919 - A New World Order? (University of Glasgow)\n  \n  \n    World War 1: Changing Faces of Heroism (University of Leeds)\n  \n  \n    World War 1: Trauma and Memory (The Open University)\n  \nYou may also be interested in:\n\n\nWorld War 1: A History in 100 Stories (Monash University)\n(Image © John Young. Photo credit: Royal Air Force Museum)\n(Black and white newsreel footage in the course trailer © British Pathé)",
    "instructors": "Peter Gray",
    "institutions": "School: \n                                University of Birmingham",
    "url": "https:\/\/www.coursetalk.com\/providers\/futurelearn\/courses\/world-war-1-aviation-comes-of-age",
    "title": "World War 1: Aviation Comes of Age",
    "language": "en",
    "source": "coursetalk"
}